/************************************************
 * 2020-11-16
 * star@biechu.com
 * 天赋模拟器
 ************************************************/

;($ => {
	const talentData = {
		druid: [
			{
				text: '平衡',
				icon: 'Spell_Nature_StarFall',
				texture: 'Balance',
				talent: {
					0: {
						name: '星光之怒',
						icon: 'Spell_Nature_AbolishMagic',
						rank: ['使你的愤怒和星火术的施法时间减少0.1秒。', '使你的愤怒和星火术的施法时间减少0.2秒。', '使你的愤怒和星火术的施法时间减少0.3秒。', '使你的愤怒和星火术的施法时间减少0.4秒。', '使你的愤怒和星火术的施法时间减少0.5秒。']
					},
					1: {
						name: '自然之握',
						icon: 'Spell_Nature_NaturesWrath',
						rank: ['<i class="Fl">瞬发</i><i class="Fr">1分钟冷却时间</i>\
						<i class="Cb">激活之后，任何击中施法者的敌人都有35%的几率被施展纠缠根须（等级1）。只能在户外使用，可生效1次，持续45秒。</i>']
					},
					2: {
						name: '强化自然之握',
						icon: 'Spell_Nature_NaturesWrath',
						rely: 1,
						rank: ['使你的自然之握纠缠敌人的几率提高15%。', '使你的自然之握纠缠敌人的几率提高30%。', '使你的自然之握纠缠敌人的几率提高45%。', '使你的自然之握纠缠敌人的几率提高65%。']
					},
					4: {
						name: '自然控制',
						icon: 'Spell_Nature_StrangleVines',
						rank: ['使你有40%的几率在施放纠缠根须和飓风术时不会因为承受伤害而被打断。', '使你有70%的几率在施放纠缠根须和飓风术时不会因为承受伤害而被打断。', '使你有100%的几率在施放纠缠根须和飓风术时不会因为承受伤害而被打断。']
					},
					5: {
						name: '汇聚星光',
						icon: 'INV_Staff_01',
						rank: ['使你的愤怒和星火术的爆击几率提高2%。', '使你的愤怒和星火术的爆击几率提高4%。']
					},
					6: {
						name: '强化月火术',
						icon: 'Spell_Nature_StarFall',
						rank: ['使你的月火术的伤害和爆击几率提高5%。', '使你的月火术的伤害和爆击几率提高10%。']
					},
					8: {
						name: '荆刺',
						icon: 'Spell_Nature_Thorns',
						rank: ['使你的荆棘术和缠绕根须所造成的伤害提高25%。', '使你的荆棘术和缠绕根须所造成的伤害提高50%。', '使你的荆棘术和缠绕根须所造成的伤害提高75%。']
					},
					10: {
						name: '虫群',
						icon: 'Spell_Nature_InsectSwarm',
						rank: ['敌人被飞虫围绕，攻击命中率降低2%，在12秒内受到总计108点自然伤害。']
					},
					11: {
						name: '自然延伸',
						icon: 'Spell_Nature_NatureTouchGrow',
						rank: ['使你的平衡系法术和精灵之火（野性）的射程延长10%。', '使你的平衡系法术和精灵之火（野性）的射程延长20%。']
					},
					13: {
						name: '复仇',
						icon: 'Spell_Nature_Purge',
						rely: 5,
						rank: ['使你的星火术、月火术和愤怒的爆击伤害提高20%。', '使你的星火术、月火术和愤怒的爆击伤害提高40%。', '使你的星火术、月火术和愤怒的爆击伤害提高60%。', '使你的星火术、月火术和愤怒的爆击伤害提高80%。', '使你的星火术、月火术和愤怒的爆击伤害提高100%。']
					},
					14: {
						name: '星空专注',
						icon: 'Spell_Arcane_StarFire',
						rank: ['使你的愤怒和星火术的施法时间减少0.1秒。', '使你的愤怒和星火术的施法时间减少0.2秒。', '使你的愤怒和星火术的施法时间减少0.3秒。', '使你的愤怒和星火术的施法时间减少0.4秒。', '使你的愤怒和星火术的施法时间减少0.5秒。']
					},
					16: {
						name: '月神指引',
						icon: 'Ability_Druid_LunarGuidance',
						rank: ['使你的法术伤害和治疗效果提高，数值相当于你的智力总值的8%。', '使你的法术伤害和治疗效果提高，数值相当于你的智力总值的16%。', '使你的法术伤害和治疗效果提高，数值相当于你的智力总值的25%。']
					},
					17: {
						name: '自然之赐',
						icon: 'Spell_Nature_NaturesBlessing',
						rank: ['在你的任何法术造成爆击之后获得自然的赐福，使你的下一个法术的施法时间减少0.5秒。']
					},
					18: {
						name: '月光',
						icon: 'Spell_Nature_Sentinal',
						rank: ['使你的月火术、星火术、愤怒、治疗之触、愈合和回春术所消耗的法力值减少3%。', '使你的月火术、星火术、愤怒、治疗之触、愈合和回春术所消耗的法力值减少6%。', '使你的月火术、星火术、愤怒、治疗之触、愈合和回春术所消耗的法力值减少9%。']
					},
					21: {
						name: '月怒',
						icon: 'Spell_Nature_MoonGlow',
						rely: 17,
						rank: ['使你的星火术、月火术和愤怒所能造成的伤害提高2%。', '使你的星火术、月火术和愤怒所能造成的伤害提高4%。', '使你的星火术、月火术和愤怒所能造成的伤害提高6%。', '使你的星火术、月火术和愤怒所能造成的伤害提高8%。', '使你的星火术、月火术和愤怒所能造成的伤害提高10%。']
					},
					22: {
						name: '能量平衡',
						icon: 'Ability_Druid_BalanceofPower',
						rank: ['使你的所有法术命中目标的几率提高2%，你被法术命中的几率降低2%。', '使你的所有法术命中目标的几率提高4%，你被法术命中的几率降低4%。']
					},
					24: {
						name: '梦境',
						icon: 'Ability_Druid_Dreamstate',
						rank: ['每5秒回复一次法力值，数值相当于你的智力值的4%，施法时也可继续生效。', '每5秒回复一次法力值，数值相当于你的智力值的7%，施法时也可继续生效。', '每5秒回复一次法力值，数值相当于你的智力值的10%，施法时也可继续生效。']
					},
					25: {
						name: '枭兽形态',
						icon: 'Spell_Nature_ForceOfNature',
						rank: ['<i class="Fl">22% 基础法力值</i><br>\
						<i class="Fl Cb">瞬发法术</i><br>\
						<i class="Cb">德鲁伊进入枭兽形态，在这种形态下，护甲值提高400%，攻击强度提高，数值相当于你当前等级的150%，半径30码范围内的所有队友的法术爆击几率提高5%。近战攻击有一定几率为你回复法力值，数值取决于攻击强度。枭兽形态下只能施放平衡系的法术。<br>变身可以解除施法者身上的所有变形和移动限制效果。</i>']
					},
					26: {
						name: '强化精灵之火',
						icon: 'Spell_Nature_FaerieFire',
						rank: ['你的精灵之火使目标被近战和远程攻击命中的几率提高1%。', '你的精灵之火使目标被近战和远程攻击命中的几率提高2%。', '你的精灵之火使目标被近战和远程攻击命中的几率提高3%。']
					},
					29: {
						name: '塞纳留斯之怒',
						icon: 'Ability_Druid_TwilightsWrath',
						rank: ['你的星火术所获得的法术伤害加成效果提高4%，愤怒所获得的法术伤害加成效果提高2%。', '你的星火术所获得的法术伤害加成效果提高8%，愤怒所获得的法术伤害加成效果提高4%。', '你的星火术所获得的法术伤害加成效果提高12%，愤怒所获得的法术伤害加成效果提高6%。', '你的星火术所获得的法术伤害加成效果提高16%，愤怒所获得的法术伤害加成效果提高8%。', '你的星火术所获得的法术伤害加成效果提高20%，愤怒所获得的法术伤害加成效果提高10%。']
					},
					33: {
						name: '自然之力',
						icon: 'Ability_Druid_ForceofNature',
						rank: ['<i class="Fl">12% 基础法力值</i><i class="Fr">30码有效距离</i><br>\
						<i class="Fl">瞬发法术</i><i class="Fr">3分钟冷却时间</i>\
						<i class="Cb">召唤3个树人攻击敌人，持续30秒。</i>']
					}
				}
			},
			{
				text: '野性战斗',
				icon: 'Ability_Racial_BearForm',
				texture: 'FeralCombat',
				talent: {
					1: {
						name: '凶暴',
						icon: 'Ability_Hunter_Pet_Hyena',
						rank: ['使你的重殴、横扫、爪击、斜掠和裂伤技能的怒气或能量消耗减少1点。', '使你的重殴、横扫、爪击、斜掠和裂伤技能的怒气或能量消耗减少2点。', '使你的重殴、横扫、爪击、斜掠和裂伤技能的怒气或能量消耗减少3点。', '使你的重殴、横扫、爪击、斜掠和裂伤技能的怒气或能量消耗减少4点。', '使你的重殴、横扫、爪击、斜掠和裂伤技能的怒气或能量消耗减少5点。']
					},
					2: {
						name: '野性侵略',
						icon: 'Ability_Druid_DemoralizingRoar',
						rank: ['使你的挫志咆哮的攻击强度减弱效果提高8%，凶猛撕咬技能所造成的伤害提高3%。', '使你的挫志咆哮的攻击强度减弱效果提高16%，凶猛撕咬技能所造成的伤害提高6%。', '使你的挫志咆哮的攻击强度减弱效果提高24%，凶猛撕咬技能所造成的伤害提高9%。', '使你的挫志咆哮的攻击强度减弱效果提高32%，凶猛撕咬技能所造成的伤害提高12%。', '使你的挫志咆哮的攻击强度减弱效果提高40%，凶猛撕咬技能所造成的伤害提高15%。']
					},
					4: {
						name: '野性本能',
						icon: 'Ability_Ambush',
						rank: ['使你在熊和巨熊形态下所造成的威胁值提高5%，并在你潜行时降低敌人侦测到你的几率。', '使你在熊和巨熊形态下所造成的威胁值提高10%，并在你潜行时降低敌人侦测到你的几率。', '使你在熊和巨熊形态下所造成的威胁值提高15%，并在你潜行时降低敌人侦测到你的几率。']
					},
					5: {
						name: '野蛮冲撞',
						icon: 'Ability_Druid_Bash',
						rank: ['使你的猛击和突袭技能的击昏效果持续时间延长0.5秒。', '使你的猛击和突袭技能的击昏效果持续时间延长1秒。']
					},
					6: {
						name: '厚皮',
						icon: 'INV_Misc_Pelt_Bear_03',
						rank: ['使你由装备而得到的护甲值提高4%。', '使你由装备而得到的护甲值提高7%。', '使你由装备而得到的护甲值提高10%。']
					},
					8: {
						name: '豹之迅捷',
						icon: 'Spell_Nature_SpiritWolf',
						rank: ['使你在猎豹形态下的移动速度提高15%，只能在户外生效。另外，还可以使你在猎豹形态、熊形态和巨熊形态下的躲闪几率提高2%。', '使你在猎豹形态下的移动速度提高30%，只能在户外生效。另外，还可以使你在猎豹形态、熊形态和巨熊形态下的躲闪几率提高4%。']
					},
					9: {
						name: '野性冲锋',
						icon: 'Ability_Hunter_Pet_Bear',
						rank: ['<i class="Fl">5 怒气</i><i class="Fr">8-25码有效距离</i><br>\
						<i class="Fl">瞬发</i><i class="Fr">15秒冷却时间</i>\
						<i class="Fl Cb">需要熊形态，巨熊形态</i>\
						<i class="Cb">向目标冲锋，使其停止动作，并使其在4秒内不能施放任何法术。</i>']
					},
					10: {
						name: '锋利兽爪',
						icon: 'INV_Misc_MonsterClaw_04',
						rank: ['使你在猎豹、熊或巨熊形态下的爆击几率提高2%.', '使你在猎豹、熊或巨熊形态下的爆击几率提高4%.', '使你在猎豹、熊或巨熊形态下的爆击几率提高6%.']
					},
					12: {
						name: '撕碎攻击',
						icon: 'Spell_Shadow_VampiricAura',
						rank: ['使你的撕碎技能所消耗的能量值减少9点，割伤技能所消耗的怒气值减少1点。', '使你的撕碎技能所消耗的能量值减少18点，割伤技能所消耗的怒气值减少2点。']
					},
					13: {
						name: '猛兽攻击',
						icon: 'Ability_Hunter_Pet_Cat',
						rank: ['使你在猎豹、熊、巨熊和枭兽形态下的近战攻击强度加成提高，数值相当于你的当前等级的50%。', '使你在猎豹、熊、巨熊和枭兽形态下的近战攻击强度加成提高，数值相当于你的当前等级的100%。', '使你在猎豹、熊、巨熊和枭兽形态下的近战攻击强度加成提高，数值相当于你的当前等级的150%。']
					},
					14: {
						name: '原始狂怒',
						icon: 'Ability_Racial_Cannibalize',
						rely: 10,
						rank: ['使你在熊和巨熊形态下对目标产生爆击后，有50%的几率获得5点怒气值。并且，你在猎豹形态下的所有可增加连击点数的技能在对敌人造成爆击之后有50%的几率增加一个额外的连击点数。', '使你在熊和巨熊形态下对目标产生爆击后，有100%的几率获得5点怒气值。并且，你在猎豹形态下的所有可增加连击点数的技能在对敌人造成爆击之后有100%的几率增加一个额外的连击点数。']
					},
					16: {
						name: '野蛮暴怒',
						icon: 'Ability_Druid_Ravage',
						rank: ['使你的爪击、斜掠和裂伤（豹）技能的伤害提高10%。', '使你的爪击、斜掠和裂伤（豹）技能的伤害提高20%。']
					},
					18: {
						name: '精灵之火（野性）',
						icon: 'Spell_Nature_FaerieFire',
						rank: ['<i class="Fl">30码有效距离</i><br>\
						<i class="Fl">瞬发</i><i class="Fr">6秒冷却时间</i>\
						<i class="Fl Cb">需要猎豹形态、熊形态、巨熊形态</i>\
						<i class="Cb">使目标的护甲值降低175点，持续40秒。在效果持续期间，目标无法潜行或隐形。</i>']
					},
					19: {
						name: '治愈本能',
						icon: 'Ability_Druid_HealingInstincts',
						rank: ['使你的治疗法术效果提高，数值相当于你的敏捷值的50%，并使你在猎豹形态下受到的治疗量提高10%。', '使你的治疗法术效果提高，数值相当于你的敏捷值的100%，并使你在猎豹形态下受到的治疗量提高20%。']
					},
					21: {
						name: '野性之心',
						icon: 'Spell_Holy_BlessingOfAgility',
						rely: 13,
						rank: [
							'使你的智力提高4%。另外，当在熊或巨熊形态下，你的耐力提高4%，在猎豹形态下，你的攻击强度提高2%。',
							'使你的智力提高8%。另外，当在熊或巨熊形态下，你的耐力提高8%，在猎豹形态下，你的攻击强度提高4%。',
							'使你的智力提高12%。另外，当在熊或巨熊形态下，你的耐力提高12%，在猎豹形态下，你的攻击强度提高6%。',
							'使你的智力提高16%。另外，当在熊或巨熊形态下，你的耐力提高16%，在猎豹形态下，你的攻击强度提高8%。',
							'使你的智力提高20%。另外，当在熊或巨熊形态下，你的耐力提高20%，在猎豹形态下，你的攻击强度提高10%。'
						]
					},
					22: {
						name: '适者生存',
						icon: 'Ability_Druid_Enrage',
						rank: ['使你的所有属性提高1%，被近战爆击的几率降低1%。', '使你的所有属性提高2%，被近战爆击的几率降低2%。', '使你的所有属性提高3%，被近战爆击的几率降低3%。']
					},
					24: {
						name: '原始坚韧',
						icon: 'Ability_Druid_PrimalTenacity',
						rank: ['使你抵抗昏迷和恐惧效果的几率提高5%。', '使你抵抗昏迷和恐惧效果的几率提高10%。', '使你抵抗昏迷和恐惧效果的几率提高15%。']
					},
					25: {
						name: '兽群领袖',
						icon: 'Spell_Holy_BlessingOfStamina',
						rank: ['在猎豹、熊或巨熊形态下，使半径45码范围内的所有小队成员的远程和近战攻击的爆击几率提高5%。']
					},
					26: {
						name: '强化兽群领袖',
						icon: 'Spell_Holy_BlessingOfStamina',
						rely: 25,
						rank: ['你的兽群领袖技能影响到的目标有100%的几率在打出近战或远程爆击之后恢复2%的生命值。这个治疗效果每6秒只能出现一次。', '你的兽群领袖技能影响到的目标有100%的几率在打出近战或远程爆击之后恢复4%的生命值。这个治疗效果每6秒只能出现一次。']
					},
					30: {
						name: '狩猎天性',
						icon: 'Ability_Druid_PredatoryInstincts',
						rank: ['在猎豹、熊或巨熊形态下，使你的近战爆击伤害提高2%，躲避范围伤害攻击的几率提高3%。', '在猎豹、熊或巨熊形态下，使你的近战爆击伤害提高4%，躲避范围伤害攻击的几率提高6%。', '在猎豹、熊或巨熊形态下，使你的近战爆击伤害提高6%，躲避范围伤害攻击的几率提高9%。', '在猎豹、熊或巨熊形态下，使你的近战爆击伤害提高8%，躲避范围伤害攻击的几率提高12%。', '在猎豹、熊或巨熊形态下，使你的近战爆击伤害提高10%，躲避范围伤害攻击的几率提高15%。']
					},
					33: {
						name: '裂伤',
						icon: 'Ability_Druid_Mangle2',
						rely: 25,
						rank: ['撕扯目标，对其造成伤害，并使其在接下来的12秒内受到的流血伤害提高。这个技能可以在猎豹和巨熊形态下使用。']
					}
				}
			},
			{
				text: '恢复',
				icon: 'Spell_Nature_HealingTouch',
				texture: 'Restoration_Druid',
				talent: {
					1: {
						name: '强化野性印记',
						icon: 'Spell_Nature_Regeneration',
						rank: ['使你的野性印记和野性赐福的效果提高7%。', '使你的野性印记和野性赐福的效果提高14%。', '使你的野性印记和野性赐福的效果提高21%。', '使你的野性印记和野性赐福的效果提高28%。', '使你的野性印记和野性赐福的效果提高35%。']
					},
					2: {
						name: '激怒',
						icon: 'Spell_Nature_UnyeildingStamina',
						rank: ['在你进入熊形态或巨熊形态时有20%的几率获得10点怒气值，或者在进入豹形态时获得40点能量值。', '在你进入熊形态或巨熊形态时有40%的几率获得10点怒气值，或者在进入豹形态时获得40点能量值。', '在你进入熊形态或巨熊形态时有60%的几率获得10点怒气值，或者在进入豹形态时获得40点能量值。', '在你进入熊形态或巨熊形态时有80%的几率获得10点怒气值，或者在进入豹形态时获得40点能量值。', '在你进入熊形态或巨熊形态时有100%的几率获得10点怒气值，或者在进入豹形态时获得40点能量值。']
					},
					4: {
						name: '自然主义',
						icon: 'Spell_Nature_HealingTouch',
						rank: ['使你的治疗之触的施法时间减少0.1秒，你在所有形态下的物理攻击所造成的伤害提高2%。', '使你的治疗之触的施法时间减少0.2秒，你在所有形态下的物理攻击所造成的伤害提高4%。', '使你的治疗之触的施法时间减少0.3秒，你在所有形态下的物理攻击所造成的伤害提高6%。', '使你的治疗之触的施法时间减少0.4秒，你在所有形态下的物理攻击所造成的伤害提高8%。', '使你的治疗之触的施法时间减少0.5秒，你在所有形态下的物理攻击所造成的伤害提高10%。']
					},
					5: {
						name: '自然集中',
						icon: 'Spell_Nature_HealingWaveGreater',
						rank: ['使你在施放愈合、治疗之触或宁静时有14%的几率不会因受到伤害而被打断。', '使你在施放愈合、治疗之触或宁静时有28%的几率不会因受到伤害而被打断。', '使你在施放愈合、治疗之触或宁静时有42%的几率不会因受到伤害而被打断。', '使你在施放愈合、治疗之触或宁静时有56%的几率不会因受到伤害而被打断。', '使你在施放愈合、治疗之触或宁静时有70%的几率不会因受到伤害而被打断。']
					},
					6: {
						name: '自然变形',
						icon: 'Spell_Shadow_Teleport',
						rank: ['使你的所有变形法术所消耗的法力值降低10%。', '使你的所有变形法术所消耗的法力值降低20%。', '使你的所有变形法术所消耗的法力值降低30%。']
					},
					8: {
						name: '强烈',
						icon: 'Spell_Frost_WindWalkOn',
						rank: ['使你在施法时仍保持10%的法力回复速度，并使你在使用激怒技能后立即获得4点怒气值。', '使你在施法时仍保持20%的法力回复速度，并使你在使用激怒技能后立即获得7点怒气值。', '使你在施法时仍保持30%的法力回复速度，并使你在使用激怒技能后立即获得10点怒气值。']
					},
					9: {
						name: '微妙',
						icon: 'Ability_EyeOfTheOwl',
						rank: ['使你的法术造成的威胁值降低4%，并使你的法术被驱散的几率降低6%。', '使你的法术造成的威胁值降低8%，并使你的法术被驱散的几率降低12%。', '使你的法术造成的威胁值降低12%，并使你的法术被驱散的几率降低18%。', '使你的法术造成的威胁值降低16%，并使你的法术被驱散的几率降低24%。', '使你的法术造成的威胁值降低20%，并使你的法术被驱散的几率降低30%。']
					},
					10: {
						name: '清晰预兆',
						icon: 'Spell_Nature_CrystalBall',
						rank: ['<i class="Fl">120 法力值</i><i class="Fl Cb">瞬发法术</i>\
						<i class="Cb">以自然的力量强化德鲁伊的武器，每次近战攻击命中敌人都有一定几率令德鲁伊进入节能施法状态。该状态可以让你的下一个伤害法术、治疗法术或攻击技能所消耗的法力值、怒气值或能量值降低100%。清晰预兆效果可持续30分钟。</i>']
					},
					13: {
						name: '宁静之魂',
						icon: 'Spell_Holy_ElunesGrace',
						rank: ['使你的治疗之触和宁静所消耗的法力值减少2%。', '使你的治疗之触和宁静所消耗的法力值减少4%。', '使你的治疗之触和宁静所消耗的法力值减少6%。', '使你的治疗之触和宁静所消耗的法力值减少8%。', '使你的治疗之触和宁静所消耗的法力值减少10%。']
					},
					14: {
						name: '强化回春术',
						icon: 'Spell_Nature_Rejuvenation',
						rank: ['使你的回春术的效果提高5%。', '使你的回春术的效果提高10%。', '使你的回春术的效果提高15%。']
					},
					16: {
						name: '自然迅捷',
						icon: 'Spell_Nature_RavenForm',
						rely: 8,
						rank: ['<i class="Fl">瞬发</i><i class="Fr">3分钟冷却时间</i>\
						<i class="Cb">激活之后，你的下一个自然法术会成为瞬发法术。</i>']
					},
					17: {
						name: '自然赐福',
						icon: 'Spell_Nature_ProtectionformNature',
						rank: ['你的所有治疗法术的效果提高2%。', '你的所有治疗法术的效果提高4%。', '你的所有治疗法术的效果提高6%。', '你的所有治疗法术的效果提高8%。', '你的所有治疗法术的效果提高10%。']
					},
					19: {
						name: '强化宁静',
						icon: 'Spell_Nature_Tranquility',
						rank: ['使你的宁静法术导致的威胁值降低50%。', '使你的宁静法术导致的威胁值降低100%。']
					},
					20: {
						name: '治疗之触增效',
						icon: 'Ability_Druid_EmpoweredTouch',
						rank: ['提高法术治疗的效果对你的治疗之触有10%的额外加成。', '提高法术治疗的效果对你的治疗之触有20%的额外加成。']
					},
					22: {
						name: '强化愈合',
						icon: 'Spell_Nature_ResistNature',
						rely: 14,
						rank: ['使你的愈合法术的爆击几率提高10%。', '使你的愈合法术的爆击几率提高20%。', '使你的愈合法术的爆击几率提高30%。', '使你的愈合法术的爆击几率提高40%。', '使你的愈合法术的爆击几率提高50%。']
					},
					24: {
						name: '生命之魂',
						icon: 'Spell_Nature_GiftoftheWaterSpirit',
						rank: ['使你的精神总值提高5%。', '使你的精神总值提高10%。', '使你的精神总值提高15%。']
					},
					25: {
						name: '迅捷治愈',
						icon: 'INV_Relics_IdolofRejuvenation',
						rely: 17,
						rank: ['<i class="Fl">16% 基础法力值</i><i class="Fr">40码有效距离</i><br>\
						<i class="Fl">瞬发法术</i><i class="Fr">15秒冷却时间</i>\
						<i class="Cb">吞噬友方目标身上的一个回春术或愈合的持续效果，并立即为其回复生命值，其数值等于12秒的回春效果或18秒的愈合效果。</i>']
					},
					26: {
						name: '天然完美',
						icon: 'Ability_Druid_NaturalPerfection',
						rank: ['你的法术爆击几率提高1%，受到近战和远程爆击之后会获得天然完美效果，使你承受的所有伤害降低2%。可叠加最多3次，效果持续8秒。', '你的法术爆击几率提高2%，受到近战和远程爆击之后会获得天然完美效果，使你承受的所有伤害降低4%。可叠加最多3次，效果持续8秒。', '你的法术爆击几率提高3%，受到近战和远程爆击之后会获得天然完美效果，使你承受的所有伤害降低6%。可叠加最多3次，效果持续8秒。']
					},
					29: {
						name: '回春增效',
						icon: 'Ability_Druid_EmpoweredRejuvination',
						rank: ['提高法术治疗的效果对你的持续治疗法术有4%的额外加成。', '提高法术治疗的效果对你的持续治疗法术有8%的额外加成。', '提高法术治疗的效果对你的持续治疗法术有12%的额外加成。', '提高法术治疗的效果对你的持续治疗法术有16%的额外加成。', '提高法术治疗的效果对你的持续治疗法术有20%的额外加成。']
					},
					33: {
						name: '生命之树',
						icon: 'Ability_Druid_TreeofLife',
						rely: 29,
						rank: ['<i class="Fl">28% 基础法力值</i><br>\
						<i class="Fl">瞬发法术</i>\
						<i class="Cb">德鲁伊变身成为一棵生命之树。在这种形态下，你身边半径45码范围内的所有队友受到的治疗效果提高，数值相当于你的精神总值的25%。你的移动速度降低20%，并且只能施放迅捷治愈、激活、复生和持续性治疗法术，但这些法术所消耗的法力值也降低20%。<br>变身可以解除施法者身上的一切变形和移动限制效果。</i>']
					}
				}
			}
		],
		hunter: [
			{
				text: '野兽掌握',
				icon: 'Ability_Hunter_BeastTaming',
				texture: 'BeastMastery',
				talent: {
					1: {
						name: '强化雄鹰守护',
						icon: 'Spell_Nature_RavenForm',
						rank: [
							'当雄鹰守护处于激活状态时，所有普通的远程攻击都有10%的几率使你的远程攻击速度提高3%，持续12秒。',
							'当雄鹰守护处于激活状态时，所有普通的远程攻击都有10%的几率使你的远程攻击速度提高6%，持续12秒。',
							'当雄鹰守护处于激活状态时，所有普通的远程攻击都有10%的几率使你的远程攻击速度提高9%，持续12秒。',
							'当雄鹰守护处于激活状态时，所有普通的远程攻击都有10%的几率使你的远程攻击速度提高12%，持续12秒。',
							'当雄鹰守护处于激活状态时，所有普通的远程攻击都有10%的几率使你的远程攻击速度提高15%，持续12秒。'
						]
					},
					2: {
						name: '耐久训练',
						icon: 'Spell_Nature_Reincarnation',
						rank: ['使你的宠物的生命值提高2%，你的生命总值提高1%。', '使你的宠物的生命值提高4%，你的生命总值提高2%。', '使你的宠物的生命值提高6%，你的生命总值提高3%。', '使你的宠物的生命值提高8%，你的生命总值提高4%。', '使你的宠物的生命值提高10%，你的生命总值提高5%。']
					},
					4: {
						name: '火力集中',
						icon: 'Ability_Hunter_SilentHunter',
						rank: ['在你的宠物处于激活状态下时，使你所造成的所有伤害提高1%，你的杀戮命令技能的爆击几率提高10%。', '在你的宠物处于激活状态下时，使你所造成的所有伤害提高2%，你的杀戮命令技能的爆击几率提高20%。']
					},
					5: {
						name: '强化灵猴守护',
						icon: 'Ability_Hunter_AspectOfTheMonkey',
						rank: ['使你的灵猴守护提供2%的额外躲闪几率。', '使你的灵猴守护提供4%的额外躲闪几率。', '使你的灵猴守护提供6%的额外躲闪几率。']
					},
					6: {
						name: '厚皮',
						icon: 'INV_Misc_Pelt_Bear_03',
						rank: ['使你的宠物的护甲等级提高7%，你的装备所提供的护甲加成提高4%。', '使你的宠物的护甲等级提高14%，你的装备所提供的护甲加成提高7%。', '使你的宠物的护甲等级提高20%，你的装备所提供的护甲加成提高10%。']
					},
					7: {
						name: '强化复活宠物',
						icon: 'Ability_Hunter_BeastSoothe',
						rank: ['使你的复活宠物法术的施法时间减少3秒，法力值消耗降低20%，宠物复活后的生命值提高15%。', '使你的复活宠物法术的施法时间减少6秒，法力值消耗降低40%，宠物复活后的生命值提高30%。']
					},
					8: {
						name: '寻路',
						icon: 'Ability_Mount_JungleTiger',
						rank: ['使你的猎豹守护和豹群守护的速度加成效果提高4%。', '使你的猎豹守护和豹群守护的速度加成效果提高8%。']
					},
					9: {
						name: '野兽迅捷',
						icon: 'Ability_Druid_Dash',
						rank: ['使你的宠物在户外的移动速度提高30%。']
					},
					10: {
						name: '狂怒释放',
						icon: 'Ability_BullRush',
						rank: ['使你的宠物所造成的伤害提高4%。', '使你的宠物所造成的伤害提高8%。', '使你的宠物所造成的伤害提高12%。', '使你的宠物所造成的伤害提高16%。', '使你的宠物所造成的伤害提高20%。']
					},
					13: {
						name: '强化治疗宠物',
						icon: 'Ability_Hunter_MendPet',
						rank: ['使你的治疗宠物技能所消耗的法力值减少10%，并且有25%的几率每一跳驱散宠物身上的1个诅咒、疾病、魔法或中毒效果。', '使你的治疗宠物技能所消耗的法力值减少20%，并且有50%的几率每一跳驱散宠物身上的1个诅咒、疾病、魔法或中毒效果。']
					},
					14: {
						name: '凶暴',
						icon: 'INV_Misc_MonsterClaw_04',
						rank: ['使你的宠物的爆击几率提高2%。', '使你的宠物的爆击几率提高4%。', '使你的宠物的爆击几率提高6%。', '使你的宠物的爆击几率提高8%。', '使你的宠物的爆击几率提高10%。']
					},
					16: {
						name: '灵魂联结',
						icon: 'Ability_Hunter_SpiritBond',
						rank: ['当你的宠物被激活后，你和你的宠物都会每10秒回复1%的生命值。', '当你的宠物被激活后，你和你的宠物都会每10秒回复2%的生命值。']
					},
					17: {
						name: '胁迫',
						icon: 'Ability_Devour',
						rank: ['<i class="Fl">6% 基础法力值</i><i class="Fr">100码有效距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">1分钟冷却时间</i><br>\
						命令你的宠物在下次击中敌人时进行胁迫，造成大量的威胁值，并使目标昏迷3秒。']
					},
					19: {
						name: '野兽戒律',
						icon: 'Spell_Nature_AbolishMagic',
						rank: ['使你的宠物的集中值回复速度提高50%。', '使你的宠物的集中值回复速度提高100%。']
					},
					20: {
						name: '驭兽者',
						icon: 'Ability_Hunter_AnimalHandler',
						rank: ['使你的骑乘速度提高4%，宠物的攻击命中率提高2%。此骑乘速度加成效果不与其它同类效果叠加。', '使你的骑乘速度提高8%，宠物的攻击命中率提高4%。此骑乘速度加成效果不与其它同类效果叠加。']
					},
					22: {
						name: '狂乱',
						icon: 'INV_Misc_MonsterClaw_03',
						rely: 14,
						rank: ['使你的宠物有20%的几率在对敌人造成爆击后获得攻击速度提高30%的效果，持续8秒钟。', '使你的宠物有40%的几率在对敌人造成爆击后获得攻击速度提高30%的效果，持续8秒钟。', '使你的宠物有60%的几率在对敌人造成爆击后获得攻击速度提高30%的效果，持续8秒钟。', '使你的宠物有80%的几率在对敌人造成爆击后获得攻击速度提高30%的效果，持续8秒钟。', '使你的宠物有100%的几率在对敌人造成爆击后获得攻击速度提高30%的效果，持续8秒钟。']
					},
					24: {
						name: '凶猛灵感',
						icon: 'Ability_Hunter_FerociousInspiration',
						rank: ['当你的宠物打出爆击之后，所有小队成员造成的所有伤害提高1%，效果持续10秒。', '当你的宠物打出爆击之后，所有小队成员造成的所有伤害提高2%，效果持续10秒。', '当你的宠物打出爆击之后，所有小队成员造成的所有伤害提高3%，效果持续10秒。']
					},
					25: {
						name: '狂野怒火',
						icon: 'Ability_Druid_FerociousBite',
						rely: 17,
						rank: ['<i class="Fl">10% 基础法力值</i><i class="Fr">100码有效距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">2分钟冷却时间</i><br>\
						使宠物进入疯狂状态，对目标造成的伤害提高50%，持续18秒。在这种状态下，宠物不会有任何恐惧和怜悯，也无法停止下来，除非被杀死。']
					},
					26: {
						name: '猎豹反射',
						icon: 'Ability_Hunter_CatlikeReflexes',
						rank: ['使你的躲闪几率提高1%，你的宠物的躲闪几率提高3%。', '使你的躲闪几率提高2%，你的宠物的躲闪几率提高6%。', '使你的躲闪几率提高3%，你的宠物的躲闪几率提高9%。']
					},
					30: {
						name: '蛇之迅捷',
						icon: 'Ability_Hunter_SerpentSwiftness',
						rank: ['你的远程攻击速度提高4%，你的宠物的近战攻击速度提高4%。', '你的远程攻击速度提高8%，你的宠物的近战攻击速度提高8%。', '你的远程攻击速度提高12%，你的宠物的近战攻击速度提高12%。', '你的远程攻击速度提高16%，你的宠物的近战攻击速度提高16%。', '你的远程攻击速度提高20%，你的宠物的近战攻击速度提高20%。']
					},
					33: {
						name: '野兽之心',
						icon: 'Ability_Hunter_BeastWithin',
						rely: 25,
						rank: ['当你的宠物激活狂野怒火之后，你也会进入狂暴状态，对目标造成的伤害提高10%，所有法术所消耗的法力值降低20%，效果持续18秒。在这种状态下，你不会有任何恐惧或怜悯，也无法停止下来，除非被杀死。']
					}
				}
			},
			{
				text: '射击',
				icon: 'Ability_Marksmanship',
				texture: 'Marksmanship',
				talent: {
					1: {
						name: '强化震荡射击',
						icon: 'Spell_Frost_Stun',
						rank: ['使你的震荡射击有4%的机会令目标昏迷3秒。', '使你的震荡射击有8%的机会令目标昏迷3秒。', '使你的震荡射击有12%的机会令目标昏迷3秒。', '使你的震荡射击有16%的机会令目标昏迷3秒。', '使你的震荡射击有20%的机会令目标昏迷3秒。']
					},
					2: {
						name: '夺命射击',
						icon: 'Ability_SearingArrow',
						rank: ['使你的远程武器的爆击几率提高1%。', '使你的远程武器的爆击几率提高2%。', '使你的远程武器的爆击几率提高3%。', '使你的远程武器的爆击几率提高4%。', '使你的远程武器的爆击几率提高5%。']
					},
					5: {
						name: '强化猎人印记',
						icon: 'Ability_Hunter_SniperShot',
						rank: ['使你的猎人印记也提供近战攻击强度加成效果，数值相当于远程攻击强度加成的基础值的20%。', '使你的猎人印记也提供近战攻击强度加成效果，数值相当于远程攻击强度加成的基础值的40%。', '使你的猎人印记也提供近战攻击强度加成效果，数值相当于远程攻击强度加成的基础值的60%。', '使你的猎人印记也提供近战攻击强度加成效果，数值相当于远程攻击强度加成的基础值的80%。', '使你的猎人印记也提供近战攻击强度加成效果，数值相当于远程攻击强度加成的基础值的100%。']
					},
					6: {
						name: '效率',
						icon: 'Spell_Frost_WizardMark',
						rank: ['使你施放射击和钉刺技能所消耗的法力值减少2%。', '使你施放射击和钉刺技能所消耗的法力值减少4%。', '使你施放射击和钉刺技能所消耗的法力值减少6%。', '使你施放射击和钉刺技能所消耗的法力值减少8%。', '使你施放射击和钉刺技能所消耗的法力值减少10%。']
					},
					8: {
						name: '直取要害',
						icon: 'Ability_Hunter_GoForTheThroat',
						rank: ['你的远程爆击可以令你的宠物回复25点集中值。', '你的远程爆击可以令你的宠物回复50点集中值。']
					},
					9: {
						name: '强化奥术射击',
						icon: 'Ability_ImpalingBolt',
						rank: ['使你的奥术射击的冷却时间减少0.2秒。', '使你的奥术射击的冷却时间减少0.4秒。', '使你的奥术射击的冷却时间减少0.6秒。', '使你的奥术射击的冷却时间减少0.8秒。', '使你的奥术射击的冷却时间减少1秒。']
					},
					10: {
						name: '瞄准射击',
						icon: 'INV_Spear_07',
						rank: ['<i class="Fl">75 法力值</i><i class="Fr">5-35码距离</i><br><i class="Fl">3秒施法时间</i><br><i class="Fl">6秒冷却时间 + 远程武器攻击速度</i><br><i class="Fl">需要远程武器</i><br>\
						瞄准目标射击，使远程伤害提高870点，并使其受到的治疗效果降低50%。持续10秒钟。']
					},
					11: {
						name: '疾速杀戮',
						icon: 'Ability_Hunter_RapidKilling',
						rank: ['使你的急速射击技能的冷却时间减少1分钟。另外，在杀死一个能够使你获得经验值或荣誉值的敌人之后，你的下一次瞄准射击、奥术射击或自动射击所造成的伤害提高10%，效果持续20秒。', '使你的急速射击技能的冷却时间减少2分钟。另外，在杀死一个能够使你获得经验值或荣誉值的敌人之后，你的下一次瞄准射击、奥术射击或自动射击所造成的伤害提高20%，效果持续20秒。']
					},
					13: {
						name: '强化钉刺',
						icon: 'Ability_Hunter_Quickshot',
						rank: [
							'使你的毒蛇钉刺和翼龙钉刺所造成的伤害提高6%，蝰蛇钉刺所吸取的法力值提高6%，另外还可使你的钉刺被驱散的几率降低6%。',
							'使你的毒蛇钉刺和翼龙钉刺所造成的伤害提高12%，蝰蛇钉刺所吸取的法力值提高12%，另外还可使你的钉刺被驱散的几率降低12%。',
							'使你的毒蛇钉刺和翼龙钉刺所造成的伤害提高18%，蝰蛇钉刺所吸取的法力值提高18%，另外还可使你的钉刺被驱散的几率降低18%。',
							'使你的毒蛇钉刺和翼龙钉刺所造成的伤害提高24%，蝰蛇钉刺所吸取的法力值提高24%，另外还可使你的钉刺被驱散的几率降低24%。',
							'使你的毒蛇钉刺和翼龙钉刺所造成的伤害提高30%，蝰蛇钉刺所吸取的法力值提高30%，另外还可使你的钉刺被驱散的几率降低30%。'
						]
					},
					14: {
						name: '致死射击',
						icon: 'Ability_PierceDamage',
						rely: 10,
						rank: ['使你的远程武器爆击伤害加成提高6%。', '使你的远程武器爆击伤害加成提高12%。', '使你的远程武器爆击伤害加成提高18%。', '使你的远程武器爆击伤害加成提高24%。', '使你的远程武器爆击伤害加成提高30%。']
					},
					16: {
						name: '冲击弹幕',
						icon: 'Spell_Arcane_StarFire',
						rank: ['你的自动射击命中目标后有2%的几率令目标眩晕4秒。', '你的自动射击命中目标后有4%的几率令目标眩晕4秒。', '你的自动射击命中目标后有6%的几率令目标眩晕4秒。']
					},
					17: {
						name: '驱散射击',
						icon: 'Ability_GolemStormBolt',
						rank: ['<i class="Fl">6% 基础法力值</i><i class="Fr">15码距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">30秒冷却时间</i><br><i class="Fl">需要远程武器</i><br>\
						短程射击，对目标造成50%的武器伤害，并使其困惑4秒。任何伤害都会打断该效果。使用之后结束你的攻击。']
					},
					18: {
						name: '弹幕',
						icon: 'Ability_UpgradeMoonGlaive',
						rank: ['使你的多重射击和乱射的伤害提高4%。', '使你的多重射击和乱射的伤害提高8%。', '使你的多重射击和乱射的伤害提高12%。']
					},
					20: {
						name: '战斗经验',
						icon: 'Ability_Hunter_CombatExperience',
						rank: ['使你的敏捷总值提高1%，智力总值提高3%。', '使你的敏捷总值提高2%，智力总值提高6%。']
					},
					23: {
						name: '远程武器专精',
						icon: 'INV_Weapon_Rifle_06',
						rank: ['使你的远程武器伤害提高1%。', '使你的远程武器伤害提高2%。', '使你的远程武器伤害提高3%。', '使你的远程武器伤害提高4%。', '使你的远程武器伤害提高5%。']
					},
					24: {
						name: '精确瞄准',
						icon: 'Ability_Hunter_ZenArchery',
						rank: ['使你的远程攻击强度提高，数值相当于你的智力总值的15%。', '使你的远程攻击强度提高，数值相当于你的智力总值的30%。', '使你的远程攻击强度提高，数值相当于你的智力总值的45%。']
					},
					25: {
						name: '强击光环',
						icon: 'Ability_TrueShot',
						rely: 17,
						rank: ['<i class="Fl">瞬发法术</i><br>\
						使半径45码范围内的小队成员的攻击强度提高50点，直到主动取消。']
					},
					26: {
						name: '强化弹幕',
						icon: 'Ability_UpgradeMoonGlaive',
						rely: 18,
						rank: ['使你的多重射击技能的爆击几率提高4%，并且使你有33%的几率在引导乱射技能时不会因受到伤害而被打断。', '使你的多重射击技能的爆击几率提高8%，并且使你有66%的几率在引导乱射技能时不会因受到伤害而被打断。', '使你的多重射击技能的爆击几率提高12%，并且使你有100%的几率在引导乱射技能时不会因受到伤害而被打断。']
					},
					29: {
						name: '狙击高手',
						icon: 'Ability_Hunter_MasterMarksman',
						rely: 25,
						rank: ['使你的远程攻击强度提高2%。', '使你的远程攻击强度提高4%。', '使你的远程攻击强度提高6%。', '使你的远程攻击强度提高8%。', '使你的远程攻击强度提高10%。']
					},
					33: {
						name: '沉默射击',
						icon: 'Ability_TheBlackArrow',
						rank: ['<i class="Fl">6% 基础法力值</i><i class="Fr">5-35码距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">20秒冷却时间</i><br>\
						射击敌人，对其造成50%的武器伤害，并使其沉默3秒。']
					}
				}
			},
			{
				text: '生存',
				icon: 'Ability_Hunter_SwiftStrike',
				texture: 'Survival',
				talent: {
					0: {
						name: '怪物杀手',
						icon: 'INV_Misc_Head_Dragon_Black',
						rank: ['使你对野兽、巨人和龙类所造成的所有伤害提高1%，对野兽、巨人和龙类所造成的爆击伤害提高1%。', '使你对野兽、巨人和龙类所造成的所有伤害提高2%，对野兽、巨人和龙类所造成的爆击伤害提高2%。', '使你对野兽、巨人和龙类所造成的所有伤害提高3%，对野兽、巨人和龙类所造成的爆击伤害提高3%。']
					},
					1: {
						name: '人型生物杀手',
						icon: 'Spell_Holy_PrayerOfHealing',
						rank: ['使你对人型生物所造成的所有伤害提高1%，对人型生物所造成的爆击伤害提高1%。', '使你对人型生物所造成的所有伤害提高2%，对人型生物所造成的爆击伤害提高2%。', '使你对人型生物所造成的所有伤害提高3%，对人型生物所造成的爆击伤害提高3%。']
					},
					2: {
						name: '鹰眼',
						icon: 'Ability_TownWatch',
						rank: ['使你的远程武器的射程延长2码。', '使你的远程武器的射程延长4码。', '使你的远程武器的射程延长6码。']
					},
					3: {
						name: '野蛮打击',
						icon: 'Ability_Racial_BloodRage',
						rank: ['使你的猛禽一击和猫鼬撕咬的爆击几率提高10%。', '使你的猛禽一击和猫鼬撕咬的爆击几率提高20%。']
					},
					4: {
						name: '诱捕',
						icon: 'Spell_Nature_StrangleVines',
						rank: ['使你的献祭陷阱、冰霜陷阱、爆炸陷阱和毒蛇陷阱有8%的几率困住目标，令他们无法移动，持续4秒。', '使你的献祭陷阱、冰霜陷阱、爆炸陷阱和毒蛇陷阱有16%的几率困住目标，令他们无法移动，持续4秒。', '使你的献祭陷阱、冰霜陷阱、爆炸陷阱和毒蛇陷阱有25%的几率困住目标，令他们无法移动，持续4秒。']
					},
					5: {
						name: '偏斜',
						icon: 'Ability_Parry',
						rank: ['使你的招架几率提高1%。', '使你的招架几率提高2%。', '使你的招架几率提高3%。', '使你的招架几率提高4%。', '使你的招架几率提高5%。']
					},
					6: {
						name: '强化摔绊',
						icon: 'Ability_Rogue_Trip',
						rank: ['使你的摔绊技能有7%的几率令目标在5秒内无法移动。', '使你的摔绊技能有14%的几率令目标在5秒内无法移动。', '使你的摔绊技能有20%的几率令目标在5秒内无法移动。']
					},
					8: {
						name: '灵巧陷阱',
						icon: 'Spell_Nature_TimeStop',
						rank: ['使你的冰冻陷阱和冰霜陷阱的效果持续时间提高15%，献祭陷阱和爆炸陷阱所造成的伤害提高15%，毒蛇陷阱所召唤的毒蛇数量提高15%。', '使你的冰冻陷阱和冰霜陷阱的效果持续时间提高30%，献祭陷阱和爆炸陷阱所造成的伤害提高30%，毒蛇陷阱所召唤的毒蛇数量提高30%。']
					},
					9: {
						name: '生存专家',
						icon: 'Spell_Shadow_Twilight',
						rank: ['使你的生命值上限提高2%。', '使你的生命值上限提高4%。', '使你的生命值上限提高6%。', '使你的生命值上限提高8%。', '使你的生命值上限提高10%。']
					},
					10: {
						name: '威慑',
						icon: 'Ability_Whirlwind',
						rank: ['<i class="Fl">瞬发</i><i class="Fr">5分钟冷却时间</i><br><br>激活之后，使你的躲闪和招架几率提高25%，持续10秒。']
					},
					12: {
						name: '陷阱掌握',
						icon: 'Ability_Ensnare',
						rank: ['使敌人抵抗你陷阱效果的几率降低5%。', '使敌人抵抗你陷阱效果的几率降低10%。']
					},
					13: {
						name: '稳固',
						icon: 'Ability_Kick',
						rank: ['使你的攻击命中敌人的几率提高1%，并使你抵抗移动限制效果的几率提高5%。', '使你的攻击命中敌人的几率提高2%，并使你抵抗移动限制效果的几率提高10%。', '使你的攻击命中敌人的几率提高3%，并使你抵抗移动限制效果的几率提高15%。']
					},
					15: {
						name: '强化假死',
						icon: 'Ability_Rogue_FeignDeath',
						rank: ['使敌人抵抗你的假死技能的几率降低2%。', '使敌人抵抗你的假死技能的几率降低4%。']
					},
					16: {
						name: '生存本能',
						icon: 'Ability_Hunter_SurvivalInstincts',
						rank: ['受到的所有伤害降低2%，攻击强度提高2%。', '受到的所有伤害降低4%，攻击强度提高4%。']
					},
					17: {
						name: '杀戮本能',
						icon: 'Spell_Holy_BlessingOfStamina',
						rank: ['使你的所有攻击造成爆击的几率提高1%。', '使你的所有攻击造成爆击的几率提高2%。', '使你的所有攻击造成爆击的几率提高3%。']
					},
					18: {
						name: '反击',
						icon: 'Ability_Warrior_Challange',
						rely: 10,
						rank: ['<i class="Fl">45 法力值</i><i class="Fr">近战范围</i><br><i class="Fl">瞬发法术</i><i class="Fr">5秒冷却时间</i><br>\
						在招架敌人的攻击之后可以使用的技能。对敌人造成40点伤害，并使其无法行动，持续5秒。反击无法被格挡、躲闪或招架。']
					},
					20: {
						name: '足智多谋',
						icon: 'Ability_Hunter_Resourcefulness',
						rank: ['使你的所有陷阱和近战技能所消耗的法力值减少20%，所有陷阱的冷却时间减少2秒。', '使你的所有陷阱和近战技能所消耗的法力值减少40%，所有陷阱的冷却时间减少4秒。', '使你的所有陷阱和近战技能所消耗的法力值减少60%，所有陷阱的冷却时间减少6秒。']
					},
					22: {
						name: '闪电反射',
						icon: 'Spell_Nature_Invisibilty',
						rank: ['使你的敏捷提高3%。', '使你的敏捷提高6%。', '使你的敏捷提高9%。', '使你的敏捷提高12%。', '使你的敏捷提高15%。']
					},
					24: {
						name: '狩猎刺激',
						icon: 'Ability_Hunter_ThrilloftheHunt',
						rank: ['你有33%的几率在任何射击技能爆击之后回复该技能消耗法力值的40%。', '你有66%的几率在任何射击技能爆击之后回复该技能消耗法力值的40%。', '你有100%的几率在任何射击技能爆击之后回复该技能消耗法力值的40%。']
					},
					25: {
						name: '翼龙钉刺',
						icon: 'INV_Spear_02',
						rely: 17,
						rank: ['<i class="Fl">115 法力值</i><i class="Fr">5-35码距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">2分钟冷却时间</i><br><i class="Fl">需要远程武器</i><br>\
						钉刺目标，使其沉睡12秒。任何伤害都会取消沉睡效果。当目标醒来时，钉刺会在12秒内对其造成300点自然伤害。只能在非战斗状态下使用。每个猎人在同一时间内只能对一个目标使用一种钉刺，且同类钉刺无法叠加。']
					},
					26: {
						name: '破甲虚弱',
						icon: 'Ability_Rogue_FindWeakness',
						rely: 22,
						rank: ['你的远程爆击有33%的几率为目标附加破甲虚弱效果，令所有攻击对该目标的攻击强度提高，数值相当于你的敏捷值的25%，效果持续7秒钟。', '你的远程爆击有66%的几率为目标附加破甲虚弱效果，令所有攻击对该目标的攻击强度提高，数值相当于你的敏捷值的25%，效果持续7秒钟。', '你的远程爆击有100%的几率为目标附加破甲虚弱效果，令所有攻击对该目标的攻击强度提高，数值相当于你的敏捷值的25%，效果持续7秒钟。']
					},
					29: {
						name: '战术大师',
						icon: 'Ability_Hunter_MasterTactitian',
						rank: ['你的远程攻击命中后有6%的几率使你的所有攻击的爆击几率提高2%，效果持续8秒钟。', '你的远程攻击命中后有6%的几率使你的所有攻击的爆击几率提高4%，效果持续8秒钟。', '你的远程攻击命中后有6%的几率使你的所有攻击的爆击几率提高6%，效果持续8秒钟。', '你的远程攻击命中后有6%的几率使你的所有攻击的爆击几率提高8%，效果持续8秒钟。', '你的远程攻击命中后有6%的几率使你的所有攻击的爆击几率提高10%，效果持续8秒钟。']
					},
					33: {
						name: '准备就绪',
						icon: 'Ability_Hunter_Readiness',
						rely: 29,
						rank: ['<i class="Fl">瞬发</i><i class="Fr">5分钟冷却时间</i><br>激活之后，这个技能立刻使你的其它猎人技能的冷却时间结束。']
					}
				}
			}
		],
		mage: [
			{
				text: '奥术',
				icon: 'Spell_Holy_MagicalSentry',
				texture: 'Arcane',
				talent: {
					0: {
						name: '奥术精妙',
						icon: 'Spell_Holy_DispelMagic',
						rank: ['使你的目标对你的所有法术的抗性降低5，并使你的奥术系法术所造成的威胁值降低20%。', '使你的目标对你的所有法术的抗性降低10，并使你的奥术系法术所造成的威胁值降低40%。']
					},
					1: {
						name: '奥术集中',
						icon: 'Spell_Holy_Devotion',
						rank: ['使你的敌人抵抗你的奥术法术的几率降低2%。', '使你的敌人抵抗你的奥术法术的几率降低4%。', '使你的敌人抵抗你的奥术法术的几率降低6%。', '使你的敌人抵抗你的奥术法术的几率降低8%。', '使你的敌人抵抗你的奥术法术的几率降低10%。']
					},
					2: {
						name: '强化奥术飞弹',
						icon: 'Spell_Nature_StarFall',
						rank: ['使你有20%的几率在施放奥术飞弹时不会因为受到伤害而中断施法。', '使你有40%的几率在施放奥术飞弹时不会因为受到伤害而中断施法。', '使你有60%的几率在施放奥术飞弹时不会因为受到伤害而中断施法。', '使你有80%的几率在施放奥术飞弹时不会因为受到伤害而中断施法。', '使你有100%的几率在施放奥术飞弹时不会因为受到伤害而中断施法。']
					},
					4: {
						name: '魔杖专精',
						icon: 'INV_Wand_01',
						rank: ['使你的魔杖伤害提高13%。', '使你的魔杖伤害提高25%。']
					},
					5: {
						name: '魔法吸收',
						icon: 'Spell_Nature_AstralRecalGroup',
						rank: ['使你的所有抗性提高2点，你每次完全抵抗一个法术就可以恢复法力值总量的1%。冷却时间1秒钟。', '使你的所有抗性提高4点，你每次完全抵抗一个法术就可以恢复法力值总量的2%。冷却时间1秒钟。', '使你的所有抗性提高6点，你每次完全抵抗一个法术就可以恢复法力值总量的3%。冷却时间1秒钟。', '使你的所有抗性提高8点，你每次完全抵抗一个法术就可以恢复法力值总量的4%。冷却时间1秒钟。', '使你的所有抗性提高10点，你每次完全抵抗一个法术就可以恢复法力值总量的5%。冷却时间1秒钟。']
					},
					6: {
						name: '奥术专注',
						icon: 'Spell_Shadow_ManaBurn',
						rank: [
							'使你有2%的几率在施放任何一种伤害性法术之后进入节能施法状态。节能施法状态可以使你的下一个伤害性法术所消耗的法力值减少100%。',
							'使你有4%的几率在施放任何一种伤害性法术之后进入节能施法状态。节能施法状态可以使你的下一个伤害性法术所消耗的法力值减少100%。',
							'使你有6%的几率在施放任何一种伤害性法术之后进入节能施法状态。节能施法状态可以使你的下一个伤害性法术所消耗的法力值减少100%。',
							'使你有8%的几率在施放任何一种伤害性法术之后进入节能施法状态。节能施法状态可以使你的下一个伤害性法术所消耗的法力值减少100%。',
							'使你有10%的几率在施放任何一种伤害性法术之后进入节能施法状态。节能施法状态可以使你的下一个伤害性法术所消耗的法力值减少100%。'
						]
					},
					8: {
						name: '魔法协调',
						icon: 'Spell_Nature_AbolishMagic',
						rank: ['使你的魔法抑制和魔法增效的效果提高25%。', '使你的魔法抑制和魔法增效的效果提高50%。']
					},
					9: {
						name: '奥术爆裂',
						icon: 'Spell_Nature_WispSplode',
						rank: ['使你的魔爆术和奥术冲击的爆击几率提高2%。', '使你的魔爆术和奥术冲击的爆击几率提高4%。', '使你的魔爆术和奥术冲击的爆击几率提高6%。']
					},
					11: {
						name: '奥术坚韧',
						icon: 'Spell_Arcane_ArcaneResilience',
						rank: ['使你的护甲值提高，数值相当于你的智力的100%。']
					},
					12: {
						name: '强化法力护盾',
						icon: 'Spell_Shadow_DetectLesserInvisibility',
						rank: ['使你的法力护盾每吸收一点伤害所消耗的法力值减少10%。', '使你的法力护盾每吸收一点伤害所消耗的法力值减少20%。']
					},
					13: {
						name: '强化法术反制',
						icon: 'Spell_Frost_IceShock',
						rank: ['使你的法术反制有50%的几率令目标沉默4秒。', '使你的法术反制有100%的几率令目标沉默4秒。']
					},
					15: {
						name: '奥术冥想',
						icon: 'Spell_Shadow_SiphonMana',
						rank: ['使你在施法时仍保持10%的法力回复速度。', '使你在施法时仍保持20%的法力回复速度。', '使你在施法时仍保持30%的法力回复速度。']
					},
					16: {
						name: '强化闪现术',
						icon: 'Spell_Arcane_Blink',
						rank: ['在施放闪现法术之后的4秒内，你被任何攻击命中的几率降低13%。', '在施放闪现法术之后的4秒内，你被任何攻击命中的几率降低25%。']
					},
					17: {
						name: '气定神闲',
						icon: 'Spell_Nature_EnchantArmor',
						rank: ['<i class="Fl">瞬发</i><i class="Fr">3分钟冷却时间</i><br>\
						激活之后，你的下一个施法时间低于10秒的法师法术会成为瞬发法术法术。']
					},
					19: {
						name: '奥术心智',
						icon: 'Spell_Shadow_Charm',
						rank: ['使你的智力总值提高3%。', '使你的智力总值提高6%。', '使你的智力总值提高9%。', '使你的智力总值提高12%。', '使你的智力总值提高15%。']
					},
					20: {
						name: '多彩屏障',
						icon: 'Spell_Arcane_PrismaticCloak',
						rank: ['受到的所有伤害降低2%。', '受到的所有伤害降低4%。']
					},
					21: {
						name: '奥术增效',
						icon: 'Spell_Shadow_Teleport',
						rely: 17,
						rank: ['使你的法术伤害和爆击几率提高1%。', '使你的法术伤害和爆击几率提高2%。', '使你的法术伤害和爆击几率提高3%。']
					},
					22: {
						name: '奥术潜能',
						icon: 'Spell_Arcane_ArcanePotency',
						rely: 6,
						rank: ['在节能施法状态下施放的所有法术的爆击几率提高10%。', '在节能施法状态下施放的所有法术的爆击几率提高20%。', '在节能施法状态下施放的所有法术的爆击几率提高30%。']
					},
					24: {
						name: '奥术飞弹增效',
						icon: 'Spell_Nature_StarFall',
						rank: ['提高法术伤害的效果对你的奥术飞弹有15%的额外加成，但法力值消耗提高2%。', '提高法术伤害的效果对你的奥术飞弹有30%的额外加成，但法力值消耗提高4%。', '提高法术伤害的效果对你的奥术飞弹有45%的额外加成，但法力值消耗提高6%。']
					},
					25: {
						name: '奥术强化',
						icon: 'Spell_Nature_Lightning',
						rely: 21,
						rank: ['<i class="Fl">瞬发</i><i class="Fr">3分钟冷却时间</i><br>\
						激活之后，你的法术会造成30%的额外伤害，但同时也要消耗30%的额外法力才能施放。这个效果可以持续15秒。']
					},
					26: {
						name: '法术能量',
						icon: 'Spell_Arcane_ArcaneTorrent',
						rank: ['所有法术的爆击伤害加成提高25%。', '所有法术的爆击伤害加成提高50%。']
					},
					29: {
						name: '心灵掌握',
						icon: 'Spell_Arcane_MindMastery',
						rank: ['使你的法术伤害加成提高，数值最多相当于你的智力总值的5%。', '使你的法术伤害加成提高，数值最多相当于你的智力总值的10%。', '使你的法术伤害加成提高，数值最多相当于你的智力总值的15%。', '使你的法术伤害加成提高，数值最多相当于你的智力总值的20%。', '使你的法术伤害加成提高，数值最多相当于你的智力总值的25%。']
					},
					33: {
						name: '减速',
						icon: 'Spell_Nature_Slow',
						rank: ['<i class="Fl">627 法力值</i><i class="Fr">30码有效距离</i><br><i class="Fl">瞬发法术</i><br>\
						使目标的移动速度降低50%，远程攻击间隔延长50%，施法时间延长50%。持续15秒。同一时间内只能对一个目标使用减速。']
					}
				}
			},
			{
				text: '火焰',
				icon: 'Spell_Fire_FireBolt02',
				texture: 'Fire',
				talent: {
					1: {
						name: '强化火球术',
						icon: 'Spell_Fire_FlameBolt',
						rank: ['使你的火球术的施法时间减少0.1秒。', '使你的火球术的施法时间减少0.2秒。', '使你的火球术的施法时间减少0.3秒。', '使你的火球术的施法时间减少0.4秒。', '使你的火球术的施法时间减少0.5秒。']
					},
					2: {
						name: '冲击',
						icon: 'Spell_Fire_MeteorStorm',
						rank: ['使你的火焰魔法有2%的几率令目标昏迷2秒。', '使你的火焰魔法有4%的几率令目标昏迷2秒。', '使你的火焰魔法有6%的几率令目标昏迷2秒。', '使你的火焰魔法有8%的几率令目标昏迷2秒。', '使你的火焰魔法有10%的几率令目标昏迷2秒。']
					},
					4: {
						name: '点燃',
						icon: 'spell_fire_incinerate',
						rank: ['你的火焰法术在造成爆击后使目标燃烧，令其在4秒内承受相当于该法术伤害8%的额外伤害。', '你的火焰法术在造成爆击后使目标燃烧，令其在4秒内承受相当于该法术伤害16%的额外伤害。', '你的火焰法术在造成爆击后使目标燃烧，令其在4秒内承受相当于该法术伤害24%的额外伤害。', '你的火焰法术在造成爆击后使目标燃烧，令其在4秒内承受相当于该法术伤害32%的额外伤害。', '你的火焰法术在造成爆击后使目标燃烧，令其在4秒内承受相当于该法术伤害40%的额外伤害。']
					},
					5: {
						name: '烈焰投掷',
						icon: 'Spell_Fire_Flare',
						rank: ['使你的火焰法术的射程增加3码。', '使你的火焰法术的射程增加6码。']
					},
					6: {
						name: '强化火焰冲击',
						icon: 'Spell_Fire_Fireball02',
						rank: ['使你的火焰冲击的冷却时间减少0.5秒。', '使你的火焰冲击的冷却时间减少1秒。', '使你的火焰冲击的冷却时间减少1.5秒。']
					},
					8: {
						name: '烧尽',
						icon: 'Spell_Fire_FlameShock',
						rank: ['使你的火焰冲击和灼烧法术的爆击几率提高2%。', '使你的火焰冲击和灼烧法术的爆击几率提高4%。']
					},
					9: {
						name: '强化烈焰风暴',
						icon: 'Spell_Fire_SelfDestruct',
						rank: ['使你的烈焰风暴的爆击几率提高5%。', '使你的烈焰风暴的爆击几率提高10%。', '使你的烈焰风暴的爆击几率提高15%。']
					},
					10: {
						name: '炎爆术',
						icon: 'spell_fire_fireball02',
						rank: ['<i class="Fl">125 法力值</i><i class="Fr">35码有效距离</i><br><i class="Fl">6秒施法时间</i><br>\
						发射一枚巨大的火球，对目标造成148到195点伤害，并在12秒内造成总计56点额外伤害。']
					},
					11: {
						name: '燃烧之魂',
						icon: 'Spell_Fire_Fire',
						rank: ['使你的火焰系法术有35%的几率不会因为你受到伤害而被干扰，火焰系法术所造成的威胁值降低5%。', '使你的火焰系法术有70%的几率不会因为你受到伤害而被干扰，火焰系法术所造成的威胁值降低10%。']
					},
					12: {
						name: '强化灼烧',
						icon: 'Spell_Fire_SoulBurn',
						rank: ['使你的灼烧法术有33%的几率令目标更容易受到火焰伤害，在其受到火焰系法术攻击时承受的伤害提高3%，持续30秒。最多可叠加5次。', '使你的灼烧法术有66%的几率令目标更容易受到火焰伤害，在其受到火焰系法术攻击时承受的伤害提高3%，持续30秒。最多可叠加5次。', '使你的灼烧法术有100%的几率令目标更容易受到火焰伤害，在其受到火焰系法术攻击时承受的伤害提高3%，持续30秒。最多可叠加5次。']
					},
					13: {
						name: '熔岩护盾',
						icon: 'Spell_Fire_FireArmor',
						rank: ['你的防护火焰结界有10%的几率将火焰法术反射给施法者。另外，你的熔岩护甲有50%的几率对远程或法术攻击生效。', '你的防护火焰结界有20%的几率将火焰法术反射给施法者。另外，你的熔岩护甲有100%的几率对远程或法术攻击生效。']
					},
					15: {
						name: '元素大师',
						icon: 'Spell_Fire_MasterOfElements',
						rank: ['你的火焰系和冰霜系法术在造成爆击之后会为你回复该法术所消耗基础法力值的10%。', '你的火焰系和冰霜系法术在造成爆击之后会为你回复该法术所消耗基础法力值的20%。', '你的火焰系和冰霜系法术在造成爆击之后会为你回复该法术所消耗基础法力值的30%。']
					},
					16: {
						name: '玩火自焚',
						icon: 'Spell_Fire_PlayingWithFire',
						rank: ['使你所造成的法术伤害提高1%，受到的所有法术伤害提高1%。', '使你所造成的法术伤害提高2%，受到的所有法术伤害提高2%。', '使你所造成的法术伤害提高3%，受到的所有法术伤害提高3%。']
					},
					17: {
						name: '火焰重击',
						icon: 'Spell_Nature_WispHeal',
						rank: ['使你的火焰法术的爆击几率提高2%。', '使你的火焰法术的爆击几率提高4%。', '使你的火焰法术的爆击几率提高6%。']
					},
					18: {
						name: '冲击波',
						icon: 'Spell_Holy_Excorcism_02',
						rely: 10,
						rank: ['<i class="Fl">215 法力值</i><br><i class="Fl">瞬发</i><i class="Fr">30秒冷却时间</i><br>\
						施法者放出一道火焰冲击波，所有被冲击波触及的敌人都会受到160到192点火焰伤害，并眩晕6秒。']
					},
					20: {
						name: '炽热疾速',
						icon: 'Spell_Fire_BurningSpeed',
						rank: ['使你有5%在受到近战或远程攻击之后，移动速度提高50%，并解除所有移动限制效果。炽热疾速效果可持续8秒。', '使你有10%在受到近战或远程攻击之后，移动速度提高50%，并解除所有移动限制效果。炽热疾速效果可持续8秒。']
					},
					22: {
						name: '火焰强化',
						icon: 'Spell_Fire_Immolation',
						rely: 18,
						rank: ['使你的火焰法术的伤害提高2%。', '使你的火焰法术的伤害提高4%。', '使你的火焰法术的伤害提高6%。', '使你的火焰法术的伤害提高8%。', '使你的火焰法术的伤害提高10%。']
					},
					24: {
						name: '纵火',
						icon: 'Spell_Fire_Burnout',
						rank: ['使所有火焰法术的爆击几率提高1%，法力值消耗降低1%。', '使所有火焰法术的爆击几率提高2%，法力值消耗降低2%。', '使所有火焰法术的爆击几率提高3%，法力值消耗降低3%。']
					},
					25: {
						name: '燃烧',
						icon: 'Spell_Fire_SealOfFire',
						rely: 17,
						rank: ['<i class="Fl">瞬发</i><i class="Fr">3分钟冷却时间</i><br>\
						激活之后，你每一次施放火焰系伤害性法术，你的该类法术的爆击几率都会提高10%。这个效果会一直持续到你使用火焰系法术造成了3次爆击。']
					},
					26: {
						name: '熔岩之怒',
						icon: 'Spell_Fire_MoltenBlood',
						rank: ['所有法术对生命值低于20%的目标所造成的伤害提高10%。', '所有法术对生命值低于20%的目标所造成的伤害提高20%。']
					},
					30: {
						name: '火球增效',
						icon: 'Spell_Fire_FlameBolt',
						rank: ['提高法术伤害的效果对你的火球术有3%的额外加成。', '提高法术伤害的效果对你的火球术有6%的额外加成。', '提高法术伤害的效果对你的火球术有9%的额外加成。', '提高法术伤害的效果对你的火球术有12%的额外加成。', '提高法术伤害的效果对你的火球术有15%的额外加成。']
					},
					33: {
						name: '龙息术',
						icon: 'INV_Misc_Head_Dragon_01',
						rely: 25,
						rank: ['<i class="Fl">125 法力值</i><BR><i class="Fl">瞬发法术</i><i class="Fr">20秒冷却时间</i><br>\
						使施法者面前的一个锥形区域内的所有目标受到382到442点火焰伤害，并陷入混乱状态，持续3秒钟。任何直接伤害型的攻击都会令混乱的目标恢复正常。使用之后结束你的攻击动作。']
					}
				}
			},
			{
				text: '冰霜',
				icon: 'Spell_Frost_FrostBolt02',
				texture: 'Frost',
				talent: {
					0: {
						name: '冰霜障壁',
						icon: 'Spell_Frost_FrostWard',
						rank: ['使你的霜甲术和冰甲术所提供的护甲值和抗性提高15%。另外，你的防护冰霜结界有10%的几率将冰霜系法术和魔法效果反射给施法者。', '使你的霜甲术和冰甲术所提供的护甲值和抗性提高30%。另外，你的防护冰霜结界有20%的几率将冰霜系法术和魔法效果反射给施法者。']
					},
					1: {
						name: '强化寒冰箭',
						icon: 'Spell_Frost_FrostBolt02',
						rank: ['使你的寒冰箭的施法时间减少0.1秒。', '使你的寒冰箭的施法时间减少0.2秒。', '使你的寒冰箭的施法时间减少0.3秒。', '使你的寒冰箭的施法时间减少0.4秒。', '使你的寒冰箭的施法时间减少0.5秒。']
					},
					2: {
						name: '元素精准',
						icon: 'Spell_Ice_MagicDamage',
						rank: ['使你的火焰和冰霜系法术所消耗的法力值及目标抵抗这些法术的几率降低1%。', '使你的火焰和冰霜系法术所消耗的法力值及目标抵抗这些法术的几率降低2%。', '使你的火焰和冰霜系法术所消耗的法力值及目标抵抗这些法术的几率降低3%。']
					},
					4: {
						name: '寒冰碎片',
						icon: 'Spell_Frost_IceShard',
						rank: ['使你的冰霜法术的爆击伤害提高20%。', '使你的冰霜法术的爆击伤害提高40%。', '使你的冰霜法术的爆击伤害提高60%。', '使你的冰霜法术的爆击伤害提高80%。', '使你的冰霜法术的爆击伤害提高100%。']
					},
					5: {
						name: '霜寒刺骨',
						icon: 'Spell_Frost_FrostArmor',
						rank: ['使你的寒冷效果有5%的几率将目标冻结5秒。', '使你的寒冷效果有10%的几率将目标冻结5秒。', '使你的寒冷效果有15%的几率将目标冻结5秒。']
					},
					6: {
						name: '强化冰霜新星',
						icon: 'Spell_Frost_FreezingBreath',
						rank: ['使你的冰霜新星的冷却时间减少2秒。', '使你的冰霜新星的冷却时间减少4秒。']
					},
					7: {
						name: '极寒冰霜',
						icon: 'Spell_Frost_Wisp',
						rank: ['使你的冰冷效果的持续时间延长1秒，并使目标身上的减速效果提高4%。', '使你的冰冷效果的持续时间延长2秒，并使目标身上的减速效果提高7%。', '使你的冰冷效果的持续时间延长3秒，并使目标身上的减速效果提高10%。']
					},
					8: {
						name: '刺骨寒冰',
						icon: 'Spell_Frost_Frostbolt',
						rank: ['使你的冰霜法术的伤害提高2%。', '使你的冰霜法术的伤害提高4%。', '使你的冰霜法术的伤害提高6%。']
					},
					9: {
						name: '冰冷血脉',
						icon: 'Spell_Frost_ColdHearted',
						rank: ['<i class="Fl">3% 基础法力值</i><br><i class="Fl">瞬发法术</i><i class="Fr">3分钟冷却时间</i><br>\
						提高你的施法速度，使得所有法术的施法时间缩短20%，避免因受到伤害而打断施法的几率提高100%，效果持续20秒。']
					},
					11: {
						name: '强化暴风雪',
						icon: 'Spell_Frost_IceStorm',
						rank: ['为你的暴风雪法术增加冰冷效果，使目标的移动速度降低30%。持续1.50秒。', '为你的暴风雪法术增加冰冷效果，使目标的移动速度降低50%。持续1.50秒。', '为你的暴风雪法术增加冰冷效果，使目标的移动速度降低65%。持续1.50秒。']
					},
					12: {
						name: '极寒延伸',
						icon: 'Spell_Shadow_DarkRitual',
						rank: ['使你的冰霜新星和冰锥术的有效半径以及寒冰箭和暴风雪的射程提高10%。', '使你的冰霜新星和冰锥术的有效半径以及寒冰箭和暴风雪的射程提高20%。']
					},
					13: {
						name: '冰霜导能',
						icon: 'Spell_Frost_Stun',
						rank: ['使你的所有冰霜法术所消耗的法力值减少5%，冰霜系法术所造成的威胁值降低4%。', '使你的所有冰霜法术所消耗的法力值减少10%，冰霜系法术所造成的威胁值降低7%。', '使你的所有冰霜法术所消耗的法力值减少15%，冰霜系法术所造成的威胁值降低10%。']
					},
					14: {
						name: '碎冰',
						icon: 'Spell_Frost_FrostShock',
						rely: 6,
						rank: ['使你的所有法术在击中被冰冻的敌人时的爆击几率提高10%。', '使你的所有法术在击中被冰冻的敌人时的爆击几率提高20%。', '使你的所有法术在击中被冰冻的敌人时的爆击几率提高30%。', '使你的所有法术在击中被冰冻的敌人时的爆击几率提高40%。', '使你的所有法术在击中被冰冻的敌人时的爆击几率提高50%。']
					},
					16: {
						name: '冰冻之心',
						icon: 'Spell_Frost_FrozenCore',
						rank: ['受到冰霜和火焰系攻击时所承受的伤害降低2%。', '受到冰霜和火焰系攻击时所承受的伤害降低4%。', '受到冰霜和火焰系攻击时所承受的伤害降低6%。']
					},
					17: {
						name: '急速冷却',
						icon: 'Spell_Frost_WizardMark',
						rank: ['<i class="Fl">瞬发法术</i><i class="Fr">8分钟冷却时间</i><br>\
						激活之后，使你最近施放的所有冰霜法术的冷却时间结束。']
					},
					18: {
						name: '强化冰锥术',
						icon: 'Spell_Frost_Glacier',
						rank: ['使你的冰锥术的伤害提高15%。', '使你的冰锥术的伤害提高25%。', '使你的冰锥术的伤害提高35%。']
					},
					20: {
						name: '浮冰',
						icon: 'Spell_Frost_IceFloes',
						rank: ['使你的冰锥术、急速冷却、寒冰护体和寒冰屏障法术的冷却时间减少10%。', '使你的冰锥术、急速冷却、寒冰护体和寒冰屏障法术的冷却时间减少20%。']
					},
					22: {
						name: '深冬之寒',
						icon: 'Spell_Frost_ChillingBlast',
						rank: [
							'你的冰霜系伤害法术有20%的几率附加深冬之寒效果，令冰霜系法术对目标造成爆击的几率提高2%，该效果持续15秒。可叠加最多5次。',
							'你的冰霜系伤害法术有40%的几率附加深冬之寒效果，令冰霜系法术对目标造成爆击的几率提高2%，该效果持续15秒。可叠加最多5次。',
							'你的冰霜系伤害法术有60%的几率附加深冬之寒效果，令冰霜系法术对目标造成爆击的几率提高2%，该效果持续15秒。可叠加最多5次。',
							'你的冰霜系伤害法术有80%的几率附加深冬之寒效果，令冰霜系法术对目标造成爆击的几率提高2%，该效果持续15秒。可叠加最多5次。',
							'你的冰霜系伤害法术有100%的几率附加深冬之寒效果，令冰霜系法术对目标造成爆击的几率提高2%，该效果持续15秒。可叠加最多5次。'
						]
					},
					25: {
						name: '寒冰护体',
						icon: 'Spell_Ice_Lament',
						rely: 17,
						rank: ['<i class="Fl">305 法力值</i><br><i class="Fl">瞬发法术</i><i class="Fr">30秒冷却时间</i><br>\
						立即为目标加上魔法护盾，可吸收454点伤害，持续1分钟。只要护盾存在，受保护者的施法就不会被打断。']
					},
					26: {
						name: '极寒之风',
						icon: 'Spell_Frost_ArcticWinds',
						rank: ['使你的所有冰霜法术伤害提高1%，被近战和远程攻击命中的几率降低1%。', '使你的所有冰霜法术伤害提高2%，被近战和远程攻击命中的几率降低2%。', '使你的所有冰霜法术伤害提高3%，被近战和远程攻击命中的几率降低3%。', '使你的所有冰霜法术伤害提高4%，被近战和远程攻击命中的几率降低4%。', '使你的所有冰霜法术伤害提高5%，被近战和远程攻击命中的几率降低5%。']
					},
					29: {
						name: '寒冰箭增效',
						icon: 'Spell_Frost_FrostBolt02',
						rank: ['提高法术伤害的效果对你的寒冰箭有2%的额外加成，同时你的寒冰箭的爆击几率提高1%。', '提高法术伤害的效果对你的寒冰箭有4%的额外加成，同时你的寒冰箭的爆击几率提高2%。', '提高法术伤害的效果对你的寒冰箭有6%的额外加成，同时你的寒冰箭的爆击几率提高3%。', '提高法术伤害的效果对你的寒冰箭有8%的额外加成，同时你的寒冰箭的爆击几率提高4%。', '提高法术伤害的效果对你的寒冰箭有10%的额外加成，同时你的寒冰箭的爆击几率提高5%。']
					},
					33: {
						name: '召唤水元素',
						icon: 'Spell_Frost_SummonWaterElemental_2',
						rank: ['<i class="Fl">16% 基础法力值</i><br><i class="Fl">瞬发法术</i><i class="Fr">3分钟冷却时间</i><br>\
						召唤一个水元素为施法者作战，持续45秒。']
					}
				}
			}
		],
		paladin: [
			{
				text: '神圣',
				icon: 'Spell_Holy_HolyBolt',
				texture: 'Holy_Paladin',
				talent: {
					1: {
						name: '神圣之力',
						icon: 'Ability_GolemThunderClap',
						rank: ['使你的力量总值提高2%。', '使你的力量总值提高4%。', '使你的力量总值提高6%。', '使你的力量总值提高8%。', '使你的力量总值提高10%。']
					},
					2: {
						name: '神圣智慧',
						icon: 'Spell_Nature_Sleep',
						rank: ['使你的智力总值提高2%。', '使你的智力总值提高4%。', '使你的智力总值提高6%。', '使你的智力总值提高8%。', '使你的智力总值提高10%。']
					},
					5: {
						name: '精神集中',
						icon: 'Spell_Arcane_Blink',
						rank: ['使你的圣光闪现和圣光术有14%的几率在受到伤害时不会延长施法时间。', '使你的圣光闪现和圣光术有28%的几率在受到伤害时不会延长施法时间。.', '使你的圣光闪现和圣光术有42%的几率在受到伤害时不会延长施法时间。', '使你的圣光闪现和圣光术有56%的几率在受到伤害时不会延长施法时间。', '使你的圣光闪现和圣光术有70%的几率在受到伤害时不会延长施法时间。']
					},
					6: {
						name: '强化正义圣印',
						icon: 'Ability_ThunderBolt',
						rank: ['使你的正义圣印和正义审判的伤害提高3%。', '使你的正义圣印和正义审判的伤害提高6%。', '使你的正义圣印和正义审判的伤害提高9%。', '使你的正义圣印和正义审判的伤害提高12%。', '使你的正义圣印和正义审判的伤害提高15%。']
					},
					8: {
						name: '治疗之光',
						icon: 'Spell_Holy_HolyBolt',
						rank: ['使你的圣光术和圣光闪现的治疗效果提高4%。', '使你的圣光术和圣光闪现的治疗效果提高8%。', '使你的圣光术和圣光闪现的治疗效果提高12%。']
					},
					9: {
						name: '光环掌握',
						icon: 'Spell_Holy_AuraMastery',
						rank: ['使你的光环的影响半径扩大到40码。']
					},
					10: {
						name: '强化圣疗术',
						icon: 'Spell_Holy_LayOnHands',
						rank: ['被你的圣疗术治疗的目标因装备而获得的护甲值提高15%，持续2分钟。另外，圣疗术的冷却时间减少10分钟。', '被你的圣疗术治疗的目标因装备而获得的护甲值提高30%，持续2分钟。另外，圣疗术的冷却时间减少20分钟。']
					},
					11: {
						name: '不灭信仰',
						icon: 'Spell_Holy_UnyieldingFaith',
						rank: ['使你抵抗恐惧和困惑效果的几率提高5%。', '使你抵抗恐惧和困惑效果的几率提高10%。']
					},
					13: {
						name: '启发',
						icon: 'Spell_Holy_GreaterHeal',
						rank: ['在你的圣光闪现、圣光术或神圣震击造成爆击效果后，使你有20%的几率回复施法所消耗的法力值的60%。', '在你的圣光闪现、圣光术或神圣震击造成爆击效果后，使你有40%的几率回复施法所消耗的法力值的60%。', '在你的圣光闪现、圣光术或神圣震击造成爆击效果后，使你有60%的几率回复施法所消耗的法力值的60%。.', '在你的圣光闪现、圣光术或神圣震击造成爆击效果后，使你有80%的几率回复施法所消耗的法力值的60%。', '在你的圣光闪现、圣光术或神圣震击造成爆击效果后，使你有100%的几率回复施法所消耗的法力值的60%。']
					},
					14: {
						name: '强化智慧祝福',
						icon: 'Spell_Holy_SealOfWisdom',
						rank: ['使你的智慧祝福的效果提高10%。', '使你的智慧祝福的效果提高20%。']
					},
					16: {
						name: '纯净心灵',
						icon: 'Spell_Holy_PureOfHeart',
						rank: ['使你抵抗诅咒和疾病效果的几率提高5%。', '使你抵抗诅咒和疾病效果的几率提高10%。', '使你抵抗诅咒和疾病效果的几率提高15%。']
					},
					17: {
						name: '神恩术',
						icon: 'Spell_Holy_Heal',
						rely: 13,
						rank: ['<i class="Fl">3% 基础法力值</i><i class="Fr">100码有效距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">1分钟冷却时间</i><br>\
						命令你的宠物在下次击中敌人时进行胁迫，造成大量的威胁值，并使目标昏迷3秒。']
					},
					18: {
						name: '神圣光芒',
						icon: 'Spell_Holy_HealingAura',
						rank: ['使你的圣光术的爆击几率提高2%。', '使你的圣光术的爆击几率提高4%。', '使你的圣光术的爆击几率提高6%。']
					},
					20: {
						name: '净化之力',
						icon: 'Spell_Holy_PurifyingPower',
						rank: ['使你的净化和奉献法术所消耗的法力值减少5%，驱邪术和神圣愤怒的爆击几率提高10%。', '使你的净化和奉献法术所消耗的法力值减少10%，驱邪术和神圣愤怒的爆击几率提高20%。']
					},
					22: {
						name: '神圣之力',
						icon: 'Spell_Holy_Power',
						rank: ['使你的神圣法术的爆击几率提高1%。', '使你的神圣法术的爆击几率提高2%。', '使你的神圣法术的爆击几率提高3%。', '使你的神圣法术的爆击几率提高4%。', '使你的神圣法术的爆击几率提高5%。']
					},
					24: {
						name: '光之优雅',
						icon: 'Spell_Holy_LightsGrace',
						rank: ['使你施放的圣光术有33%的几率令下一个圣光术的施法时间减少0.5秒，该效果可持续15秒钟。', '使你施放的圣光术有66%的几率令下一个圣光术的施法时间减少0.5秒，该效果可持续15秒钟。', '使你施放的圣光术有100%的几率令下一个圣光术的施法时间减少0.5秒，该效果可持续15秒钟。']
					},
					25: {
						name: '神圣震击',
						icon: 'Spell_Holy_SearingLight',
						rely: 17,
						rank: ['<i class="Fl">335 法力值</i><i class="Fr">20码有效距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">15秒冷却时间</i><br>\
						以神圣的能量冲击目标，造成204到220点神圣伤害，或为盟友恢复204到220点生命值。']
					},
					26: {
						name: '神佑之体',
						icon: 'Spell_Holy_BlessedLife',
						rank: ['你有4%的几率在受到任何攻击时只承受一半的伤害。', '你有7%的几率在受到任何攻击时只承受一半的伤害。', '你有10%的几率在受到任何攻击时只承受一半的伤害。']
					},
					29: {
						name: '神圣指引',
						icon: 'Spell_Holy_HolyGuidance',
						rank: ['使你的法术伤害和治疗效果提高，数值相当于你的智力总值的7%。', '使你的法术伤害和治疗效果提高，数值相当于你的智力总值的14%。', '使你的法术伤害和治疗效果提高，数值相当于你的智力总值的21%。', '使你的法术伤害和治疗效果提高，数值相当于你的智力总值的28%。', '使你的法术伤害和治疗效果提高，数值相当于你的智力总值的35%。']
					},
					33: {
						name: '神启',
						icon: 'Spell_Holy_DivineIllumination',
						rank: ['<i class="Fl">瞬发</i><i class="Fr">3分钟冷却时间</i><br>\
						使你的所有法术所消耗的法力值减少50%，持续15秒。']
					}
				}
			},
			{
				text: '防护',
				icon: 'Spell_Holy_DevotionAura',
				texture: 'Protection_Paladin',
				talent: {
					1: {
						name: '强化虔诚光环',
						icon: 'Spell_Holy_DevotionAura',
						rank: ['使你的震荡射击有4%的机会令目标昏迷3秒。', '使你的震荡射击有8%的机会令目标昏迷3秒。', '使你的震荡射击有12%的机会令目标昏迷3秒。', '使你的震荡射击有16%的机会令目标昏迷3秒。', '使你的震荡射击有20%的机会令目标昏迷3秒。']
					},
					2: {
						name: '盾牌壁垒',
						icon: 'Ability_Defend',
						rank: ['使你在遭受爆击之后使用盾牌格挡攻击的几率提6%。持续10秒钟或格挡5次攻击。', '使你在遭受爆击之后使用盾牌格挡攻击的几率提12%。持续10秒钟或格挡5次攻击。', '使你在遭受爆击之后使用盾牌格挡攻击的几率提18%。持续10秒钟或格挡5次攻击。', '使你在遭受爆击之后使用盾牌格挡攻击的几率提24%。持续10秒钟或格挡5次攻击。', '使你在遭受爆击之后使用盾牌格挡攻击的几率提30%。持续10秒钟或格挡5次攻击。']
					},
					4: {
						name: '精确',
						icon: 'Ability_Rogue_Ambush',
						rank: ['使你的近战武器和法术命中几率提高1%。', '使你的近战武器和法术命中几率提高2%。', '使你的近战武器和法术命中几率提高3%。']
					},
					5: {
						name: '守护者的宠爱',
						icon: 'spell_holy_sealofprotection',
						rank: ['使你的保护祝福的冷却时间减少60秒，自由祝福的效果持续时间延长3秒。', '使你的保护祝福的冷却时间减少120秒，自由祝福的效果持续时间延长6秒。']
					},
					7: {
						name: '坚韧',
						icon: 'Spell_Holy_Devotion',
						rank: ['使你因装备而获得的护甲值提高2%。', '使你因装备而获得的护甲值提高4%。', '使你因装备而获得的护甲值提高6%。', '使你因装备而获得的护甲值提高8%。', '使你因装备而获得的护甲值提高10%。']
					},
					8: {
						name: '王者祝福',
						icon: 'Spell_Magic_MageArmor',
						rank: ['<i class="Fl">6% 基础法力值</i><i class="Fr">30码有效距离</i><br><i class="Fl">瞬发法术</i><br>\
						为友方目标施加祝福，使其所有属性提高10%，持续5分钟。每个圣骑士在同一时间内只能给目标施加一种祝福，同类型的祝福不能重叠。']
					},
					9: {
						name: '强化正义之怒',
						icon: 'Spell_Holy_SealOfFury',
						rank: ['当正义之怒处于激活状态时，你所承受的一切伤害降低2%，正义之怒所产生的威胁值提高16%。', '当正义之怒处于激活状态时，你所承受的一切伤害降低4%，正义之怒所产生的威胁值提高33%。', '当正义之怒处于激活状态时，你所承受的一切伤害降低6%，正义之怒所产生的威胁值提高50%。']
					},
					10: {
						name: '盾牌专精',
						icon: 'INV_Shield_06',
						rely: 2,
						rank: ['使你的盾牌所能吸收的伤害提高10%。', '使你的盾牌所能吸收的伤害提高20%。', '使你的盾牌所能吸收的伤害提高30%。']
					},
					11: {
						name: '预知',
						icon: 'Spell_Magic_LesserInvisibilty',
						rank: ['使你的防御技能提高4。', '使你的防御技能提高8。', '使你的防御技能提高12。', '使你的防御技能提高16。', '使你的防御技能提高20。']
					},
					12: {
						name: '淡泊',
						icon: 'Spell_Holy_Stoicism',
						rank: ['使你抵抗昏迷效果的几率提高5%，你的法术被驱散的几率降低15%。', '使你抵抗昏迷效果的几率提高10%，你的法术被驱散的几率降低30%。']
					},
					13: {
						name: '强化制裁之锤',
						icon: 'spell_holy_sealofmight',
						rank: ['使你的制裁之锤的冷却时间减少5秒。', '使你的制裁之锤的冷却时间减少10秒。', '使你的制裁之锤的冷却时间减少15秒。']
					},
					14: {
						name: '强化专注光环',
						icon: 'Spell_Holy_MindSooth',
						rank: ['使你的专注光环的效果提高5%，所有受到光环影响的队友受到沉默和打断效果影响的时间缩短10%。影响时间缩短的效果不与其它同类效果叠加。', '使你的专注光环的效果提高10%，所有受到光环影响的队友受到沉默和打断效果影响的时间缩短20%。影响时间缩短的效果不与其它同类效果叠加。', '使你的专注光环的效果提高15%，所有受到光环影响的队友受到沉默和打断效果影响的时间缩短30%。影响时间缩短的效果不与其它同类效果叠加。']
					},
					16: {
						name: '法术屏障',
						icon: 'Spell_Holy_ImprovedResistanceAuras',
						rank: ['使你受到的所有法术伤害降低2%。', '使你受到的所有法术伤害降低4%。']
					},
					17: {
						name: '庇护祝福',
						icon: 'Spell_Nature_LightningShield',
						rank: ['<i class="Fl">60 法力值</i><i class="Fr">30码有效距离</i><br><i class="Fl">瞬发法术</i><br>\
						为友方目标施加祝福，使其受到的所有类型的伤害都减少最多10点，持续5分钟。另外，当目标格挡一次近战攻击时，攻击者会受到14点神圣伤害。每个圣骑士在同一时间内只能给目标施加一种祝福，同类型的祝福不能重叠。']
					},
					18: {
						name: '清算',
						icon: 'Spell_Holy_BlessingOfStrength',
						rank: [
							'使你在承受任何攻击伤害之后有2%的几率在的几率在接下来的8秒内进行的4次武器攻击获得一次额外的攻击机会。',
							'使你在承受任何攻击伤害之后有4%的几率在的几率在接下来的8秒内进行的4次武器攻击获得一次额外的攻击机会。',
							'使你在承受任何攻击伤害之后有6%的几率在的几率在接下来的8秒内进行的4次武器攻击获得一次额外的攻击机会。',
							'使你在承受任何攻击伤害之后有8%的几率在的几率在接下来的8秒内进行的4次武器攻击获得一次额外的攻击机会。',
							'使你在承受任何攻击伤害之后有10%的几率在的几率在接下来的8秒内进行的4次武器攻击获得一次额外的攻击机会。'
						]
					},
					20: {
						name: '神圣使命',
						icon: 'Spell_Holy_DivineIntervention',
						rank: ['使你的耐力总值提高3%，圣盾术的冷却时间减少30秒，攻击速度惩罚降低50%。', '使你的耐力总值提高6%，圣盾术的冷却时间减少60秒，攻击速度惩罚降低100%。']
					},
					22: {
						name: '单手武器专精',
						icon: 'INV_Sword_20',
						rank: ['使你的单手近战武器伤害提高1%。', '使你的单手近战武器伤害提高2%。', '使你的单手近战武器伤害提高3%。', '使你的单手近战武器伤害提高4%。', '使你的单手近战武器伤害提高5%。']
					},
					24: {
						name: '强化神圣之盾',
						icon: 'Spell_Holy_BlessingOfProtection',
						rely: 25,
						rank: ['使你的神圣之盾造成的伤害提高10%，神圣之盾的使用次数增加2次。', '使你的神圣之盾造成的伤害提高20%，神圣之盾的使用次数增加4次。']
					},
					25: {
						name: '神圣之盾',
						icon: 'Spell_Holy_BlessingOfProtection',
						rely: 17,
						rank: ['<i class="Fl">135 法力值</i><br><i class="Fl">瞬发</i><i class="Fr">10秒钟冷却时间</i><br><i class="Fl">需要盾牌</i><br>\
						使你的格挡几率提高30%，持续10秒钟。在此期间每次成功格挡都会对攻击者造成59点神圣伤害，由神圣之盾造成的伤害所产生的威胁值提高35%。每次成功格挡会消耗掉一次格挡机会，最多可格挡4次。']
					},
					26: {
						name: '炽热防御者',
						icon: 'Spell_Holy_ArdentDefender',
						rank: ['当你的生命值低于35%时，你承受的所有伤害降低6%。', '当你的生命值低于35%时，你承受的所有伤害降低12%。', '当你的生命值低于35%时，你承受的所有伤害降低18%。', '当你的生命值低于35%时，你承受的所有伤害降低24%。', '当你的生命值低于35%时，你承受的所有伤害降低30%。']
					},
					30: {
						name: '战斗精准',
						icon: 'Spell_Holy_WeaponMastery',
						rank: ['使你的精准等级提高1，耐力总值提高2%。', '使你的精准等级提高2，耐力总值提高4%。', '使你的精准等级提高3，耐力总值提高6%。', '使你的精准等级提高4，耐力总值提高8%。', '使你的精准等级提高5，耐力总值提高10%。']
					},
					33: {
						name: '复仇者之盾',
						icon: 'Spell_Holy_AvengersShield',
						rely: 25,
						rank: ['<i class="Fl">500 法力值</i><i class="Fr">8-30码有效距离</i><br><i class="Fl">1秒施法时间</i><i class="Fr">30秒冷却时间</i><br>\
						向目标投掷神圣之盾，对其造成270到330神圣伤害并使其眩晕，然后跳转攻击下一个附近的目标。最多可攻击3个目标。效果持续6秒。']
					}
				}
			},
			{
				text: '惩戒',
				icon: 'Spell_Holy_AuraOfLight',
				texture: 'Retribution',
				talent: {
					1: {
						name: '强化力量祝福',
						icon: 'Spell_Holy_FistOfJustice',
						rank: ['使你的力量祝福所提供的攻击强度加成提高4%。', '使你的力量祝福所提供的攻击强度加成提高8%。', '使你的力量祝福所提供的攻击强度加成提高12%。', '使你的力量祝福所提供的攻击强度加成提高16%。', '使你的力量祝福所提供的攻击强度加成提高20%。']
					},
					2: {
						name: '祈福',
						icon: 'Spell_Frost_WindWalkOn',
						rank: ['使你的审判和圣印所消耗的法力值减少3%。', '使你的审判和圣印所消耗的法力值减少6%。', '使你的审判和圣印所消耗的法力值减少9%。', '使你的审判和圣印所消耗的法力值减少12%。', '使你的审判和圣印所消耗的法力值减少15%。']
					},
					4: {
						name: '强化审判',
						icon: 'Spell_Holy_RighteousFury',
						rank: ['使你的审判法术的冷却时间减少1秒。', '使你的审判法术的冷却时间减少2秒。']
					},
					5: {
						name: '强化十字军圣印',
						icon: 'Spell_Holy_HolySmite',
						rank: ['除了普通的效果外，你的十字军审判也会令所有攻击对审判目标的爆击几率提高1%。', '除了普通的效果外，你的十字军审判也会令所有攻击对审判目标的爆击几率提高2%。', '除了普通的效果外，你的十字军审判也会令所有攻击对审判目标的爆击几率提高3%。']
					},
					6: {
						name: '偏斜',
						icon: 'Ability_Parry',
						rank: ['使你的招架几率提高1%。', '使你的招架几率提高2%。', '使你的招架几率提高3%。', '使你的招架几率提高4%。', '使你的招架几率提高5%。']
					},
					8: {
						name: '辩护',
						icon: 'Spell_Holy_Vindication',
						rank: ['使圣骑士的近战攻击有一定的几率令目标的属性降低5%，持续15秒。', '使圣骑士的近战攻击有一定的几率令目标的属性降低10%，持续15秒。', '使圣骑士的近战攻击有一定的几率令目标的属性降低15%，持续15秒。']
					},
					9: {
						name: '定罪',
						icon: 'Spell_Holy_RetributionAura',
						rank: ['使你的近战武器的爆击几率提高1%。', '使你的近战武器的爆击几率提高2%。', '使你的近战武器的爆击几率提高3%。', '使你的近战武器的爆击几率提高4%。', '使你的近战武器的爆击几率提高5%。']
					},
					10: {
						name: '命令圣印',
						icon: 'Ability_Warrior_InnerRage',
						rank: ['<i class="Fl">65 法力值</i><br><i class="Fl">瞬发法术</i><br>\
						使圣骑士在攻击时有一定几率对目标造成与攻击伤害的70%等量的神圣伤害。圣骑士在同一时间内只能激活一种圣印。持续30秒。<br>释放这种圣印的能量将对目标造成审判效果，对其立刻造成68到73点神圣伤害，若目标昏迷或瘫痪则造成137到146点神圣伤害。']
					},
					11: {
						name: '正义追击',
						icon: 'Spell_Holy_PersuitofJustice',
						rank: ['使你被法术命中的几率降低1%，移动速度和坐骑移动速度提高5%。这个效果不与其它同类效果叠加。', '使你被法术命中的几率降低2%，移动速度和坐骑移动速度提高10%。这个效果不与其它同类效果叠加。', '使你被法术命中的几率降低3%，移动速度和坐骑移动速度提高15%。这个效果不与其它同类效果叠加。']
					},
					12: {
						name: '以眼还眼',
						icon: 'Spell_Holy_EyeforanEye',
						rank: ['所有对你造成爆击的法术都会对其施法者造成15%的伤害，但最大数值不会超过圣骑士生命值总量的50%。', '所有对你造成爆击的法术都会对其施法者造成30%的伤害，但最大数值不会超过圣骑士生命值总量的50%。']
					},
					14: {
						name: '强化惩戒光环',
						icon: 'Spell_Holy_AuraOfLight',
						rank: ['使你的惩戒光环的伤害提高25%。', '使你的惩戒光环的伤害提高50%。']
					},
					15: {
						name: '征伐',
						icon: 'Spell_Holy_Crusade',
						rank: ['对人形生物、恶魔、亡灵和元素生物造成的所有伤害提高1%。', '对人形生物、恶魔、亡灵和元素生物造成的所有伤害提高2%。', '对人形生物、恶魔、亡灵和元素生物造成的所有伤害提高3%。']
					},
					16: {
						name: '双手武器专精',
						icon: 'INV_Hammer_04',
						rank: ['使你的双手近战武器伤害提高2%。', '使你的双手近战武器伤害提高4%。', '使你的双手近战武器伤害提高6%。']
					},
					18: {
						name: '圣洁光环',
						icon: 'spell_holy_mindvision',
						rank: ['<i class="Fl">瞬发</i><br>\
						使半径30码范围内的队友的神圣系攻击对敌人造成的伤害提高10%。每个圣骑士在同一时间内只能开启一种光环，且同类光环的效果无法叠加。']
					},
					19: {
						name: '强化圣洁光环',
						icon: 'spell_holy_mindvision',
						rely: 18,
						rank: ['受到圣洁光环影响的目标所能造成的伤害提高1%。', '受到圣洁光环影响的目标所能造成的伤害提高2%。']
					},
					21: {
						name: '复仇',
						icon: 'Ability_Racial_Avatar',
						rely: 9,
						rank: [
							'使你的武器攻击、法术或技能在对敌人造成爆击之后有1%的物理和神圣伤害加成，持续30秒。这个效果可以叠加最多3次。',
							'使你的武器攻击、法术或技能在对敌人造成爆击之后有2%的物理和神圣伤害加成，持续30秒。这个效果可以叠加最多3次。',
							'使你的武器攻击、法术或技能在对敌人造成爆击之后有3%的物理和神圣伤害加成，持续30秒。这个效果可以叠加最多3次。',
							'使你的武器攻击、法术或技能在对敌人造成爆击之后有4%的物理和神圣伤害加成，持续30秒。这个效果可以叠加最多3次。',
							'使你的武器攻击、法术或技能在对敌人造成爆击之后有5%的物理和神圣伤害加成，持续30秒。这个效果可以叠加最多3次。'
						]
					},
					22: {
						name: '神圣审判',
						icon: 'Spell_Holy_RighteousFury',
						rank: ['你的审判法术有33%的几率返还所用圣印的法力值消耗的80%。', '你的审判法术有66%的几率返还所用圣印的法力值消耗的80%。', '你的审判法术有100%的几率返还所用圣印的法力值消耗的80%。']
					},
					24: {
						name: '神圣圣印',
						icon: 'Spell_Holy_HolySmite',
						rank: ['你的所有法术和近战攻击的爆击几率提高1%，你的圣印被驱散的几率降低33%。', '你的所有法术和近战攻击的爆击几率提高2%，你的圣印被驱散的几率降低66%。', '你的所有法术和近战攻击的爆击几率提高3%，你的圣印被驱散的几率降低100%。']
					},
					25: {
						name: '忏悔',
						icon: 'Spell_Holy_PrayerOfHealing',
						rank: ['<i class="Fl">60 法力值</i><i class="Fr">20码有效距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">1分钟冷却时间</i><br>\
						使目标进入冥想状态，最多持续6秒。任何伤害都会唤醒目标。只对人型生物有效。']
					},
					26: {
						name: '神圣意志',
						icon: 'Spell_Holy_RighteousFury',
						rank: ['近战和远程爆击对你所造成的伤害降低4%。', '近战和远程爆击对你所造成的伤害降低7%。', '近战和远程爆击对你所造成的伤害降低10%。']
					},
					29: {
						name: '狂热',
						icon: 'Spell_Holy_Fanaticism',
						rely: 25,
						rank: [
							'所有可以造成爆击的审判法术的爆击几率提高3%，所有行为造成的威胁值降低6%（在正义之怒效果影响下时不会降低威胁值）。',
							'所有可以造成爆击的审判法术的爆击几率提高6%，所有行为造成的威胁值降低12%（在正义之怒效果影响下时不会降低威胁值）。',
							'所有可以造成爆击的审判法术的爆击几率提高9%，所有行为造成的威胁值降低18%（在正义之怒效果影响下时不会降低威胁值）。',
							'所有可以造成爆击的审判法术的爆击几率提高12%，所有行为造成的威胁值降低24%（在正义之怒效果影响下时不会降低威胁值）。',
							'所有可以造成爆击的审判法术的爆击几率提高15%，所有行为造成的威胁值降低30%（在正义之怒效果影响下时不会降低威胁值）。'
						]
					},
					33: {
						name: '十字军打击',
						icon: 'Spell_Holy_CrusaderStrike',
						rank: ['<i class="Fl">8% 基础法力值</i><i class="Fr">5码有效距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">6秒冷却时间</i><br><i class="Fl">需要近战武器</i><br>\
						瞬发的攻击，可以对目标造成110%的武器伤害，并刷新目标身上的所有审判持续时间。']
					}
				}
			}
		],
		priest: [
			{
				text: '戒律',
				icon: 'Spell_Holy_WordFortitude',
				texture: 'Discipline',
				talent: {
					1: {
						name: '坚定意志',
						icon: 'Spell_Magic_MageArmor',
						rank: ['使你抵抗昏迷、恐惧和沉默效果的几率提高3%。', '使你抵抗昏迷、恐惧和沉默效果的几率提高6%。', '使你抵抗昏迷、恐惧和沉默效果的几率提高9%。', '使你抵抗昏迷、恐惧和沉默效果的几率提高12%。', '使你抵抗昏迷、恐惧和沉默效果的几率提高15%。']
					},
					2: {
						name: '魔杖专精',
						icon: 'INV_Wand_01',
						rank: ['使你的魔杖伤害提高5%。', '使你的魔杖伤害提高10%。', '使你的魔杖伤害提高15%。', '使你的魔杖伤害提高20%。', '使你的魔杖伤害提高25%。']
					},
					4: {
						name: '无声消退',
						icon: 'Spell_Nature_ManaRegenTotem',
						rank: ['使你的神圣和戒律系法术造成的威胁值降低4%，并使你的法术被驱散的几率降低4%。', '使你的神圣和戒律系法术造成的威胁值降低8%，并使你的法术被驱散的几率降低8%。', '使你的神圣和戒律系法术造成的威胁值降低12%，并使你的法术被驱散的几率降低12%。', '使你的神圣和戒律系法术造成的威胁值降低16%，并使你的法术被驱散的几率降低16%。', '使你的神圣和戒律系法术造成的威胁值降低20%，并使你的法术被驱散的几率降低20%。']
					},
					5: {
						name: '强化真言术：韧',
						icon: 'Spell_Holy_WordFortitude',
						rank: ['使你的真言术：韧和坚韧祷言的效果提高15%。', '使你的真言术：韧和坚韧祷言的效果提高30%。']
					},
					6: {
						name: '强化真言术：盾',
						icon: 'Spell_Holy_PowerWordShield',
						rank: ['使你的真言术：盾所吸收的伤害量提高5%。', '使你的真言术：盾所吸收的伤害量提高10%。', '使你的真言术：盾所吸收的伤害量提高15%。']
					},
					7: {
						name: '殉难',
						icon: 'Spell_Nature_Tranquility',
						rank: ['使你有50%的几率在受到敌人近战或远程爆击后得到专注施法效果，持续6秒。专注施法效果可以令你避免因为受到伤害而延长施法时间，并使你抵抗打断效果的几率提高10%。', '使你有100%的几率在受到敌人近战或远程爆击后得到专注施法效果，持续6秒。专注施法效果可以令你避免因为受到伤害而延长施法时间，并使你抵抗打断效果的几率提高20%。']
					},
					8: {
						name: '赦免',
						icon: 'Spell_Holy_Absolution',
						rank: ['使你的驱散魔法、治愈疾病、驱除疾病和群体驱散法术所消耗的法力值降低5%。', '使你的驱散魔法、治愈疾病、驱除疾病和群体驱散法术所消耗的法力值降低10%。', '使你的驱散魔法、治愈疾病、驱除疾病和群体驱散法术所消耗的法力值降低15%。']
					},
					9: {
						name: '心灵专注',
						icon: 'Spell_Frost_WindWalkOn',
						rank: ['<i class="Fl">瞬发</i><i class="Fr">3分钟冷却时间</i><br>\
						激活之后，你的下一个法术所消耗的法力值减少100%，爆击几率提高25%（如果它有可能造成爆击的话）。']
					},
					10: {
						name: '冥想',
						icon: 'Spell_Nature_Sleep',
						rank: ['使你在施法时仍保持10%的法力回复速度。', '使你在施法时仍保持20%的法力回复速度。', '使你在施法时仍保持30%的法力回复速度。']
					},
					12: {
						name: '强化心灵之火',
						icon: 'Spell_Holy_InnerFire',
						rank: ['使你的心灵之火的护甲增强效果提高10%。', '使你的心灵之火的护甲增强效果提高20%。', '使你的心灵之火的护甲增强效果提高30%。']
					},
					13: {
						name: '精神敏锐',
						icon: 'Ability_Hibernation',
						rank: ['使你的瞬发法术所消耗的法力值减少2%。', '使你的瞬发法术所消耗的法力值减少4%。', '使你的瞬发法术所消耗的法力值减少6%。', '使你的瞬发法术所消耗的法力值减少8%。', '使你的瞬发法术所消耗的法力值减少10%。']
					},
					15: {
						name: '强化法力燃烧',
						icon: 'Spell_Shadow_ManaBurn',
						rank: ['使你的法力燃烧的施法时间减少0.5秒。', '使你的法力燃烧的施法时间减少1.0秒。']
					},
					17: {
						name: '心灵之力',
						icon: 'Spell_Nature_EnchantArmor',
						rank: ['使你的法力值上限提高2%。', '使你的法力值上限提高4%。', '使你的法力值上限提高6%。', '使你的法力值上限提高8%。', '使你的法力值上限提高10%。']
					},
					18: {
						name: '神圣之灵',
						icon: 'Spell_Holy_DivineSpirit',
						rely: 10,
						rank: ['<i class="Fl">18% 基础法力值</i><i class="Fr">30码有效距离</i><br><i class="Fl">瞬发法术</i><br>\
						圣洁的能量充满目标全身，令其精神提高17点，持续30分钟。']
					},
					19: {
						name: '强化神圣之灵',
						icon: 'Spell_Holy_DivineSpirit',
						rely: 18,
						rank: ['你的神圣之灵和精神祷言法术令目标的法术伤害和治疗效果提高，数值相当于他们各自精神总值的5%。', '你的神圣之灵和精神祷言法术令目标的法术伤害和治疗效果提高，数值相当于他们各自精神总值的10%。']
					},
					20: {
						name: '能量集中',
						icon: 'Spell_Shadow_FocusedPower',
						rank: ['你的惩击、心灵震爆和群体驱散法术的命中几率提高2%。另外，你的群体驱散法术的施法时间减少0.5秒。', '你的惩击、心灵震爆和群体驱散法术的命中几率提高4%。另外，你的群体驱散法术的施法时间减少1秒。']
					},
					22: {
						name: '意志之力',
						icon: 'Spell_Nature_SlowingTotem',
						rank: ['使你的法术伤害提高1%，攻击法术的爆击几率提高1%。', '使你的法术伤害提高2%，攻击法术的爆击几率提高2%。', '使你的法术伤害提高3%，攻击法术的爆击几率提高3%。', '使你的法术伤害提高4%，攻击法术的爆击几率提高%。', '使你的法术伤害提高5%，攻击法术的爆击几率提高5%。']
					},
					24: {
						name: '专注意志',
						icon: 'Spell_Arcane_FocusedPower',
						rank: ['在受到爆击之后获得专注意志效果，在接下来的8秒内受到的爆击伤害降低2%，受到的治疗效果提高4%，可叠加最多3次。效果持续8秒。', '在受到爆击之后获得专注意志效果，在接下来的8秒内受到的爆击伤害降低3%，受到的治疗效果提高7%，可叠加最多3次。效果持续8秒。', '在受到爆击之后获得专注意志效果，在接下来的8秒内受到的爆击伤害降低4%，受到的治疗效果提高10%，可叠加最多3次。效果持续8秒。']
					},
					25: {
						name: '能量灌注',
						icon: 'Spell_Holy_PowerInfusion',
						rely: 17,
						rank: ['<i class="Fl">16% 基础法力值</i><i class="Fr">30码有效距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">3分钟冷却时间</i><br>\
						能量灌注目标全身，使其施法速度提高20%，所有法术的消耗降低20%，持续15秒。']
					},
					26: {
						name: '反射护盾',
						icon: 'Spell_Holy_PowerWordShield',
						rank: ['你的真言术：盾所吸收的伤害有10%反射给攻击者。这种伤害不会产生任何威胁值。', '你的真言术：盾所吸收的伤害有20%反射给攻击者。这种伤害不会产生任何威胁值。', '你的真言术：盾所吸收的伤害有30%反射给攻击者。这种伤害不会产生任何威胁值。', '你的真言术：盾所吸收的伤害有40%反射给攻击者。这种伤害不会产生任何威胁值。', '你的真言术：盾所吸收的伤害有50%反射给攻击者。这种伤害不会产生任何威胁值。']
					},
					29: {
						name: '启迪',
						icon: 'Spell_Arcane_MindMastery',
						rank: ['使你的耐力、智力和精神总值提高1%。', '使你的耐力、智力和精神总值提高2%。', '使你的耐力、智力和精神总值提高3%。', '使你的耐力、智力和精神总值提高4%。', '使你的耐力、智力和精神总值提高5%。']
					},
					33: {
						name: '痛苦压制',
						icon: 'Spell_Holy_PainSupression',
						rank: ['<i class="Fl">8% 法力值</i><br><i class="Fl">瞬发法术</i><i class="Fr">2分钟冷却时间</i><br>\
						立即使一个友方目标的威胁值降低5%，受到的所有伤害降低40%，抵抗驱散效果的几率提高65%，效果持续8秒。']
					}
				}
			},
			{
				text: '神圣',
				icon: 'Spell_Holy_HolyBolt',
				texture: 'Holy_Priest',
				talent: {
					0: {
						name: '治疗专注',
						icon: 'Spell_Holy_HealingFocus',
						rank: ['使你有35%的几率在施放任何治疗法术时不会因为受到伤害而中断施法。', '使你有70%的几率在施放任何治疗法术时不会因为受到伤害而中断施法。']
					},
					1: {
						name: '强化恢复',
						icon: 'Spell_Holy_Renew',
						rank: ['使你的恢复法术的治疗量提高5%。', '使你的恢复法术的治疗量提高10%。', '使你的恢复法术的治疗量提高15%。']
					},
					2: {
						name: '神圣专精',
						icon: 'spell_holy_sealofsalvation',
						rank: ['使你的神圣法术的爆击几率提高1%。', '使你的神圣法术的爆击几率提高2%。', '使你的神圣法术的爆击几率提高3%。', '使你的神圣法术的爆击几率提高4%。', '使你的神圣法术的爆击几率提高5%。']
					},
					5: {
						name: '法术屏障',
						icon: 'Spell_Holy_SpellWarding',
						rank: ['使你受到的所有法术伤害降低2%。', '使你受到的所有法术伤害降低4%。', '使你受到的所有法术伤害降低6%。', '使你受到的所有法术伤害降低8%。', '使你受到的所有法术伤害降低10%。']
					},
					6: {
						name: '神圣之怒',
						icon: 'Spell_Holy_SealOfWrath',
						rank: ['使你的惩击、神圣之火、治疗术和强效治疗术的施法时间减少0.1秒。', '使你的惩击、神圣之火、治疗术和强效治疗术的施法时间减少0.2秒。', '使你的惩击、神圣之火、治疗术和强效治疗术的施法时间减少0.3秒。', '使你的惩击、神圣之火、治疗术和强效治疗术的施法时间减少0.4秒。', '使你的惩击、神圣之火、治疗术和强效治疗术的施法时间减少0.5秒。']
					},
					8: {
						name: '神圣新星',
						icon: 'Spell_Holy_HolyNova',
						rank: ['<i class="Fl">185 法力值</i><br><i class="Fl">瞬发法术</i><br>\
						制造一次以施法者为中心的能了爆炸，对半径10码内的所有目标造成29到34点神圣伤害，并为半径10码范围内的所有小队成员恢复54到63点生命值。这些效果不对怪物产生任何威胁值。']
					},
					9: {
						name: '神恩回复',
						icon: 'Spell_Holy_BlessedRecovery',
						rank: ['在遭受近战或远程爆击之后，为你在6秒内恢复相当于该伤害总量8%的生命值。', '在遭受近战或远程爆击之后，为你在6秒内恢复相当于该伤害总量16%的生命值。', '在遭受近战或远程爆击之后，为你在6秒内恢复相当于该伤害总量25%的生命值。']
					},
					11: {
						name: '灵感',
						icon: 'Spell_Holy_LayOnHands',
						rank: ['在你的快速治疗、治疗术、强效治疗术、治疗祷言或治疗之环对目标造成爆击效果后，使目标的护甲值提高8%，持续15秒。', '在你的快速治疗、治疗术、强效治疗术、治疗祷言或治疗之环对目标造成爆击效果后，使目标的护甲值提高16%，持续15秒。', '在你的快速治疗、治疗术、强效治疗术、治疗祷言或治疗之环对目标造成爆击效果后，使目标的护甲值提高25%，持续15秒。']
					},
					12: {
						name: '神圣延伸',
						icon: 'Spell_Holy_Purify',
						rank: ['使你的惩击和神圣之火的射程、治疗祷言、神圣新星和治疗之环的作用半径提高10%.', '使你的惩击和神圣之火的射程、治疗祷言、神圣新星和治疗之环的作用半径提高20%.']
					},
					13: {
						name: '强化治疗术',
						icon: 'Spell_Holy_Heal02',
						rank: ['使你的次级治疗术、治疗术和强效治疗术的法力值消耗降低5%。', '使你的次级治疗术、治疗术和强效治疗术的法力值消耗降低10%。', '使你的次级治疗术、治疗术和强效治疗术的法力值消耗降低15%。']
					},
					14: {
						name: '灼热之光',
						icon: 'Spell_Holy_SearingLightPriest',
						rely: 6,
						rank: ['使你的惩击和神圣之火的伤害提高5%。', '使你的惩击和神圣之火的伤害提高10%。']
					},
					16: {
						name: '治疗祈祷',
						icon: 'Spell_Holy_PrayerOfHealing02',
						rank: ['使你的治疗祷言和愈合祷言所消耗的法力值减少10%。', '使你的治疗祷言和愈合祷言所消耗的法力值减少20%。']
					},
					17: {
						name: '救赎之魂',
						icon: 'INV_Enchant_EssenceEternalLarge',
						rank: ['使你的精神总值提高5%。当牧师在死亡之后变身成为救赎之魂，持续15秒钟。救赎之魂无法移动、攻击、被攻击或被任何法术效果影响。在这个状态下，牧师可以随意施放任何治疗法术。效果结束之后，牧师死亡。']
					},
					18: {
						name: '精神指引',
						icon: 'Spell_Holy_SpiritualGuidence',
						rank: ['使你的法术的伤害和治疗效果提高，数值最多相当于你精神值的5%。', '使你的法术的伤害和治疗效果提高，数值最多相当于你精神值的10%。', '使你的法术的伤害和治疗效果提高，数值最多相当于你精神值的15%。', '使你的法术的伤害和治疗效果提高，数值最多相当于你精神值的20%。', '使你的法术的伤害和治疗效果提高，数值最多相当于你精神值的25%。']
					},
					20: {
						name: '圣光涌动',
						icon: 'Spell_Holy_SurgeOfLight',
						rank: ['你的法术爆击有25%的几率令你的下一次惩击法术变为瞬发，不消耗法力值，但是无法造成爆击。这个效果可以持续10秒。', '你的法术爆击有50%的几率令你的下一次惩击法术变为瞬发，不消耗法力值，但是无法造成爆击。这个效果可以持续10秒。']
					},
					22: {
						name: '精神治疗',
						icon: 'Spell_Nature_MoonGlow',
						rank: ['使你的治疗法术的治疗效果提高2%。', '使你的治疗法术的治疗效果提高4%。', '使你的治疗法术的治疗效果提高6%。', '使你的治疗法术的治疗效果提高8%。', '使你的治疗法术的治疗效果提高10%。']
					},
					24: {
						name: '神圣专注',
						icon: 'Spell_Holy_Fanaticism',
						rank: ['使你有2%的几率在施放快速治疗、联结治疗或强效治疗术之后进入节能施法状态。节能施法可以令你的下一个快速治疗、联结治疗或强效治疗术的法力值消耗降低100%。', '使你有4%的几率在施放快速治疗、联结治疗或强效治疗术之后进入节能施法状态。节能施法可以令你的下一个快速治疗、联结治疗或强效治疗术的法力值消耗降低100%。', '使你有6%的几率在施放快速治疗、联结治疗或强效治疗术之后进入节能施法状态。节能施法可以令你的下一个快速治疗、联结治疗或强效治疗术的法力值消耗降低100%。']
					},
					25: {
						name: '光明之泉',
						icon: 'Spell_Holy_SummonLightwell',
						rely: 17,
						rank: ['<i class="Fl">225 法力值</i><i class="Fr">40码有效距离</i><br><i class="Fl">1.5秒施法时间</i><i class="Fr">6分钟冷却时间</i><br>\
						在牧师身边制造一个光明之泉。你所属的小队或团队中的友方单位可以点击光明之泉，在6秒内恢复801点生命值。被攻击会中断这个效果。光明之泉在3分钟或者在被使用5次后消失。']
					},
					26: {
						name: '神佑之韧',
						icon: 'Spell_Holy_BlessedResillience',
						rank: ['你遭受爆击之后有20%的几率在接下来的6秒内不会再受到爆击。', '你遭受爆击之后有40%的几率在接下来的6秒内不会再受到爆击。', '你遭受爆击之后有60%的几率在接下来的6秒内不会再受到爆击。']
					},
					29: {
						name: '治疗增效',
						icon: 'Spell_Holy_GreaterHeal',
						rank: ['提高法术治疗的效果对你的强效治疗术有4%的额外加成，对你的快速治疗和联结治疗有2%的额外加成。', '提高法术治疗的效果对你的强效治疗术有8%的额外加成，对你的快速治疗和联结治疗有4%的额外加成。', '提高法术治疗的效果对你的强效治疗术有12%的额外加成，对你的快速治疗和联结治疗有6%的额外加成。', '提高法术治疗的效果对你的强效治疗术有16%的额外加成，对你的快速治疗和联结治疗有8%的额外加成。', '提高法术治疗的效果对你的强效治疗术有20%的额外加成，对你的快速治疗和联结治疗有10%的额外加成。']
					},
					33: {
						name: '治疗之环',
						icon: 'Spell_Holy_CircleOfRenewal',
						rank: ['<i class="Fl">300 法力值</i><i class="Fr">40码有效距离</i><br><i class="Fl">瞬发法术</i><br>\
						治疗友方目标及其身边半径15码范围内的该目标小队成员，恢复304到334点生命值。']
					}
				}
			},
			{
				text: '暗影',
				icon: 'Spell_Shadow_ShadowWordPain',
				texture: 'Shadow',
				talent: {
					1: {
						name: '精神分流',
						icon: 'Spell_Shadow_Requiem',
						rank: [
							'使你有20%的几率在杀死一个可以为你提供经验值或荣誉值的目标之后精神属性提高100%。在这段时间里，你的法力值可以在施法时仍保持50%的回复速度。持续15秒。',
							'使你有40%的几率在杀死一个可以为你提供经验值或荣誉值的目标之后精神属性提高100%。在这段时间里，你的法力值可以在施法时仍保持50%的回复速度。持续15秒。',
							'使你有60%的几率在杀死一个可以为你提供经验值或荣誉值的目标之后精神属性提高100%。在这段时间里，你的法力值可以在施法时仍保持50%的回复速度。持续15秒。',
							'使你有80%的几率在杀死一个可以为你提供经验值或荣誉值的目标之后精神属性提高100%。在这段时间里，你的法力值可以在施法时仍保持50%的回复速度。持续15秒。',
							'使你有100%的几率在杀死一个敌人并因此获得经验值之后精神属性提高100%。在这段时间里，你的法力值可以在施法时仍保持50%的回复速度。持续15秒。'
						]
					},
					2: {
						name: '昏厥',
						icon: 'Spell_Shadow_GatherShadows',
						rank: ['使你的暗影系伤害性法术有2%的几率令目标昏迷3秒。', '使你的暗影系伤害性法术有4%的几率令目标昏迷3秒。', '使你的暗影系伤害性法术有6%的几率令目标昏迷3秒。', '使你的暗影系伤害性法术有8%的几率令目标昏迷3秒。', '使你的暗影系伤害性法术有10%的几率令目标昏迷3秒。']
					},
					4: {
						name: '暗影亲和',
						icon: 'Spell_Shadow_ShadowWard',
						rank: ['使你的暗影法术造成的威胁值降低8%。', '使你的暗影法术造成的威胁值降低16%。', '使你的暗影法术造成的威胁值降低25%。']
					},
					5: {
						name: '强化暗言术：痛',
						icon: 'Spell_Shadow_ShadowWordPain',
						rank: ['使你的暗言术：痛的持续时间延长3秒。', '使你的暗言术：痛的持续时间延长6秒。']
					},
					6: {
						name: '暗影集中',
						icon: 'Spell_Shadow_BurningSpirit',
						rank: ['使目标抵抗你的暗影法术的机率下降2%。', '使目标抵抗你的暗影法术的机率下降4%。', '使目标抵抗你的暗影法术的机率下降6%。', '使目标抵抗你的暗影法术的机率下降8%。', '使目标抵抗你的暗影法术的机率下降10%。']
					},
					8: {
						name: '强化心灵尖啸',
						icon: 'Spell_Shadow_PsychicScream',
						rank: ['使你的心灵尖啸的冷却时间减少2秒。', '使你的心灵尖啸的冷却时间减少4秒。']
					},
					9: {
						name: '强化心灵震爆',
						icon: 'Spell_Shadow_UnholyFrenzy',
						rank: ['使你的心灵震爆的冷�������时间减少0.5秒。', '使你的心灵震爆的冷却时间减少1秒。', '使你的心灵震爆的冷却时间减少1.5秒。', '使你的心灵震爆的冷却时间减少2秒。', '使你的心灵震爆的冷却时间减少2.5秒。']
					},
					10: {
						name: '精神鞭笞',
						icon: 'Spell_Shadow_SiphonMana',
						rank: ['<i class="Fl">45 法力值</i><i class="Fr">20码有效距离</i><br><i class="Fl">需引导</i><br>\
						以暗影能量攻击目标的灵魂，在3秒内对其造成总计75点暗影伤害，并使其移动速度降低50%。']
					},
					13: {
						name: '强化渐隐术',
						icon: 'spell_magic_lesserinvisibilty',
						rank: ['使你的渐隐术的冷却时间减少3秒。', '使你的渐隐术的冷却时间减少6秒。']
					},
					14: {
						name: '暗影延伸',
						icon: 'Spell_Shadow_ChillTouch',
						rank: ['使你的暗影系伤害性法术的射程提高10%。', '使你的暗影系伤害性法术的射程提高20%。']
					},
					15: {
						name: '暗影之波',
						icon: 'Spell_Shadow_BlackPlague',
						rank: [
							'你的暗影系伤害性法术有20%的机会使你的目标在受到暗影系攻击时更脆弱，受到的伤害提高2%，持续15秒。此效果最多可叠加5次。',
							'你的暗影系伤害性法术有40%的机会使你的目标在受到暗影系攻击时更脆弱，受到的伤害提高2%，持续15秒。此效果最多可叠加5次。',
							'你的暗影系伤害性法术有60%的机会使你的目标在受到暗影系攻击时更脆弱，受到的伤害提高2%，持续15秒。此效果最多可叠加5次。',
							'你的暗影系伤害性法术有80%的机会使你的目标在受到暗影系攻击时更脆弱，受到的伤害提高2%，持续15秒。此效果最多可叠加5次。',
							'你的暗影系伤害性法术有100%的机会使你的目标在受到暗影系攻击时更脆弱，受到的伤害提高2%，持续15秒。此效果最多可叠加5次。'
						]
					},
					16: {
						name: '沉默',
						icon: 'Spell_Shadow_ImpPhaseShift',
						rely: 8,
						rank: ['<i class="Fl">225 法力值</i><i class="Fr">20码有效距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">45秒冷却时间</i><br>\
						使目标沉默，在5秒内不能施法。']
					},
					17: {
						name: '吸血鬼的拥抱',
						icon: 'Spell_Shadow_UnsummonBuilding',
						rank: ['<i class="Fl">2% 基础法力值</i><i class="Fr">30码有效距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">10秒冷却时间</i><br>\
						暗影魔法的能量笼罩你的目标，使你对其造成的暗影伤害总量的20%转而治疗所有队友。']
					},
					18: {
						name: '强化吸血鬼的拥抱',
						icon: 'Spell_Shadow_ImprovedVampiricEmbrace',
						rely: 17,
						rank: ['使吸血鬼的拥抱恢复生命值的百分比提高5%。', '使吸血鬼的拥抱恢复生命值的百分比提高10%。']
					},
					19: {
						name: '心灵集中',
						icon: 'Spell_Nature_FocusedMind',
						rank: ['使你的心灵震爆、精神控制和精神鞭笞所消耗的法力值降低5%。', '使你的心灵震爆、精神控制和精神鞭笞所消耗的法力值降低10%。', '使你的心灵震爆、精神控制和精神鞭笞所消耗的法力值降低15%。']
					},
					20: {
						name: '暗影之韧',
						icon: 'Spell_Shadow_GrimWard',
						rank: ['使所有攻击对你产生爆击效果的几率降低2%。', '使所有攻击对你产生爆击效果的几率降低4%。']
					},
					22: {
						name: '黑暗',
						icon: 'Spell_Shadow_Twilight',
						rank: ['使你的暗影法术伤害提高2%。', '使你的暗影法术伤害提高4%。', '使你的暗影法术伤害提高6%。', '使你的暗影法术伤害提高8%。', '使你的暗影法术伤害提高10%。']
					},
					25: {
						name: '暗影形态',
						icon: 'Spell_Shadow_Shadowform',
						rely: 17,
						rank: ['<i class="Fl">32% 基础法力值</i><br><i class="Fl">瞬发法术</i><i class="Fr">1.5秒冷却时间</i><br>\
						进入暗影形态，使你能造成的暗影伤害提高15%，受到物理攻击时承受的伤害降低15%。但是在这个形态下，你不能施放神圣系的法术。']
					},
					26: {
						name: '暗影能量',
						icon: 'Spell_Shadow_ShadowPower',
						rank: ['你的心灵震爆和暗言术：灭的爆击几率提高3%。', '你的心灵震爆和暗言术：灭的爆击几率提高6%。', '你的心灵震爆和暗言术：灭的爆击几率提高9%。', '你的心灵震爆和暗言术：灭的爆击几率提高12%。', '你的心灵震爆和暗言术：灭的爆击几率提高15%。']
					},
					30: {
						name: '悲惨',
						icon: 'Spell_Shadow_Misery',
						rank: ['你的暗言术：灭、精神鞭笞和吸血鬼之触会使目标承受的法术伤害提高1%。', '你的暗言术：灭、精神鞭笞和吸血鬼之触会使目标承受的法术伤害提高2%。', '你的暗言术：灭、精神鞭笞和吸血鬼之触会使目标承受的法术伤害提高3%。', '你的暗言术：灭、精神鞭笞和吸血鬼之触会使目标承受的法术伤害提高4%。', '你的暗言术：灭、精神鞭笞和吸血鬼之触会使目标承受的法术伤害提高5%。']
					},
					33: {
						name: '吸血鬼之触',
						icon: 'Spell_Holy_Stoicism',
						rely: 25,
						rank: ['<i class="Fl">325 法力值</i><i class="Fr">30码有效距离</i><br><i class="Fl">1.5秒施法时间</i><br>\
						在15秒内对目标造成450点暗影伤害，并使所有小队成员获得法力值，数值相当于你所造成的任何暗影伤害的5%。']
					}
				}
			}
		],
		rogue: [
			{
				text: '刺杀',
				icon: 'Ability_Rogue_Eviscerate',
				texture: 'Assassination',
				talent: {
					0: {
						name: '强化刺骨',
						icon: 'Ability_Rogue_Eviscerate',
						rank: ['使你的刺骨技能所造成的伤害提高5%。', '使你的刺骨技能所造成的伤害提高10%。', '使你的刺骨技能所造成的伤害提高15%。']
					},
					1: {
						name: '冷酷攻击',
						icon: 'Ability_FiegnDead',
						rank: ['在你杀死一个可为你提供经验值的敌人后，你的下一次影袭、背刺、伏击、毁伤或鬼魅攻击有20%的额外几率造成爆击，效果持续20秒。', '在你杀死一个可为你提供经验值的敌人后，你的下一次影袭、背刺、伏击、毁伤或鬼魅攻击有40%的额外几率造成爆击，效果持续20秒。']
					},
					2: {
						name: '恶意',
						icon: 'Ability_Racial_BloodRage',
						rank: ['使你的爆击率提高1%。', '使你的爆击几率提高2%。', '使你的爆击几率提高3%。', '使你的爆击几率提高4%。', '使你的爆击几率提高5%。']
					},
					4: {
						name: '无情',
						icon: 'Ability_Druid_Disembowel',
						rank: ['使你的终极技有20%的几率为目标增加一个连击点数。', '使你的终极技有40%的几率为目标增加一个连击点数。', '使你的终极技有60%的几率为目标增加一个连击点数。']
					},
					5: {
						name: '谋划',
						icon: 'Spell_Shadow_DeathScream',
						rank: ['使你对人型生物、巨人、野兽和龙类所造成的所有伤害提高1%。', '使你对人型生物、巨人、野兽和龙类所造成的所有伤害提高2%。']
					},
					7: {
						name: '穿刺之伤',
						icon: 'Ability_BackStab',
						rank: ['使你的背刺技能的爆击几率提高10%，毁伤技能的爆击几率提高5%。', '使你的背刺技能的爆击几率提高20%，毁伤技能的爆击几率提高10%。', '使你的背刺技能的爆击几率提高30%，毁伤技能的爆击几率提高15%。']
					},
					8: {
						name: '无情打击',
						icon: 'Ability_Warrior_DecisiveStrike',
						rank: ['你的终结技有每连击点数20%的几率恢复25点能量值。']
					},
					9: {
						name: '强化破甲',
						icon: 'Ability_Warrior_Riposte',
						rank: ['使你的破甲技能令目标护甲值降低的效果提高25%。', '使你的破甲技能令目标护甲值降低的效果提高50%。']
					},
					10: {
						name: '致命偷袭',
						icon: 'Ability_CriticalStrike',
						rely: 2,
						rank: ['使你的影袭、凿击、背刺、鬼魅攻击、毁伤、毒刃和出血技能的爆击伤害加成提高6%。', '使你的影袭、凿击、背刺、鬼魅攻击、毁伤、毒刃和出血技能的爆击伤害加成提高12%。', '使你的影袭、凿击、背刺、鬼魅攻击、毁伤、毒刃和出血技能的爆击伤害加成提高18%。', '使你的影袭、凿击、背刺、鬼魅攻击、毁伤、毒刃和出血技能的爆击伤害加成提高24%。', '使你的影袭、凿击、背刺、鬼魅攻击、毁伤、毒刃和出血技能的爆击伤害加成提高30%。']
					},
					13: {
						name: '剧毒',
						icon: 'Ability_Rogue_FeignDeath',
						rank: ['使你的毒素所造成的伤害提高4%，并使你的毒药抵抗驱散效果的几率提高8%。', '使你的毒素所造成的伤害提高8%，并使你的毒药抵抗驱散效果的几率提高16%。', '使你的毒素所造成的伤害提高12%，并使你的毒药抵抗驱散效果的几率提高24%。', '使你的毒素所造成的伤害提高16%，并使你的毒药抵抗驱散效果的几率提高32%。', '使你的毒素所造成的伤害提高20%，并使你的毒药抵抗驱散效果的几率提高40%。']
					},
					14: {
						name: '强化药膏',
						icon: 'Ability_Poisons',
						rank: ['使你的毒药对敌人生效的几率提高2%。', '使你的毒药对敌人生效的几率提高4%。', '使你的毒药对敌人生效的几率提高6%。', '使你的毒药对敌人生效的几率提高8%。', '使你的毒药对敌人生效的几率提高10%。']
					},
					16: {
						name: '健步如飞',
						icon: 'Ability_Rogue_FleetFooted',
						rank: ['使你抵抗移动限制效果的几率提高5%，并且使你的移动速度提高8%。该效果不能与其它移动加速效果叠加。', '使你抵抗移动限制效果的几率提高10%，并且使你的移动速度提高15%。该效果不能与其它移动加速效果叠加。']
					},
					17: {
						name: '冷血',
						icon: 'Spell_Ice_Lament',
						rank: ['<i class="Fl">瞬发</i><i class="Fr">3分钟冷却时间</i><br>\
						激活之后，你的下一次攻击技能的爆击几率提高100%。']
					},
					18: {
						name: '强化肾击',
						icon: 'Ability_Rogue_KidneyShot',
						rank: ['当你的肾击对敌人生效后，目标所受到的伤害提高3%。', '当你的肾击对敌人生效后，目标所受到的伤害提高6%。', '当你的肾击对敌人生效后，目标所受到的伤害提高9%。']
					},
					19: {
						name: '快速恢复',
						icon: 'Ability_Rogue_QuickRecovery',
						rank: ['所有在你身上的治疗效果增加10%。另外，你的终极技在未击中时所消耗的能量值减少40%。', '所有在你身上的治疗效果增加20%。另外，你的终极技在未击中时所消耗的能量值减少80%。']
					},
					21: {
						name: '封印命运',
						icon: 'Spell_Shadow_ChillTouch',
						rely: 17,
						rank: ['如果你的某个可以增加连击点数的技能造成了爆击，那么它就有20%的几率增加一个额外的连击点数。', '如果你的某个可以增加连击点数的技能造成了爆击，那么它就有40%的几率增加一个额外的连击点数。', '如果你的某个可以增加连击点数的技能造成了爆击，那么它就有60%的几率增加一个额外的连击点数。', '如果你的某个可以增加连击点数的技能造成了爆击，那么它就有80%的几率增加一个额外的连击点数。', '如果你的某个可以增加连击点数的技能造成了爆击，那么它就有100%的几率增加一个额外的连击点数。']
					},
					22: {
						name: '奇毒',
						icon: 'Ability_Creature_Poison_06',
						rank: ['使你的毒药被抵抗的几率降低5%，额外还使你抵抗毒药的几率提高15%。', '使你的毒药被抵抗的几率降低10%，额外还使你抵抗毒药的几率提高30%。']
					},
					25: {
						name: '精力',
						icon: 'spell_nature_earthbindtotem',
						rank: ['使你的能量值上限提高10点。']
					},
					26: {
						name: '勇气衰竭',
						icon: 'Ability_Rogue_DeadenedNerves',
						rank: ['使你受到物理攻击时所承受的伤害减少1%。', '使你受到物理攻击时所承受的伤害减少2%。', '使你受到物理攻击时所承受的伤害减少3%。', '使你受到物理攻击时所承受的伤害减少4%。', '使你受到物理攻击时所承受的伤害减少5%。']
					},
					30: {
						name: '寻找弱点',
						icon: 'Ability_Rogue_FindWeakness',
						rank: ['使你的终极技在接下来的10秒内提高所有攻击型技能的伤害2%。', '使你的终极技在接下来的10秒内提高所有攻击型技能的伤害4%。', '使你的终极技在接下来的10秒内提高所有攻击型技能的伤害6%。', '使你的终极技在接下来的10秒内提高所有攻击型技能的伤害8%。', '使你的终极技在接下来的10秒内提高所有攻击型技能的伤害10%。']
					},
					33: {
						name: '毁伤',
						icon: 'ability_rogue_shadowstrikes',
						rely: 25,
						rank: ['<i class="Fl">60 能量</i><i class="Fr">5码距离</i><br><i class="Fl">瞬发</i><br><i class="Fl">需要匕首</i><br>\
						同时用两把武器攻击目标，每把武器所造成的伤害都提高44点。如果目标处于中毒状态，则对其造成伤害提高50%。必须从目标背后发动，奖励2个连击点数。']
					}
				}
			},
			{
				text: '战斗',
				icon: 'Ability_BackStab',
				texture: 'Combat',
				talent: {
					0: {
						name: '强化凿击',
						icon: 'Ability_Gouge',
						rank: ['使你的凿击技能的效果持续时间延长0.5秒。', '使你的凿击技能的效果持续时间延长1秒。', '使你的凿击技能的效果持续时间延长1.5秒。']
					},
					1: {
						name: '强化影袭',
						icon: 'spell_shadow_ritualofsacrifice',
						rank: ['使你的影袭技能所消耗的能量值减少3。', '使你的影袭技能所消耗的能量值减少5。']
					},
					2: {
						name: '闪电反射',
						icon: 'Spell_Nature_Invisibilty',
						rank: ['使你的躲闪几率提高1%。', '使你的躲闪几率提高2%。', '使你的躲闪几率提高3%。', '使你的躲闪几率提高4%。', '使你的躲闪几率提高5%。']
					},
					4: {
						name: '强化切割',
						icon: 'Ability_Rogue_SliceDice',
						rank: ['使你的切割技能的效果持续时间延长15%。', '使你的切割技能的效果持续时间延长30%。', '使你的切割技能的效果持续时间延长45%。']
					},
					5: {
						name: '偏斜',
						icon: 'Ability_Parry',
						rank: ['使你的招架几率提高1%。', '使你的招架几率提高2%。', '使你的招架几率提高3%。', '使你的招架几率提高4%。', '使你的招架几率提高5%。']
					},
					6: {
						name: '精确',
						icon: 'Ability_Marksmanship',
						rank: ['使你的武器击中几率提高1%。', '使你的武器击中几率提高2%。', '使你的武器击中几率提高3%。', '使你的武器击中几率提高4%。', '使你的武器击中几率提高5%。']
					},
					8: {
						name: '耐久',
						icon: 'Spell_Shadow_ShadowWard',
						rank: ['降低你疾跑和闪避技能的冷却时间45秒。', '降低你疾跑和闪避技能的冷却时间1.5分钟。']
					},
					9: {
						name: '还击',
						icon: 'Ability_Warrior_Challange',
						rely: 5,
						rank: ['<i class="Fl">10 能量</i><i class="Fr">5码距离</i><br><i class="Fl">瞬发</i><i class="Fr">6秒冷却时间</i><br>\
						在招架了敌人的攻击之后可以使用的技能，对目标造成150%的武器伤害，并使其被缴械，持续6秒钟。']
					},
					11: {
						name: '强化疾跑',
						icon: 'Ability_Rogue_Sprint',
						rank: ['使你在启动疾跑技能时有50%的几率移除所有移动限制效果。', '使你在启动疾跑技能时有100%的几率移除所有移动限制效果。']
					},
					12: {
						name: '强化脚踢',
						icon: 'Ability_Kick',
						rank: ['使你的脚踢技能有50%的几率令目标沉默2秒。', '使你的脚踢技能有100%的几率令目标沉默2秒。']
					},
					13: {
						name: '匕首专精',
						icon: 'INV_Weapon_ShortBlade_05',
						rank: ['使你的匕首的爆击几率提高1%。', '使你的匕首的爆击几率提高2%。', '使你的匕首的爆击几率提高3%。', '使你的匕首的爆击几率提高4%。', '使你的匕首的爆击几率提高5%。']
					},
					14: {
						name: '双武器专精',
						icon: 'Ability_DualWield',
						rely: 6,
						rank: ['使你的副手武器造成的伤害提高10%。', '使你的副手武器造成的伤害提高20%。', '使你的副手武器造成的伤害提高30%。', '使你的副手武器造成的伤害提高40%。', '使你的副手武器造成的伤害提高50%。']
					},
					16: {
						name: '锤类武器专精',
						icon: 'INV_Mace_01',
						rank: ['使你的锤类武器爆击之后所造成的伤害提高1%，用锤类武器击中目标时有1%的几率将其击晕3秒。', '使你的锤类武器爆击之后所造成的伤害提高2%，用锤类武器击中目标时有2%的几率将其击晕3秒。', '使你的锤类武器爆击之后所造成的伤害提高3%，用锤类武器击中目标时有3%的几率将其击晕3秒。', '使你的锤类武器爆击之后所造成的伤害提高4%，用锤类武器击中目标时有4%的几率将其击晕3秒。', '使你的锤类武器爆击之后所造成的伤害提高5%，用锤类武器击中目标时有5%的几率将其击晕3秒。']
					},
					17: {
						name: '剑刃乱舞',
						icon: 'Ability_Warrior_PunishingBlow',
						rank: ['<i class="Fl">25 能量</i><br><i class="Fl">瞬发</i><i class="Fr">2分钟冷却时间</i><br><i class="Fl">需要近战武器</i><br>\
						使你的攻击速度提高20%。另外还可以对附近的一个额外的敌人造成伤害。持续15秒。']
					},
					18: {
						name: '剑类武器专精',
						icon: 'INV_Sword_27',
						rank: ['使你在用剑类武器击中敌人后有1%的几率进行一次额外的攻击。', '使你在用剑类武器击中敌人后有2%的几率进行一次额外的攻击。', '使你在用剑类武器击中敌人后有3%的几率进行一次额外的攻击。', '使你在用剑类武器击中敌人后有4%的几率进行一次额外的攻击。', '使你在用剑类武器击中敌人后有5%的几率进行一次额外的攻击。']
					},
					19: {
						name: '拳套武器专精',
						icon: 'INV_Gauntlets_04',
						rank: ['使你的拳套的爆击几率提高1%。', '使你的拳套的爆击几率提高2%。', '使你的拳套的爆击几率提高3%。', '使你的拳套的爆击几率提高4%。', '使你的拳套的爆击几率提高5%。']
					},
					20: {
						name: '剑刃飞转',
						icon: 'Ability_Rogue_BladeTwisting',
						rank: ['你的影袭、背刺、凿击和毒刃技能有10%的几率令目标眩晕8秒。', '你的影袭、背刺、凿击和毒刃技能有20%的几率令目标眩晕8秒。']
					},
					21: {
						name: '武器专家',
						icon: 'Spell_Holy_BlessingOfStrength',
						rely: 17,
						rank: ['使你的精准等级提高5。', '使你的精准等级提高10。']
					},
					22: {
						name: '侵犯',
						icon: 'Ability_Racial_Avatar',
						rank: ['使你的影袭和刺骨技能的伤害提高2%。', '使你的影袭和刺骨技能的伤害提高4%。', '使你的影袭和刺骨技能的伤害提高6%。']
					},
					24: {
						name: '活力',
						icon: 'Ability_Warrior_Revenge',
						rank: ['使你的耐力值上限提高2%，敏捷值上限提高1%。', '使你的耐力值上限提高4%，敏捷值上限提高2%。']
					},
					25: {
						name: '冲动',
						icon: 'Spell_Shadow_ShadowWordDominate',
						rank: ['<i class="Fl">瞬发</i><i class="Fr">5分钟冷却时间</i><br>\
						使你的能量值回复速度提高100%，持续15秒。']
					},
					26: {
						name: '钢铁意志',
						icon: 'Ability_Rogue_NervesOfSteel',
						rank: ['使你抵抗眩晕和恐惧效果的几率提高5%。', '使你抵抗眩晕和恐惧效果的几率提高10%。']
					},
					30: {
						name: '战斗潜能',
						icon: 'INV_Weapon_Shortblade_38',
						rank: ['使你的副手武器的命中攻击有20%的几率获得3点能量。', '使你的副手武器的命中攻击有20%的几率获得6点能量。', '使你的副手武器的命中攻击有20%的几率获得9点能量。', '使你的副手武器的命中攻击有20%的几率获得12点能量。', '使你的副手武器的命中攻击有20%的几率获得15点能量。']
					},
					33: {
						name: '突袭',
						icon: 'Ability_Rogue_SurpriseAttack',
						rely: 25,
						rank: ['你的终结技无法被躲闪，你的影袭、背刺、毒刃和凿击技能所造成的伤害提高10%。']
					}
				}
			},
			{
				text: '敏锐',
				icon: 'Ability_Stealth',
				texture: 'Subtlety',
				talent: {
					1: {
						name: '欺诈高手',
						icon: 'Spell_Shadow_Charm',
						rank: ['当你在潜行状态下时，降低敌人侦测到你的几率。', '当你在潜行状态下时，降低敌人侦测到你的几率。比欺诈高手(等级 1)更加有效。', '当你在潜行状态下时，降低敌人侦测到你的几率。比欺诈高手(等级 2)更加有效。', '当你在潜行状态下时，降低敌人侦测到你的几率。比欺诈高手(等级 3)更加有效。', '当你在潜行状态下时，降低敌人侦测到你的几率。比欺诈高手(等级 4)更加有效。']
					},
					2: {
						name: '伺机而动',
						icon: 'Ability_Warrior_WarCry',
						rank: ['使你在从背后使用背刺、毁伤、绞喉或伏击技能偷袭敌人时的伤害提高4%。', '使你在从背后使用背刺、毁伤、绞喉或伏击技能偷袭敌人时的伤害提高8%。', '使你在从背后使用背刺、毁伤、绞喉或伏击技能偷袭敌人时的伤害提高12%。', '使你在从背后使用背刺、毁伤、绞喉或伏击技能偷袭敌人时的伤害提高16%。', '使你在从背后使用背刺、毁伤、绞喉或伏击技能偷袭敌人时的伤害提高20%。']
					},
					4: {
						name: '狡诈',
						icon: 'Ability_Rogue_Feint',
						rank: ['使你受到近战和远程爆击的几率降低1%，并使你的佯攻技能降低仇恨的效果提高10%。', '使你受到近战和远程爆击的几率降低2%，并使你的佯攻技能降低仇恨的效果提高20%。']
					},
					5: {
						name: '邪恶计谋',
						icon: 'Ability_Sap',
						rank: ['使你的致盲和闷棍技能的射程延长2码，致盲和闷棍技能所消耗的能量值减少25%。', '使你的致盲和闷棍技能的射程延长5码，致盲和闷棍技能所消耗的能量值减少50%。']
					},
					6: {
						name: '伪装',
						icon: 'Ability_Stealth',
						rank: ['使你在潜行后的移动速度提高3%，并使你的潜行技能的冷却时间减少1秒。', '使你在潜行后的移动速度提高6%，并使你的潜行技能的冷却时间减少2秒。', '使你在潜行后的移动速度提高9%，并使你的潜行技能的冷却时间减少3秒。', '使你在潜行后的移动速度提高12%，并使你的潜行技能的冷却时间减少4秒。', '使你在潜行后的移动速度提高15%，并使你的潜行技能的冷却时间减少5秒。']
					},
					8: {
						name: '先发制人',
						icon: 'Spell_Shadow_Fumble',
						rank: ['使你有25%的几率在使用伏击、绞喉或偷袭技能后获得一个额外的连击点数。', '使你有50%的几率在使用伏击、绞喉或偷袭技能后获得一个额外的连击点数。', '使你有75%的几率在使用伏击、绞喉或偷袭技能后获得一个额外的连击点数。']
					},
					9: {
						name: '鬼魅攻击',
						icon: 'Spell_Shadow_Curse',
						rank: ['<i class="Fl">40 能量</i><i class="Fr">5码距离</i><br><i class="Fl">瞬发</i><i class="Fr">20秒冷却时间</i><br>\
						对敌人造成125%的武器伤害，并使你躲闪攻击的几率提高15%，持续7秒。奖励1个连击点数。']
					},
					10: {
						name: '强化伏击',
						icon: 'Ability_Rogue_Ambush',
						rank: ['使你的伏击技能的爆击几率提高15%。', '使你的伏击技能的爆击几率提高30%。', '使你的伏击技能的爆击几率提高45%。']
					},
					12: {
						name: '调整',
						icon: 'Spell_Nature_MirrorImage',
						rank: ['使你有15%的几率在成功躲闪敌人的攻击之后，或者完全抵抗敌人的法术后，获得一个连击点数。', '使你有30%的几率在成功躲闪敌人的攻击之后，或者完全抵抗敌人的法术后，获得一个连击点数。', '使你有45%的几率在成功躲闪敌人的攻击之后，或者完全抵抗敌人的法术后，获得一个连击点数。']
					},
					13: {
						name: '飘忽不定',
						icon: 'Spell_Magic_LesserInvisibilty',
						rank: ['使你的消失和致盲技能的冷却时间缩短45秒。', '使你的消失和致盲技能的冷却时间缩短1.5分钟。']
					},
					14: {
						name: '锯齿利刃',
						icon: 'INV_Sword_17',
						rank: ['使你的攻击忽视目标186点护甲，并使你的割裂技能所造成的伤害提高10%。削弱目标护甲的效果随着你的等级提高而提高。', '使你的攻击忽视目标373点护甲，并使你的割裂技能所造成的伤害提高20%。削弱目标护甲的效果随着你的等级提高而提高。', '使你的攻击忽视目标600点护甲，并使你的割裂技能所造成的伤害提高30%。削弱目标护甲的效果随着你的等级提高而提高。']
					},
					16: {
						name: '察觉',
						icon: 'Ability_Ambush',
						rank: ['提高你的潜行侦测能力，并且降低你被法术或远程攻击击中的几率2%。', '提高你的潜行侦测能力，并且降低你被法术或远程攻击击中的几率4%。比察觉（等级 1）更有效。']
					},
					17: {
						name: '伺机待发',
						icon: 'Spell_Shadow_AntiShadow',
						rank: ['<i class="Fl">瞬发</i><i class="Fr">10分钟冷却时间</i><br>\
			激活之后，这项技能立刻使你的闪避、疾跑、消失、冷血、暗影步和预谋技能的冷却时间结束。']
					},
					18: {
						name: '卑鄙',
						icon: 'Spell_Shadow_SummonSuccubus',
						rank: ['使你的偷袭和锁喉技能所消耗的能量值减少10点。另外，你的特殊技能对生命值低于35%的目标所造成的伤害提高10%。', '使你的偷袭和锁喉技能所消耗的能量值减少20点。另外，你的特殊技能对生命值低于35%的目标所造成的伤害提高20%。']
					},
					19: {
						name: '出血',
						icon: 'Spell_Shadow_LifeDrain',
						rely: 14,
						rank: ['<i class="Fl">35 能量</i><i class="Fr">近战范围</i><br><i class="Fl">瞬发</i><br><i class="Fl">需要近战武器</i><br>\
						立即对目标造成110%的武器伤害，并令其流血，使其在受到物理攻击时所承受的伤害提高最多42点。可最多生效10次，或者持续15秒。奖励1个连击点数。']
					},
					20: {
						name: '敏锐大师',
						icon: 'Ability_Rogue_MasterOfSubtlety',
						rank: ['在潜行状态下或脱离潜行状态6秒内，对目标造成4%的额外伤害。', '在潜行状态下或脱离潜行状态6秒内，对目标造成7%的额外伤害。', '在潜行状态下或脱离潜行状态6秒内，对目标造成10%的额外伤害。']
					},
					22: {
						name: '致命',
						icon: 'INV_Weapon_Crossbow_11',
						rank: ['使你的攻击强度提高2%。', '使你的攻击强度提高4%。', '使你的攻击强度提高6%。', '使你的攻击强度提高8%。', '使你的攻击强度提高10%。']
					},
					24: {
						name: '覆体之影',
						icon: 'Ability_Rogue_EnvelopingShadows',
						rank: ['使你躲避范围伤害攻击的几率提高5%。', '使你躲避范围伤害攻击的几率提高10%。', '使你躲避范围伤害攻击的几率提高15%。']
					},
					25: {
						name: '预谋',
						icon: 'spell_shadow_possession',
						rely: 17,
						rank: ['<i class="Fl">30码距离</i><br><i class="Fl">瞬发</i><i class="Fr">2分钟冷却时间</i><br><i class="rely">需要潜行</i>\
						使用此技能后，为你的当前目标增加2个连击点数。你必须在10秒内消耗掉这些点数，或者为其增加新的连击点数，否则它们就会消失。']
					},
					26: {
						name: '装死',
						icon: 'Ability_Rogue_CheatDeath',
						rank: [
							'你有33%的几率令任何可以导致你死亡的攻击对你造成的伤害只相当于你的生命上限的10%，并且使你受到的所有伤害降低最多90%，持续3秒（减免数值受韧性影响）。这个效果每1分钟只能触发一次。',
							'你有66%的几率令任何可以导致你死亡的攻击对你造成的伤害只相当于你的生命上限的10%，并且使你受到的所有伤害降低最多90%，持续3秒（减免数值受韧性影响）。这个效果每1分钟只能触发一次。',
							'你有100%的几率令任何可以导致你死亡的攻击对你造成的伤害只相当于你的生命上限的10%，并且使你受到的所有伤害降低最多90%，持续3秒（减免数值受韧性影响）。这个效果每1分钟只能触发一次。'
						]
					},
					29: {
						name: '邪恶召唤',
						icon: 'Ability_Rogue_SinisterCalling',
						rely: 25,
						rank: ['使你的敏捷总值提高3%，并使背刺和出血技能的百分比伤害加成提高1%。', '使你的敏捷总值提高6%，并使背刺和出血技能的百分比伤害加成提高2%。', '使你的敏捷总值提高9%，并使背刺和出血技能的百分比伤害加成提高3%。', '使你的敏捷总值提高12%，并使背刺和出血技能的百分比伤害加成提高4%。', '使你的敏捷总值提高15%，并使背刺和出血技能的百分比伤害加成提高5%。']
					},
					33: {
						name: '暗影步',
						icon: 'Ability_Rogue_Shadowstep',
						rank: ['<i class="Fl">10 能量</i><i class="Fr">25码距离</i><br><i class="Fl">瞬发</i><i class="Fr">30秒冷却时间</i><br>\
						尝试在暗影中行进，并出现在你的目标身后，移动速度提高70%，持续3秒。你的下一个技能所造成的伤害提高20%，威胁值降低50%。持续10秒。']
					}
				}
			}
		],
		shaman: [
			{
				text: '元素战斗',
				icon: 'Spell_Nature_Lightning',
				texture: 'Elemental',
				talent: {
					1: {
						name: '传导',
						icon: 'Spell_Nature_WispSplode',
						rank: ['使你的震击、闪电箭和闪电链所消耗的法力值减少2%。', '使你的震击、闪电箭和闪电链所消耗的法力值减少4%。', '使你的震击、闪电箭和闪电链所消耗的法力值减少6%。', '使你的震击、闪电箭和闪电链所消耗的法力值减少8%。', '使你的震击、闪电箭和闪电链所消耗的法力值减少10%。']
					},
					2: {
						name: '震荡',
						icon: 'Spell_Fire_Fireball',
						rank: ['使你的震击、闪电箭和闪电链的伤害提高1%。', '使你的震击、闪电箭和闪电链的伤害提高2%。', '使你的震击、闪电箭和闪电链的伤害提高3%。', '使你的震击、闪电箭和闪电链的伤害提高4%。', '使你的震击、闪电箭和闪电链的伤害提高5%。']
					},
					4: {
						name: '大地之握',
						icon: 'Spell_Nature_StoneClawTotem',
						rank: ['使你的石爪图腾的生命值提高25%，地缚图腾的影响范围增加10%。', '使你的石爪图腾的生命值提高50%，地缚图腾的影响范围增加20%。']
					},
					5: {
						name: '元素防护',
						icon: 'Spell_Nature_SpiritArmor',
						rank: ['使你在被火焰、冰霜和自然系法术击中时所承受的伤害降低4%。', '使你在被火焰、冰霜和自然系法术击中时所承受的伤害降低7%。', '使你在被火焰、冰霜和自然系法术击中时所承受的伤害降低10%。']
					},
					6: {
						name: '烈焰召唤',
						icon: 'Spell_Fire_Immolation',
						rank: ['使你的火系图腾所能造成的伤害提高5%。', '使你的火系图腾所能造成的伤害提高10%。', '使你的火系图腾所能造成的伤害提高15%。']
					},
					8: {
						name: '元素集中',
						icon: 'Spell_Shadow_ManaBurn',
						rank: ['你的任何火焰、冰霜或自然系的伤害性法术造成爆击之后，你都会进入节能施法状态。这个状态可以使你的下2个伤害性法术所消耗的法力值减少40%。']
					},
					9: {
						name: '回响',
						icon: 'Spell_Frost_FrostWard',
						rank: ['使你的震击法术的冷却时间减少0.2秒。', '使你的震击法术的冷却时间减少0.4秒。', '使你的震击法术的冷却时间减少0.6秒。', '使你的震击法术的冷却时间减少0.8秒。', '使你的震击法术的冷却时间减少1秒。']
					},
					10: {
						name: '雷霆召唤',
						icon: 'Spell_Nature_CallStorm',
						rank: ['使你的闪电箭和闪电链的爆击几率提高1%。', '使你的闪电箭和闪电链的爆击几率提高2%。', '使你的闪电箭和闪电链的爆击几率提高3%。', '使你的闪电箭和闪电链的爆击几率提高4%。', '使你的闪电箭和闪电链的爆击几率提高6%。']
					},
					12: {
						name: '强化火焰图腾',
						icon: 'Spell_Fire_SealOfFire',
						rank: ['使你的火焰新星图腾激活所需的延迟时间减少1秒，熔岩图腾所造成的威胁值降低25%。', '使你的火焰新星图腾激活所需的延迟时间减少2秒，熔岩图腾所造成的威胁值降低50%。']
					},
					13: {
						name: '风暴之眼',
						icon: 'Spell_Shadow_SoulLeech_2',
						rank: ['使你有33%的几率在受到敌人的近战或远程爆击后获得专注施法效果，持续6。专注施法效果可以令你避免因为受到伤害而延长萨满祭司法术的施法时间。', '使你有66%的几率在受到敌人的近战或远程爆击后获得专注施法效果，持续6。专注施法效果可以令你避免因为受到伤害而延长萨满祭司法术的施法时间。', '使你有100%的几率在受到敌人的近战或远程爆击后获得专注施法效果，持续6。专注施法效果可以令你避免因为受到伤害而延长萨满祭司法术的施法时间。']
					},
					15: {
						name: '元素浩劫',
						icon: 'Spell_Fire_ElementalDevastation',
						rank: ['使你的闪电箭和闪电链的射程延长3码。', '使你的闪电箭和闪电链的射程延长6码。']
					},
					16: {
						name: '风暴来临',
						icon: 'Spell_Nature_StormReach',
						rank: ['当你的宠物被激活后，你和你的宠物都会每10秒回复1%的生命值。', '当你的宠物被激活后，你和你的宠物都会每10秒回复2%的生命值。']
					},
					17: {
						name: '元素之怒',
						icon: 'Spell_Fire_Volcano',
						rank: ['使你的灼热图腾、熔岩图腾、火焰新星图腾以及你的火焰、冰霜和自然系法术的爆击伤害加成提高100%。']
					},
					19: {
						name: '冷酷风暴',
						icon: 'Spell_Nature_UnrelentingStorm',
						rank: ['每5秒为你恢复相当于你的智力值2%的法力值，在施法时仍然有效。', '每5秒为你恢复相当于你的智力值4%的法力值，在施法时仍然有效。', '每5秒为你恢复相当于你的智力值6%的法力值，在施法时仍然有效。', '每5秒为你恢复相当于你的智力值8%的法力值，在施法时仍然有效。', '每5秒为你恢复相当于你的智力值10%的法力值，在施法时仍然有效。']
					},
					20: {
						name: '元素精准',
						icon: 'Spell_Nature_ElementalPrecision_1',
						rank: ['使你的火焰、冰霜和自然系法术的命中几率提高2%，火焰、冰霜和自然系法术所造成的威胁值降低4%。', '使你的火焰、冰霜和自然系法术的命中几率提高4%，火焰、冰霜和自然系法术所造成的威胁值降低7%。', '使你的火焰、冰霜和自然系法术的命中几率提高6%，火焰、冰霜和自然系法术所造成的威胁值降低10。']
					},
					22: {
						name: '闪电掌握',
						icon: 'Spell_Lightning_LightningBolt01',
						rely: 10,
						rank: ['使你的闪电箭和闪电链的施法时间减少0.1秒。', '使你的闪电箭和闪电链的施法时间减少0.2秒。', '使你的闪电箭和闪电链的施法时间减少0.3秒。', '使你的闪电箭和闪电链的施法时间减少0.4秒。', '使你的闪电箭和闪电链的施法时间减少0.5秒。']
					},
					25: {
						name: '元素掌握',
						icon: 'Spell_Nature_WispHeal',
						rely: 17,
						rank: ['<i class="Fl">瞬发</i><i class="Fr">3分钟冷却时间</i><br>激活之后，你的下一个火焰、冰霜或自然法术有100%的几率造成爆击，且法力值消耗降低100%。']
					},
					26: {
						name: '元素之盾',
						icon: 'Spell_Nature_ElementalShields',
						rank: ['使你受到近战和远程爆击的几率降低2%。', '使你受到近战和远程爆击的几率降低4%。', '使你受到近战和远程爆击的几率降低6%。']
					},
					29: {
						name: '闪电过载',
						icon: 'Spell_Nature_LightningOverload',
						rank: [
							'你的闪电箭和闪电链法术有4%的几率令你对同一个目标施放第二个完全一样的法术，不需任何法力值消耗，但是伤害减半。',
							'你的闪电箭和闪电链法术有8%的几率令你对同一个目标施放第二个完全一样的法术，不需任何法力值消耗，但是伤害减半。',
							'你的闪电箭和闪电链法术有12%的几率令你对同一个目标施放第二个完全一样的法术，不需任何法力值消耗，但是伤害减半。',
							'你的闪电箭和闪电链法术有16%的几率令你对同一个目标施放第二个完全一样的法术，不需任何法力值消耗，但是伤害减半。',
							'你的闪电箭和闪电链法术有20%的几率令你对同一个目标施放第二个完全一样的法术，不需任何法力值消耗，但是伤害减半。'
						]
					},
					33: {
						name: '天怒图腾',
						icon: 'Spell_Nature_ShamanRage',
						rely: 29,
						rank: ['<i class="Fl">5% 基础法力值</i><br><i class="Fl">瞬发法术</i><br><i class="Fl">工具：火图腾</i><br>在施法者身边召唤一个生命值为5点的天怒图腾，持续2分钟。这个图腾可以使周围半径20码范围内的所有小队成员的法术命中几率和法术爆击几率提高3%。']
					}
				}
			},
			{
				text: '增强',
				icon: 'Spell_Nature_LightningShield',
				texture: 'Enhancement',
				talent: {
					1: {
						name: '先祖知识',
						icon: 'Spell_Shadow_GrimWard',
						rank: ['使你的法力值上限提高1%。', '使你的法力值上限提高2%。', '使你的法力值上限提高3%。', '使你的法力值上限提高4%。', '使你的法力值上限提高5%。']
					},
					2: {
						name: '盾牌专精',
						icon: 'INV_Shield_06',
						rank: ['使你用盾牌格挡攻击的几率提高1%，格挡成功后所减免的伤害量提高5%。', '使你用盾牌格挡攻击的几率提高2%，格挡成功后所减免的伤害量提高10%。', '使你用盾牌格挡攻击的几率提高3%，格挡成功后所减免的伤害量提高15%。', '使你用盾牌格挡攻击的几率提高4%，格挡成功后所减免的伤害量提高20%。', '使你用盾牌格挡攻击的几率提高5%，格挡成功后所减免的伤害量提高25%。']
					},
					4: {
						name: '守护图腾',
						icon: 'Spell_Nature_StoneSkinTotem',
						rank: ['使你的石肤图腾和风墙图腾所能吸收的伤害提高10%，根基图腾的冷却时间减少1秒。', '使你的石肤图腾和风墙图腾所能吸收的伤害提高20%，根基图腾的冷却时间减少2秒。']
					},
					5: {
						name: '雷鸣猛击',
						icon: 'Ability_ThunderBolt',
						rank: ['使你的武器的爆击几率提高1%。', '使你的武器的爆击几率提高2%。', '使你的武器的爆击几率提高3%。', '使你的武器的爆击几率提高4%。', '使你的武器的爆击几率提高5%。']
					},
					6: {
						name: '强化幽灵之狼',
						icon: 'Spell_Nature_SpiritWolf',
						rank: ['使你的幽魂之狼法术的施法时间减少1秒。', '使你的幽魂之狼法术的施法时间减少2秒。']
					},
					7: {
						name: '强化闪电之盾',
						icon: 'Spell_Nature_LightningShield',
						rank: ['使你的闪电之盾法术所造成的伤害提高5%。', '使你的闪电之盾法术所造成的伤害提高10%。', '使你的闪电之盾法术所造成的伤害提高15%。']
					},
					8: {
						name: '强化图腾',
						icon: 'Spell_Nature_EarthBindTotem',
						rank: ['使你的大地之力图腾和风之优雅图腾的效果提高8%。', '使你的大地之力图腾和风之优雅图腾的效果提高15%。']
					},
					10: {
						name: '萨满专注',
						icon: 'Spell_Nature_ElementalAbsorption',
						rank: ['在打出一次近战爆击之后，你将进入专注状态，使你的下一次震击法术所消耗的法力值减少60%。']
					},
					11: {
						name: '预知',
						icon: 'Spell_Nature_MirrorImage',
						rank: ['使你的躲闪几率提高1%。', '使你的躲闪几率提高2%。', '使你的躲闪几率提高3%。', '使你的躲闪几率提高4%。', '使你的躲闪几率提高5%。']
					},
					13: {
						name: '乱舞',
						icon: 'Ability_GhoulFrenzy',
						rely: 5,
						rank: ['在你打出爆击之后，使你的下3次近战攻击速度提高10%。', '在你打出爆击之后，使你的下3次近战攻击速度提高15%。', '在你打出爆击之后，使你的下3次近战攻击速度提高20%。', '在你打出爆击之后，使你的下3次近战攻击速度提高25%。', '在你打出爆击之后，使你的下3次近战攻击速度提高30%。']
					},
					14: {
						name: '坚韧',
						icon: 'Spell_Holy_Devotion',
						rank: ['使你因装备而获得的护甲值提高2%，你身上的所有移动限制效果的持续时间缩短10%。', '使你因装备而获得的护甲值提高4%，你身上的所有移动限制效果的持续时间缩短20%。', '使你因装备而获得的护甲值提高6%，你身上的所有移动限制效果的持续时间缩短30%。', '使你因装备而获得的护甲值提高8%，你身上的所有移动限制效果的持续时间缩短40%。', '使你因装备而获得的护甲值提高10%，你身上的所有移动限制效果的持续时间缩短50%。']
					},
					16: {
						name: '强化武器图腾',
						icon: 'Spell_Fire_EnchantWeapon',
						rank: ['使你的风怒图腾所提供的近战攻击强度加成提高15%，火舌图腾所造成的伤害提高6%。', '使你的风怒图腾所提供的近战攻击强度加成提高30%，火舌图腾所造成的伤害提高12%。']
					},
					17: {
						name: '灵魂武器',
						icon: 'Ability_Parry',
						rank: ['有一定几率招架敌人的近战攻击，并使你的近战攻击所产生的威胁值降低30%。']
					},
					18: {
						name: '元素武器',
						icon: 'Spell_Fire_FlameTounge',
						rank: ['使你的石化武器所造成的伤害提高7%，风怒武器效果所造成的伤害提高13%，火舌武器和冰封武器所造成的伤害提高5%。', '使你的石化武器所造成的伤害提高14%，风怒武器效果所造成的伤害提高27%，火舌武器和冰封武器所造成的伤害提高10%。', '使你的石化武器所造成的伤害提高20%，风怒武器效果所造成的伤害提高40%，火舌武器和冰封武器所造成的伤害提高15%。']
					},
					20: {
						name: '精神敏锐',
						icon: 'Spell_Nature_MentalQuickness',
						rank: ['使你的瞬发法术所消耗的法力值降低2%，并提高你的法术伤害和治疗效果，数值相当于你的攻击强度的10%。', '使你的瞬发法术所消耗的法力值降低4%，并提高你的法术伤害和治疗效果，数值相当于你的攻击强度的20%。', '使你的瞬发法术所消耗的法力值降低6%，并提高你的法术伤害和治疗效果，数值相当于你的攻击强度的30%。']
					},
					23: {
						name: '武器掌握',
						icon: 'Ability_Hunter_SwiftStrike',
						rank: ['使你的所有武器伤害提高2%。', '使你的所有武器伤害提高4%。', '使你的所有武器伤害提高6%。', '使你的所有武器伤害提高8%。', '使你的所有武器伤害提高10%。']
					},
					24: {
						name: '双武器专精',
						icon: 'Ability_DualWieldSpecialization',
						rely: 25,
						rank: ['使你在持双武器作战时的命中几率提高2%。', '使你在持双武器作战时的命中几率提高4%。', '使你在持双武器作战时的命中几率提高6%。']
					},
					25: {
						name: '双武器',
						icon: 'Ability_DualWield',
						rely: 17,
						rank: ['使你可以在副手上装备单手和副手武器。']
					},
					26: {
						name: '风暴打击',
						icon: 'Spell_Holy_SealOfMight',
						rely: 18,
						rank: ['<i class="Fl">8% 基础法力值</i><i class="Fr">近战范围</i><br><i class="Fl">瞬发法术</i><i class="Fr">10秒冷却时间</i><br>\
						立即使用两把武器攻击。另外，你的下2次攻击对敌人造成的自然伤害提高20%，持续12秒。']
					},
					29: {
						name: '怒火释放',
						icon: 'Spell_Nature_UnleashedRage',
						rank: ['你的近战爆击可以令身边半径20码范围内的所有小队成员的攻击强度提高2%。效果持续10秒。', '你的近战爆击可以令身边半径20码范围内的所有小队成员的攻击强度提高4%。效果持续10秒。', '你的近战爆击可以令身边半径20码范围内的所有小队成员的攻击强度提高6%。效果持续10秒。', '你的近战爆击可以令身边半径20码范围内的所有小队成员的攻击强度提高8%。效果持续10秒。', '你的近战爆击可以令身边半径20码范围内的所有小队成员的攻击强度提高10%。效果持续10秒。']
					},
					33: {
						name: '萨满之怒',
						icon: 'Spell_Nature_ShamanRage',
						rank: ['<i class="Fl">瞬发</i><i class="Fr">2分钟冷却时间</i><br>\
						使你受到的所有伤害降低30%，成功的近战攻击有一定几率为你恢复法力值，数值相当于你的攻击强度的30%。持续15秒。']
					}
				}
			},
			{
				text: '恢复',
				icon: 'Spell_Nature_MagicImmunity',
				texture: 'Restoration_Shaman',
				talent: {
					1: {
						name: '强化治疗波',
						icon: 'Spell_Nature_MagicImmunity',
						rank: ['使你的治疗波的施法时间减少0.1秒。', '使你的治疗波的施法时间减少0.2秒。', '使你的治疗波的施法时间减少0.3秒。', '使你的治疗波的施法时间减少0.4秒。', '使你的治疗波的施法时间减少0.5秒。']
					},
					2: {
						name: '潮汐集中',
						icon: 'Spell_Frost_ManaRecharge',
						rank: ['使你的治疗法术所消耗的法力值减少1%。', '使你的治疗法术所消耗的法力值减少2%。', '使你的治疗法术所消耗的法力值减少3%。', '使你的治疗法术所消耗的法力值减少4%。', '使你的治疗法术所消耗的法力值减少5%。']
					},
					4: {
						name: '强化复生',
						icon: 'Spell_Nature_Reincarnation',
						rank: ['使你的复生法术的冷却时间减少10分钟，并使你在重生后所获得的生命值和法力值提高10%。', '使你的复生法术的冷却时间减少20分钟，并使你在重生后所获得的生命值和法力值提高20%。']
					},
					5: {
						name: '先祖治疗',
						icon: 'Spell_Nature_UndyingStrength',
						rank: ['在你的任何一个治疗法术对目标造成爆击效果后，使目标因装备而获得的护甲值提高8%，持续15秒。', '在你的任何一个治疗法术对目标造成爆击效果后，使目标因装备而获得的护甲值提高16%，持续15秒。', '在你的任何一个治疗法术对目标造成爆击效果后，使目标因装备而获得的护甲值提高25%，持续15秒。']
					},
					6: {
						name: '图腾集中',
						icon: 'Spell_Nature_MoonGlow',
						rank: ['使你施放图腾所消耗的法力值减少5%。', '使你施放图腾所消耗的法力值减少10%。', '使你施放图腾所消耗的法力值减少15%。', '使你施放图腾所消耗的法力值减少20%。', '使你施放图腾所消耗的法力值减少25%。']
					},
					8: {
						name: '自然指引',
						icon: 'Spell_Frost_Stun',
						rank: ['使你的法术和近战攻击的命中几率提高1%。', '使你的法术和近战攻击的命中几率提高2%。', '使你的法术和近战攻击的命中几率提高3%。']
					},
					9: {
						name: '治疗专注',
						icon: 'Spell_Nature_HealingWaveLesser',
						rank: ['使你在施放任意萨满祭司治疗法术的时候有14%的几率避免因受到伤害而被打断。', '使你在施放任意萨满祭司治疗法术的时候有28%的几率避免因受到伤害而被打断。', '使你在施放任意萨满祭司治疗法术的时候有42%的几率避免因受到伤害而被打断。', '使你在施放任意萨满祭司治疗法术的时候有56%的几率避免因受到伤害而被打断。', '使你在施放任意萨满祭司治疗法术的时候有70%的几率避免因受到伤害而被打断。']
					},
					10: {
						name: '图腾掌握',
						icon: 'Spell_Nature_NullWard',
						rank: ['你的图腾影响友方单位的半径增加到30码。']
					},
					11: {
						name: '治疗之赐',
						icon: 'Spell_Nature_HealingTouch',
						rank: ['使你的所有治疗法术所造成的威胁值降低5%，并且降低法术被驱散的几率10%。', '使你的所有治疗法术所造成的威胁值降低10%，并且降低法术被驱散的几率20%。', '使你的所有治疗法术所造成的威胁值降低15%，并且降低法术被驱散的几率30%。']
					},
					13: {
						name: '恢复图腾',
						icon: 'Spell_Nature_ManaRegenTotem',
						rank: ['使你的法力之泉图腾和治疗之泉图腾的效果提高5%。', '使你的法力之泉图腾和治疗之泉图腾的效果提高10%。', '使你的法力之泉图腾和治疗之泉图腾的效果提高15%。', '使你的法力之泉图腾和治疗之泉图腾的效果提高20%。', '使你的法力之泉图腾和治疗之泉图腾的效果提高25%。']
					},
					14: {
						name: '潮汐掌握',
						icon: 'Spell_Nature_Tranquility',
						rank: ['使你的治疗法术和闪电法术的爆击几率提高1%。', '使你的治疗法术和闪电法术的爆击几率提高2%。', '使你的治疗法术和闪电法术的爆击几率提高3%。', '使你的治疗法术和闪电法术的爆击几率提高4%。', '使你的治疗法术和闪电法术的爆击几率提高5%。']
					},
					16: {
						name: '治疗之道',
						icon: 'Spell_Nature_HealingWay',
						rank: ['你的治疗波有33%的几率令你的目标由以后的治疗波获得额外的治疗效果。这个效果使目标所受到的治疗效果提高6%，持续15秒，可叠加3次。', '你的治疗波有66%的几率令你的目标由以后的治疗波获得额外的治疗效果。这个效果使目标所受到的治疗效果提高6%，持续15秒，可叠加3次。', '你的治疗波有100%的几率令你的目标由以后的治疗波获得额外的治疗效果。这个效果使目标所受到的治疗效果提高6%，持续15秒，可叠加3次。']
					},
					18: {
						name: '自然迅捷',
						icon: 'Spell_Nature_RavenForm',
						rank: ['<i class="Fl">瞬发</i><i class="Fr">3分钟冷却时间</i><br>\
						激活之后，你的下一个施法时间低于10秒的自然法术会成为瞬发法术。']
					},
					19: {
						name: '心灵专注',
						icon: 'Spell_Nature_FocusedMind',
						rank: ['使所有沉默和打断效果对萨满祭司的持续时间缩短5%。这个效果不与其它任何同类效果叠加。', '使所有沉默和打断效果对萨满祭司的持续时间缩短10%。这个效果不与其它任何同类效果叠加。', '使所有沉默和打断效果对萨满祭司的持续时间缩短15%。这个效果不与其它任何同类效果叠加。']
					},
					22: {
						name: '净化',
						icon: 'Spell_Frost_WizardMark',
						rank: ['使你的治疗法术的效果提高2%。', '使你的治疗法术的效果提高4%。', '使你的治疗法术的效果提高6%。', '使你的治疗法术的效果提高8%。', '使你的治疗法术的效果提高10%。']
					},
					25: {
						name: '法力之潮图腾',
						icon: 'Spell_Frost_SummonWaterElemental',
						rely: 13,
						rank: ['<i class="Fl">3% 基础法力值</i><br><i class="Fl">瞬发法术</i><i class="Fr">5分钟冷却时间</i><br><i class="Fl">工具: 水图腾</i><br>在施法者身边召唤一个生命值为5点的法力之潮图腾，持续12。它可以为半径20码范围内的小队成员每3秒回复6%的法力值。']
					},
					26: {
						name: '自然的守护者',
						icon: 'Spell_Nature_NatureGuardian',
						rank: [
							'当一次伤害性的攻击使你的生命值降低到30%以下时，你有10%的几率恢复生命总值的10%，并降低你对该目标的威胁值。5秒钟冷却时间。',
							'当一次伤害性的攻击使你的生命值降低到30%以下时，你有20%的几率恢复生命总值的10%，并降低你对该目标的威胁值。5秒钟冷却时间。',
							'当一次伤害性的攻击使你的生命值降低到30%以下时，你有30%的几率恢复生命总值的10%，并降低你对该目标的威胁值。5秒钟冷却时间。',
							'当一次伤害性的攻击使你的生命值降低到30%以下时，你有40%的几率恢复生命总值的10%，并降低你对该目标的威胁值。5秒钟冷却时间。',
							'当一次伤害性的攻击使你的生命值降低到30%以下时，你有50%的几率恢复生命总值的10%，并降低你对该目标的威胁值。5秒钟冷却时间。'
						]
					},
					29: {
						name: '自然的祝福',
						icon: 'Spell_Nature_NatureBlessing',
						rank: ['使你的法术伤害和治疗效果提高，数值相当于你的智力值的10%。', '使你的法术伤害和治疗效果提高，数值相当于你的智力值的20%。', '使你的法术伤害和治疗效果提高，数值相当于你的智力值的30%。']
					},
					30: {
						name: '强化治疗链',
						icon: 'Spell_Nature_HealingWaveGreater',
						rank: ['使你的治疗链法术所恢复的生命值提高10%。', '使你的治疗链法术所恢复的生命值提高20%。']
					},
					33: {
						name: '大地之盾',
						icon: 'Spell_Nature_SkinofEarth',
						rely: 29,
						rank: ['<i class="Fl">300 法力值</i><i class="Fr">40码距离</i><br><i class="Fl">瞬发法术</i><br>\
						一层大地之盾保护目标，使其有30%的几率忽略打断施法的效果，被大地之盾保护的目标在受到攻击时可以恢复150点生命值。该效果每数秒只能出现一次，共可生效6次。大地之盾持续10分钟，同一时间内只能给一个目标施放大地之盾，且同一时间内只能有一种元素护盾在同一目标身上生效。']
					}
				}
			}
		],
		warlock: [
			{
				text: '痛苦',
				icon: 'Spell_Shadow_DeathCoil',
				texture: 'Affliction',
				talent: {
					1: {
						name: '镇压',
						icon: 'Spell_Shadow_UnsummonBuilding',
						rank: ['使敌人抵抗你的痛苦系法术的几率降低2%。', '使敌人抵抗你的痛苦系法术的几率降低4%。', '使敌人抵抗你的痛苦系法术的几率降低6%。', '使敌人抵抗你的痛苦系法术的几率降低8%。', '使敌人抵抗你的痛苦系法术的几率降低10%。']
					},
					2: {
						name: '强化腐蚀术',
						icon: 'spell_shadow_abominationexplosion',
						rank: ['使你的腐蚀术的施法时间减少0.4秒。', '使你的腐蚀术的施法时间减少0.8秒。', '使你的腐蚀术的施法时间减少1.2秒。', '使你的腐蚀术的施法时间减少1.6秒。', '使你的腐蚀术的施法时间减少2秒。']
					},
					4: {
						name: '强化虚弱诅咒',
						icon: 'spell_shadow_curseofmannoroth',
						rank: ['使你的虚弱诅咒的效果提高10%。', '使你的虚弱诅咒的效果提高20%。']
					},
					5: {
						name: '强化吸取灵魂',
						icon: 'Spell_Shadow_Haunting',
						rank: ['在目标死于你的吸取灵魂过程中时，你将获得你的法力值上限的7%。另外，你的痛苦系法术所产生的威胁值降低5%。', '在目标死于你的吸取灵魂过程中时，你将获得你的法力值上限的15%。另外，你的痛苦系法术所产生的威胁值降低10%。']
					},
					6: {
						name: '强化生命分流',
						icon: 'Spell_Shadow_BurningSpirit',
						rank: ['使你的生命分流法术所转化的法力值提高10%。', '使你的生命分流法术所转化的法力值提高20%。']
					},
					7: {
						name: '灵魂虹吸',
						icon: 'Spell_Shadow_LifeDrain02',
						rank: ['目标身上每多一层痛苦系法术效果，你的吸取生命所吸取的生命值就提高2%，最多可以获得24%的效果加成。', '目标身上每多一层痛苦系法术效果，你的吸取生命所吸取的生命值就提高4%，最多可以获得60%的效果加成。']
					},
					8: {
						name: '强化痛苦诅咒',
						icon: 'Spell_Shadow_CurseOfSargeras',
						rank: ['使你的痛苦诅咒的伤害提高5%。', '使你的痛苦诅咒的伤害提高10%。']
					},
					9: {
						name: '恶魔专注',
						icon: 'Spell_Shadow_FingerOfDeath',
						rank: ['使你有14%的几率在施放吸取生命、吸取法力或吸取灵魂法术时不会因受到伤害而被打断。', '使你有28%的几率在施放吸取生命、吸取法力或吸取灵魂法术时不会因受到伤害而被打断。', '使你有42%的几率在施放吸取生命、吸取法力或吸取灵魂法术时不会因受到伤害而被打断。', '使你有56%的几率在施放吸取生命、吸取法力或吸取灵魂法术时不会因受到伤害而被打断。', '使你有70%的几率在施放吸取生命、吸取法力或吸取灵魂法术时不会因受到伤害而被打断。']
					},
					10: {
						name: '诅咒增幅',
						icon: 'Spell_Shadow_Contagion',
						rank: ['<i class="Fl">瞬发</i><i class="Fr">3分钟冷却时间</i><br>\
						使你的下一个虚弱诅咒或痛苦诅咒的效果提高50%，或使你的下一个疲劳诅咒的效果提高20%。持续30秒。']
					},
					12: {
						name: '无情延伸',
						icon: 'Spell_Shadow_CallofBone',
						rank: ['使你的痛苦系法术的射程延长10%.', '使你的痛苦系法术的射程延长20%.']
					},
					13: {
						name: '夜幕',
						icon: 'Spell_Shadow_Twilight',
						rank: ['使你的腐蚀术和吸取生命法术有2%的几率在对敌人造成伤害之后令你进入暗影冥思状态。暗影冥思状可以令你的下一个暗影箭法术的施法时间减少100%。', '使你的腐蚀术和吸取生命法术有4%的几率在对敌人造成伤害之后令你进入暗影冥思状态。暗影冥思状可以令你的下一个暗影箭法术的施法时间减少100%。']
					},
					15: {
						name: '腐蚀增效',
						icon: 'Spell_Shadow_AbominationExplosion',
						rank: ['提高法术伤害的效果对你的腐蚀术有12%的额外加成。', '提高法术伤害的效果对你的腐蚀术有24%的额外加成。', '提高法术伤害的效果对你的腐蚀术有36%的额外加成。']
					},
					16: {
						name: '暗影之拥',
						icon: 'Spell_Shadow_ShadowEmbrace',
						rank: ['你的腐蚀术、痛苦诅咒、生命虹吸和腐蚀之种也会造成暗影之拥效果，令目标所造成的近战伤害降低1%。', '你的腐蚀术、痛苦诅咒、生命虹吸和腐蚀之种也会造成暗影之拥效果，令目标所造成的近战伤害降低2%。', '你的腐蚀术、痛苦诅咒、生命虹吸和腐蚀之种也会造成暗影之拥效果，令目标所造成的近战伤害降低3%。', '你的腐蚀术、痛苦诅咒、生命虹吸和腐蚀之种也会造成暗影之拥效果，令目标所造成的近战伤害降低4%。', '你的腐蚀术、痛苦诅咒、生命虹吸和腐蚀之种也会造成暗影之拥效果，令目标所造成的近战伤害降低5%。']
					},
					17: {
						name: '生命虹吸',
						icon: 'Spell_Shadow_Requiem',
						rank: ['<i class="Fl">140 法力值</i><i class="Fr">30码有效距离</i><br><i class="Fl">瞬发法术</i><br>\
						每3秒将目标的15点生命值转移给施法者，持续30秒']
					},
					18: {
						name: '疲劳诅咒',
						icon: 'Spell_Shadow_GrimWard',
						rely: 10,
						rank: ['<i class="Fl">6% 基础法力值</i><i class="Fr">30码有效距离</i><br><i class="Fl">瞬发法术</i><br>\
						使目标的速度降低30%，持续12秒。每个术士只能对一个目标施加一种诅咒，且同类诅咒不能叠加。']
					},
					21: {
						name: '暗影掌握',
						icon: 'Spell_Shadow_ShadeTrueSight',
						rely: 17,
						rank: ['使你的暗影法术的伤害或吸取的生命值提高2%。', '使你的暗影法术的伤害或吸取的生命值提高4%。', '使你的暗影法术的伤害或吸取的生命值提高6%。', '使你的暗影法术的伤害或吸取的生命值提高8%。', '使你的暗影法术的伤害或吸取的生命值提高10%。']
					},
					25: {
						name: '传染',
						icon: 'Spell_Shadow_PainfulAfflictions',
						rank: ['使你的痛苦诅咒、腐蚀术和腐蚀之种的伤害提1%，你的痛苦系法术被驱散的几率降低6%。', '使你的痛苦诅咒、腐蚀术和腐蚀之种的伤害提2%，你的痛苦系法术被驱散的几率降低12%。', '使你的痛苦诅咒、腐蚀术和腐蚀之种的伤害提3%，你的痛苦系法术被驱散的几率降低18%。', '使你的痛苦诅咒、腐蚀术和腐蚀之种的伤害提4%，你的痛苦系法术被驱散的几率降低24%。', '使你的痛苦诅咒、腐蚀术和腐蚀之种的伤害提5%，你的痛苦系法术被驱散的几率降低30%。']
					},
					26: {
						name: '黑暗契约',
						icon: 'Spell_Shadow_DarkRitual',
						rank: ['<i class="Fl">30码有效距离</i><br><i class="Fl">瞬发</i><br>\
						从你的宠物身上抽取305点法力值并全部转化给你。']
					},
					28: {
						name: '强化恐惧嚎叫',
						icon: 'Spell_Shadow_DeathScream',
						rank: ['使你的恐惧嚎叫法术的施法时间减少0.8秒。', '使你的恐惧嚎叫法术的施法时间减少1.5秒。']
					},
					30: {
						name: '邪咒',
						icon: 'Spell_Shadow_CurseOfAchimonde',
						rank: ['使你的暗影诅咒和元素诅咒的伤害加成效果提高1%。', '使你的暗影诅咒和元素诅咒的伤害加成效果提高2%。', '使你的暗影诅咒和元素诅咒的伤害加成效果提高3%。']
					},
					33: {
						name: '痛苦无常',
						icon: 'Spell_Shadow_UnstableAffliction_3',
						rely: 25,
						rank: ['<i class="Fl">270 法力值</i><i class="Fr">30码有效距离</i><br><i class="Fl">1.5秒施法时间</i><br>\
						暗影能量逐渐吞噬目标，在18秒内对其造成总计660点伤害。如果这个效果被驱散，则它对驱散者造成990点伤害，并令其沉默5秒。']
					}
				}
			},
			{
				text: '恶魔学识',
				icon: 'Spell_Shadow_Metamorphosis',
				texture: 'Demonology',
				talent: {
					0: {
						name: '强化治疗石',
						icon: 'INV_Stone_04',
						rank: ['使你的治疗石所恢复的生命值增加10%。', '使你的治疗石所恢复的生命值增加20%。']
					},
					1: {
						name: '强化小鬼',
						icon: 'Spell_Shadow_SummonImp',
						rank: ['使小鬼的火焰箭、火焰之盾和血之契印的效果提高10%。', '使小鬼的火焰箭、火焰之盾和血之契印的效果提高20%。', '使小鬼的火焰箭、火焰之盾和血之契印的效果提高30%。']
					},
					2: {
						name: '恶魔之拥',
						icon: 'Spell_Shadow_Metamorphosis',
						rank: ['使你的耐力总值提高3%，同时使你的精神总值降低1%。', '使你的耐力总值提高6%，同时使你的精神总值降低2%。', '使你的耐力总值提高9%，同时使你的精神总值降低3%。', '使你的耐力总值提高12%，同时使你的精神总值降低4%。', '使你的耐力总值提高15%，同时使你的精神总值降低5%。']
					},
					4: {
						name: '强化生命通道',
						icon: 'Spell_Shadow_LifeDrain',
						rank: ['使你的生命通道法术所转化的生命值提高10%，初始生命值消耗减少10%。', '使你的生命通道法术所转化的生命值提高20%，初始生命值消耗减少20%。']
					},
					5: {
						name: '强化虚空行者',
						icon: 'Spell_Shadow_SummonVoidWalker',
						rank: ['使你的虚空行者的折磨、吞噬暗影、牺牲和受难法术的效果提高10%。', '使你的虚空行者的折磨、吞噬暗影、牺牲和受难法术的效果提高20%。', '使你的虚空行者的折磨、吞噬暗影、牺牲和受难法术的效果提高30%。']
					},
					6: {
						name: '恶魔智力',
						icon: 'Spell_Holy_MagicalSentry',
						rank: ['使你的小鬼、虚空行者、魅魔、地狱猎犬和恶魔卫士的智力提高5%，你的法力值上限提高1%。', '使你的小鬼、虚空行者、魅魔、地狱猎犬和恶魔卫士的智力提高10%，你的法力值上限提高2%。', '使你的小鬼、虚空行者、魅魔、地狱猎犬和恶魔卫士的智力提高15%，你的法力值上限提高3%。']
					},
					8: {
						name: '强化魅魔',
						icon: 'Spell_Shadow_SummonSuccubus',
						rank: ['使你的魅魔的剧痛鞭笞和安抚之吻法术的效果提高10%，并使你的魅魔的诱惑和次级隐形术的持续时间延长10%。', '使你的魅魔的剧痛鞭笞和安抚之吻法术的效果提高20%，并使你的魅魔的诱惑和次级隐形术的持续时间延长20%。', '使你的魅魔的剧痛鞭笞和安抚之吻法术的效果提高30%，并使你的魅魔的诱惑和次级隐形术的持续时间延长30%。']
					},
					9: {
						name: '恶魔支配',
						icon: 'Spell_Nature_RemoveCurse',
						rank: ['<i class="Fl">瞬发</i><i class="Fr">15分钟冷却时间</i><br>\
						你的下一个召唤小鬼、虚空行者、魅魔、地狱猎犬或恶魔卫士的法术施法时间减少5.5秒，法力消耗减少50%。']
					},
					10: {
						name: '恶魔耐力',
						icon: 'Spell_Shadow_AntiShadow',
						rank: ['使你的小鬼、虚空行者、魅魔、地狱猎犬和恶魔卫士的生命值上限提高5%，你的生命值上限提高1%。', '使你的小鬼、虚空行者、魅魔、地狱猎犬和恶魔卫士的生命值上限提高10%，你的生命值上限提高2%。', '使你的小鬼、虚空行者、魅魔、地狱猎犬和恶魔卫士的生命值上限提高15%，你的生命值上限提高3%。']
					},
					11: {
						name: '恶魔庇护',
						icon: 'Spell_Shadow_RagingScream',
						rank: ['使你的魔甲术和邪甲术的效果提高10%。', '使你的魔甲术和邪甲术的效果提高20%。', '使你的魔甲术和邪甲术的效果提高30%。']
					},
					13: {
						name: '召唤大师',
						icon: 'Spell_Shadow_ImpPhaseShift',
						rely: 9,
						rank: ['使你召唤小鬼、虚空行者、魅魔、地狱猎犬和恶魔卫士的施法时间减少2秒，法力值消耗降低20%。', '使你召唤小鬼、虚空行者、魅魔、地狱猎犬和恶魔卫士的施法时间减少4秒，法力值消耗降低40%。']
					},
					14: {
						name: '邪恶强化',
						icon: 'Spell_Shadow_ShadowWordDominate',
						rank: ['使你的虚空行者、魅魔、地狱猎犬和恶魔卫士的近战伤害及小鬼的火焰箭伤害提高4%。', '使你的虚空行者、魅魔、地狱猎犬和恶魔卫士的近战伤害及小鬼的火焰箭伤害提高8%。', '使你的虚空行者、魅魔、地狱猎犬和恶魔卫士的近战伤害及小鬼的火焰箭伤害提高12%。', '使你的虚空行者、魅魔、地狱猎犬和恶魔卫士的近战伤害及小鬼的火焰箭伤害提高16%。', '使你的虚空行者、魅魔、地狱猎犬和恶魔卫士的近战伤害及小鬼的火焰箭伤害提高20%。']
					},
					16: {
						name: '强化奴役恶魔',
						icon: 'Spell_Shadow_EnslaveDemon',
						rank: ['使你的奴役恶魔法术的攻击速度和施法速度惩罚减轻5%，恶魔抵抗奴役效果的几率降低5%。', '使你的奴役恶魔法术的攻击速度和施法速度惩罚减轻10%，恶魔抵抗奴役效果的几率降低10%。']
					},
					17: {
						name: '恶魔牺牲',
						icon: 'Spell_Shadow_PsychicScream',
						rank: ['<i class="Fl">100码有效距离</i><br><i class="Fl">瞬发</i><br>\
						激活之后，牺牲你当前所召唤的恶魔，使你获得一种特殊效果，持续30分钟。如果在此期间你召唤任意一个恶魔，该效果就会被取消。<br>小鬼：使你的火焰技能伤害提高15%。<br>虚空行者：使你每4秒回复2%的生命值。<br>魅魔：使你的暗影技能伤害提高15%。<br>地狱犬：使你每4秒回复3%的法力值。<br>恶魔卫士：使你的暗影伤害提高10%，每4秒恢复法力总值的2%。']
					},
					19: {
						name: '魔石大师',
						icon: 'INV_Ammo_FireTar',
						rank: ['使你的火焰石的效果和伤害加成提高15%，法术石的法术爆击等级加成提高15%。', '使你的火焰石的效果和伤害加成提高30%，法术石的法术爆击等级加成提高30%。']
					},
					20: {
						name: '法力喂食',
						icon: 'Spell_Shadow_ManaFeed',
						rank: ['当你因法力吸取或生命分流而获得法力值时，你的宠物也可以获得法力值，数值相当于你所获法力值的33%。', '当你因法力吸取或生命分流而获得法力值时，你的宠物也可以获得法力值，数值相当于你所获法力值的66%。', '当你因法力吸取或生命分流而获得法力值时，你的宠物也可以获得法力值，数值相当于你所获法力值的100%。']
					},
					22: {
						name: '恶魔学识大师',
						icon: 'Spell_Shadow_ShadowPact',
						rely: 14,
						rank: [
							'使术士和他（她）所召唤的恶魔均获得一个特殊效果，只要该恶魔处于激活状态就不会消失。<br>小鬼 - 对敌人造成的威胁降低4%。<br>虚空行者 - 受到物理攻击时承受的伤害降低2%。<br>魅魔 - 对敌人造成的所有伤害提高2%。<br>地狱猎犬 - 每等级所有抗性提高0.2。<br>恶魔卫士 - 所有伤害提高1%，所有抗性提高每等级0.1。',
							'使术士和他（她）所召唤的恶魔均获得一个特殊效果，只要该恶魔处于激活状态就不会消失。<br>小鬼 - 对敌人造成的威胁降低8%。<br>虚空行者 - 受到物理攻击时承受的伤害降低4%。<br>魅魔 - 对敌人造成的所有伤害提高4%。<br>地狱猎犬 - 每等级所有抗性提高0.4。<br>恶魔卫士 - 所有伤害提高2%，所有抗性提高每等级0.2。',
							'使术士和他（她）所召唤的恶魔均获得一个特殊效果，只要该恶魔处于激活状态就不会消失。<br>小鬼 - 对敌人造成的威胁降低12%。<br>虚空行者 - 受到物理攻击时承受的伤害降低6%。<br>魅魔 - 对敌人造成的所有伤害提高6%。<br>地狱猎犬 - 每等级所有抗性提高0.6。<br>恶魔卫士 - 所有伤害提高3%，所有抗性提高每等级0.3。',
							'使术士和他（她）所召唤的恶魔均获得一个特殊效果，只要该恶魔处于激活状态就不会消失。<br>小鬼 - 对敌人造成的威胁降低16%。<br>虚空行者 - 受到物理攻击时承受的伤害降低8%。<br>魅魔 - 对敌人造成的所有伤害提高8%。<br>地狱猎犬 - 每等级所有抗性提高0.8。<br>恶魔卫士 - 所有伤害提高4%，所有抗性提高每等级0.4。',
							'使术士和他（她）所召唤的恶魔均获得一个特殊效果，只要该恶魔处于激活状态就不会消失。<br>小鬼 - 对敌人造成的威胁降低20%。<br>虚空行者 - 受到物理攻击时承受的伤害降低10%。<br>魅魔 - 对敌人造成的所有伤害提高10%。<br>地狱猎犬 - 每等级所有抗性提高1。<br>恶魔卫士 - 所有伤害提高5%，所有抗性提高每等级0.5。'
						]
					},
					24: {
						name: '恶魔韧性',
						icon: 'Spell_Shadow_DemonicFortitude',
						rank: ['使你受到近战和法术爆击的几率降低1%，你所召唤的恶魔受到的所有伤害降低5%。', '使你受到近战和法术爆击的几率降低2%，你所召唤的恶魔受到的所有伤害降低10%。', '使你受到近战和法术爆击的几率降低3%，你所召唤的恶魔受到的所有伤害降低15%。']
					},
					25: {
						name: '灵魂链接',
						icon: 'Spell_Shadow_GatherShadows',
						rely: 17,
						rank: ['<i class="Fl">16% 基础法力值</i><i class="Fr">100码有效距离</i><br><i class="Fl">瞬发法术</i><br>\
						激活之后，施法者所承受的伤害有20%被他（她）的小鬼、虚空行者、魅魔、地狱猎犬、恶魔卫士或者奴役的恶魔分担。该伤害无法避免。另外，恶魔和其主人的任何攻击所造成的伤害都提高5%。只要恶魔保持激活状态，该效果就一直持续。']
					},
					26: {
						name: '恶魔知识',
						icon: 'Spell_Shadow_ImprovedVampiricEmbrace',
						rank: ['使你的法术伤害提高，数值相当于你所激活的恶魔宠物的耐力值与智力值总合的4%。', '使你的法术伤害提高，数值相当于你所激活的恶魔宠物的耐力值与智力值总合的8%。', '使你的法术伤害提高，数值相当于你所激活的恶魔宠物的耐力值与智力值总合的12%。']
					},
					29: {
						name: '恶魔战术',
						icon: 'Spell_Shadow_DemonicTactics',
						rank: ['使你和你所召唤的恶魔宠物的近战和法术爆击几率提高1%。', '使你和你所召唤的恶魔宠物的近战和法术爆击几率提高2%。', '使你和你所召唤的恶魔宠物的近战和法术爆击几率提高3%。', '使你和你所召唤的恶魔宠物的近战和法术爆击几率提高4%。', '使你和你所召唤的恶魔宠物的近战和法术爆击几率提高5%。']
					},
					33: {
						name: '召唤恶魔卫士',
						icon: 'Spell_Shadow_SummonFelGuard',
						rank: ['<i class="Fl">80% 基础法力值</i><br><i class="Fl">10秒施法时间</i><br><i class="Fl">需要：灵魂碎片</i><br>召唤一个恶魔卫士协助术士作战。']
					}
				}
			},
			{
				text: '毁灭',
				icon: 'Spell_Shadow_RainOfFire',
				texture: 'Destruction',
				talent: {
					1: {
						name: '强化暗影箭',
						icon: 'Spell_Shadow_ShadowBolt',
						rank: [
							'在你的暗影箭对目标造成爆击之后，你对其造成的接连4次非持续性暗影伤害都将提高4%。效果持续最多12秒。',
							'在你的暗影箭对目标造成爆击之后，你对其造成的接连4次非持续性暗影伤害都将提高8%。效果持续最多12秒。',
							'在你的暗影箭对目标造成爆击之后，你对其造成的接连4次非持续性暗影伤害都将提高12%。效果持续最多12秒。',
							'在你的暗影箭对目标造成爆击之后，你对其造成的接连4次非持续性暗影伤害都将提高16%。效果持续最多12秒。',
							'在你的暗影箭对目标造成爆击之后，你对其造成的接连4次非持续性暗影伤害都将提高20%。效果持续最多12秒。'
						]
					},
					2: {
						name: '灾变',
						icon: 'Spell_Fire_WindsofWoe',
						rank: ['使你的毁灭系法术所消耗的法力值减少1%。', '使你的毁灭系法术所消耗的法力值减少2%。', '使你的毁灭系法术所消耗的法力值减少3%。', '使你的毁灭系法术所消耗的法力值减少4%。', '使你的毁灭系法术所消耗的法力值减少5%。']
					},
					5: {
						name: '灾祸',
						icon: 'Spell_Shadow_DeathPact',
						rank: ['使你的暗影箭和献祭的施法时间减少0.1秒，灵魂之火的施法时间减少0.4秒。', '使你的暗影箭和献祭的施法时间减少0.2秒，灵魂之火的施法时间减少0.8秒。', '使你的暗影箭和献祭的施法时间减少0.3秒，灵魂之火的施法时间减少1.2秒。', '使你的暗影箭和献祭的施法时间减少0.4秒，灵魂之火的施法时间减少1.6秒。', '使你的暗影箭和献祭的施法时间减少0.5秒，灵魂之火的施法时间减少2.0秒。']
					},
					6: {
						name: '清算',
						icon: 'Spell_Fire_Fire',
						rank: ['使你的毁灭系法术有2%的几率令目标眩晕5秒。', '使你的毁灭系法术有4%的几率令目标眩晕5秒。', '使你的毁灭系法术有6%的几率令目标眩晕5秒。', '使你的毁灭系法术有8%的几率令目标眩晕5秒。', '使你的毁灭系法术有10%的几率令目标眩晕5秒。']
					},
					8: {
						name: '强化火焰箭',
						icon: 'Spell_Fire_FireBolt',
						rank: ['使小鬼的火焰箭的施法时间减少0.25秒。', '使小鬼的火焰箭的施法时间减少0.5秒。']
					},
					9: {
						name: '强化剧痛鞭笞',
						icon: 'Spell_Shadow_Curse',
						rank: ['使魅魔的剧痛鞭笞的冷却时间减少3秒。', '使魅魔的剧痛鞭笞的冷却时间减少6秒。']
					},
					10: {
						name: '毁坏',
						icon: 'Spell_Fire_FlameShock',
						rank: ['使你的毁灭系法术的爆击几率提高1%。', '使你的毁灭系法术的爆击几率提高2%。', '使你的毁灭系法术的爆击几率提高3%。', '使你的毁灭系法术的爆击几率提高4%。', '使你的毁灭系法术的爆击几率提高5%。']
					},
					11: {
						name: '暗影灼烧',
						icon: 'Spell_Shadow_ScourgeBuild',
						rank: ['<i class="Fl">105 法力值</i><i class="Fr">20码有效距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">15秒冷却时间</i><br><i class="Fl">需要：灵魂碎片</i><br>立即使用暗影能量冲击目标，对其造成91到104点暗影伤害。如果目标在5秒内死于暗影灼烧，且施法者因此获得经验值或荣誉，则施法者获得一块灵魂碎片。']
					},
					12: {
						name: '强烈',
						icon: 'Spell_Fire_LavaSpawn',
						rank: ['使你有35%的几率在施放或引导任何毁灭系法术时不会因受到伤害而被打断。', '使你有70%的几率在施放或引导任何毁灭系法术时不会因受到伤害而被打断。']
					},
					13: {
						name: '毁灭延伸',
						icon: 'Spell_Shadow_CorpseExplode',
						rank: ['使你的毁灭系法术的射程增加10%，毁灭系法术所造成的威胁值降低5%。', '使你的毁灭系法术的射程增加20%，毁灭系法术所造成的威胁值降低10%。']
					},
					15: {
						name: '强化灼热之痛',
						icon: 'Spell_Fire_SoulBurn',
						rank: ['使你的灼热之痛的爆击几率提高4%。', '使你的灼热之痛的爆击几率提高7%。', '使你的灼热之痛的爆击几率提高10%。']
					},
					16: {
						name: '火焰冲撞',
						icon: 'Spell_Fire_Volcano',
						rely: 12,
						rank: ['使你的火焰之雨、地狱烈焰和灵魂之火有13%的几率使目标昏迷3秒。', '使你的火焰之雨、地狱烈焰和灵魂之火有26%的几率使目标昏迷3秒。']
					},
					17: {
						name: '强化献祭',
						icon: 'Spell_Fire_Immolation',
						rank: ['使你的献祭法术的初始伤害提高5%。', '使你的献祭法术的初始伤害提高10%。', '使你的献祭法术的初始伤害提高15%。', '使你的献祭法术的初始伤害提高20%。', '使你的献祭法术的初始伤害提高25%。']
					},
					18: {
						name: '毁灭',
						icon: 'Spell_Shadow_ShadowWordPain',
						rely: 10,
						rank: ['使你的毁灭系法术的爆击伤害加成提高100%。']
					},
					20: {
						name: '虚空防护',
						icon: 'Spell_Shadow_NetherProtection',
						rank: ['被暗影或火焰法术击中之后有10%的几率对暗影和火焰法术免疫，效果持续4秒。', '被暗影或火焰法术击中之后有20%的几率对暗影和火焰法术免疫，效果持续4秒。', '被暗影或火焰法术击中之后有30%的几率对暗影和火焰法术免疫，效果持续4秒。']
					},
					22: {
						name: '灰烬风暴',
						icon: 'Spell_Fire_SelfDestruct',
						rank: ['使你的火焰法术所造成的伤害提高2%，烧尽法术的施法时间减少2%。', '使你的火焰法术所造成的伤害提高4%，烧尽法术的施法时间减少4%。', '使你的火焰法术所造成的伤害提高6%，烧尽法术的施法时间减少7%。', '使你的火焰法术所造成的伤害提高8%，烧尽法术的施法时间减少8%。', '使你的火焰法术所造成的伤害提高10%，烧尽法术的施法时间减少10%。']
					},
					24: {
						name: '反冲',
						icon: 'Spell_Fire_PlayingWithFire',
						rank: ['使你的法术爆击几率提高1%，并使你有8%的几率在受到物理攻击之后的下一个暗影箭或燃尽法术的施法时间减少100%。这个效果可以持续8秒，且在8秒内只能出现一次。', '使你的法术爆击几率提高2%，并使你有16%的几率在受到物理攻击之后的下一个暗影箭或燃尽法术的施法时间减少100%。这个效果可以持续8秒，且在8秒内只能出现一次。', '使你的法术爆击几率提高3%，并使你有25%的几率在受到物理攻击之后的下一个暗影箭或燃尽法术的施法时间减少100%。这个效果可以持续8秒，且在8秒内只能出现一次。']
					},
					25: {
						name: '燃烧',
						icon: 'Spell_Fire_Fireball',
						rely: 17,
						rank: ['<i class="Fl">165 法力值</i><i class="Fr">30码有效距离</i><br><i class="Fl">瞬发法术</i><i class="Fr">10秒冷却时间</i><br>\
						点燃一个已经被施加献祭效果的目标，对其造成249到316点火焰伤害并吞噬掉献祭效果。']
					},
					26: {
						name: '灵魂榨取',
						icon: 'Spell_Shadow_SoulLeech_3',
						rank: ['使你的暗影箭、暗影灼烧、灵魂之火、灼热之痛、烧尽和燃烧有10%的几率为你回复生命值，数值相当于该法术所造成伤害的20%。', '使你的暗影箭、暗影灼烧、灵魂之火、灼热之痛、烧尽和燃烧有20%的几率为你回复生命值，数值相当于该法术所造成伤害的20%。', '使你的暗影箭、暗影灼烧、灵魂之火、灼热之痛、烧尽和燃烧有30%的几率为你回复生命值，数值相当于该法术所造成伤害的20%。']
					},
					29: {
						name: '暗影烈焰',
						icon: 'Spell_Shadow_ShadowandFlame',
						rank: ['你的暗影箭和烧尽所获得的法术伤害加成效果提高4%。', '你的暗影箭和烧尽所获得的法术伤害加成效果提高8%。', '你的暗影箭和烧尽所获得的法术伤害加成效果提高12%。', '你的暗影箭和烧尽所获得的法术伤害加成效果提高16%。', '你的暗影箭和烧尽所获得的法术伤害加成效果提高20%。']
					},
					33: {
						name: '暗影之怒',
						icon: 'Spell_Shadow_Shadowfury',
						rely: 29,
						rank: ['<i class="Fl">440 法力值</i><i class="Fr">30码有效距离</i><br><i class="Fl">0.5秒施法时间</i><i class="Fr">20秒冷却时间</i><br>\
						释放暗影之怒，对身边半径8码内的所有敌人造成357到422点暗影伤害，并使它们昏迷2秒。']
					}
				}
			}
		],
		warrior: [
			{
				text: '武器',
				icon: 'Ability_Warrior_SavageBlow',
				texture: 'Arms',
				talent: {
					0: {
						name: '强化英勇打击',
						icon: 'Ability_Rogue_Ambush',
						rank: ['使你的英勇打击技能所消耗的怒气值减少1点。', '使你的英勇打击技能所消耗的怒气值减少2点。', '使你的英勇打击技能所消耗的怒气值减少3点。']
					},
					1: {
						name: '偏斜',
						icon: 'Ability_Parry',
						rank: ['使你的招架几率提高1%。', '使你的招架几率提高2%。', '使你的招架几率提高3%。', '使你的招架几率提高4%。', '使你的招架几率提高5%。']
					},
					2: {
						name: '强化撕裂',
						icon: 'Ability_Gouge',
						rank: ['使你的撕裂技能的流血伤害效果每次生效时都提高25%。', '使你的撕裂技能的流血伤害效果每次生效时都提高50%。', '使你的撕裂技能的流血伤害效果每次生效时都提高75%。']
					},
					4: {
						name: '强化冲锋',
						icon: 'Ability_Warrior_Charge',
						rank: ['使你的冲锋技能积攒的怒气值提高3点。', '使你的冲锋技能积攒的怒气值提高6点。']
					},
					5: {
						name: '钢铁意志',
						icon: 'Spell_Magic_MageArmor',
						rank: ['使你抵抗眩晕和魅惑效果的几率提高3%。', '使你抵抗眩晕和魅惑效果的几率提高6%。', '使你抵抗眩晕和魅惑效果的几率提高9%。', '使你抵抗眩晕和魅惑效果的几率提高12%。', '使你抵抗眩晕和魅惑效果的几率提高15%。']
					},
					6: {
						name: '强化雷霆一击',
						icon: 'Ability_ThunderClap',
						rank: ['使你的雷霆一击技能所消耗的怒气值减少1点，伤害效果提高40%，另外使减速效果提高4%。', '使你的雷霆一击技能所消耗的怒气值减少2点，伤害效果提高70%，另外使减速效果提高7%。', '使你的雷霆一击技能所消耗的怒气值减少4点，伤害效果提高100%，另外使减速效果提高10%。']
					},
					8: {
						name: '强化压制',
						icon: 'INV_Sword_05',
						rank: ['使你的压制技能的爆击几率提高25%.', '使你的压制技能的爆击几率提高50%.']
					},
					9: {
						name: '愤怒掌握',
						icon: 'Spell_Holy_BlessingOfStamina',
						rank: ['每3秒获得1点怒气值。']
					},
					10: {
						name: '重伤',
						icon: 'Ability_BackStab',
						rank: ['你的爆击导致目标流血，使其在12秒内遭受相当于你的武器平均伤害值的20%的伤害。', '你的爆击导致目标流血，使其在12秒内遭受相当于你的武器平均伤害值的40%的伤害。', '你的爆击导致目标流血，使其在12秒内遭受相当于你的武器平均伤害值的60%的伤害。']
					},
					13: {
						name: '双手武器专精',
						icon: 'INV_Axe_09',
						rank: ['使你的双手近战武器伤害提高1%。', '使你的双手近战武器伤害提高2%。', '使你的双手近战武器伤害提高3%。', '使你的双手近战武器伤害提高4%。', '使你的双手近战武器伤害提高5%。']
					},
					14: {
						name: '穿刺',
						icon: 'Ability_SearingArrow',
						rely: 10,
						rank: ['使你在战斗姿态、防御姿态和狂暴姿态下的各种技能的爆击伤害加成提高10%。', '使你在战斗姿态、防御姿态和狂暴姿态下的各种技能的爆击伤害加成提高20%。']
					},
					16: {
						name: '长柄专精',
						icon: 'INV_Axe_06',
						rank: ['使你的斧类武器和长柄武器的爆击几率提高1%。', '使你的斧类武器和长柄武器的爆击几率提高2%。', '使你的斧类武器和长柄武器的爆击几率提高3%。', '使你的斧类武器和长柄武器的爆击几率提高4%。', '使你的斧类武器和长柄武器的爆击几率提高5%。']
					},
					17: {
						name: '死亡之愿',
						icon: 'Spell_Shadow_DeathPact',
						rank: ['<i class="Fl">10 怒气</i><br><i class="Fl">瞬发</i><i class="Fr">3分钟冷却时间</i><br>\
						激活之后，你的物理攻击伤害提高20%，并免疫恐惧效果，但是受到任何攻击时所承受的伤害都提高5%。持续30秒。']
					},
					18: {
						name: '锤类武器专精',
						icon: 'INV_Mace_01',
						rank: [
							'使你的锤类武器在击中目标时有一定几率将其击晕3秒，并使你获得7点怒气值。',
							'使你的锤类武器在击中目标时有一定几率将其击晕3秒，并使你获得7点怒气值。比锤类武器专精（等级 1）更有效。',
							'使你的锤类武器在击中目标时有一定几率将其击晕3秒，并使你获得7点怒气值。比锤类武器专精（等级 2）更有效。',
							'使你的锤类武器在击中目标时有一定几率将其击晕3秒，并使你获得7点怒气值。比锤类武器专精（等级 3）更有效。',
							'使你的锤类武器在击中目标时有一定几率将其击晕3秒，并使你获得7点怒气值。比锤类武器专精（等级 4）更有效。'
						]
					},
					19: {
						name: '剑类武器专精',
						icon: 'INV_Sword_27',
						rank: ['使你在用剑类武器击中敌人后有1%的几率进行一次额外的攻击。', '使你在用剑类武器击中敌人后有2%的几率进行一次额外的攻击。', '使你在用剑类武器击中敌人后有3%的几率进行一次额外的攻击。', '使你在用剑类武器击中敌人后有4%的几率进行一次额外的攻击。', '使你在用剑类武器击中敌人后有5%的几率进行一次额外的攻击。']
					},
					20: {
						name: '强化拦截',
						icon: 'Ability_Rogue_Sprint',
						rank: ['使你的拦截技能的冷却时间减少5秒。', '使你的拦截技能的冷却时间减少10秒。']
					},
					22: {
						name: '强化断筋',
						icon: 'Ability_ShockWave',
						rank: ['使你的断筋技能有5%的几率令目标无法移动，持续5秒。', '使你的断筋技能有10%的几率令目标无法移动，持续5秒。', '使你的断筋技能有15%的几率令目标无法移动，持续5秒。']
					},
					23: {
						name: '强化戒律',
						icon: 'Ability_Warrior_ImprovedDisciplines',
						rank: ['使你的反击风暴、鲁莽和盾墙技能的冷却时间减少4分钟，持续时间延长2秒。', '使你的反击风暴、鲁莽和盾墙技能的冷却时间减少7分钟，持续时间延长4秒。', '使你的反击风暴、鲁莽和盾墙技能的冷却时间减少10分钟，持续时间延长6秒。']
					},
					24: {
						name: '血性狂乱',
						icon: 'Ability_Warrior_BloodFrenzy',
						rank: ['你的撕裂和重伤技能也可以使目标受到的所有物理伤害提高2%。', '你的撕裂和重伤技能也可以使目标受到的所有物理伤害提高4%。']
					},
					25: {
						name: '致死打击',
						icon: 'Ability_Warrior_SavageBlow',
						rely: 17,
						rank: ['<i class="Fl">30 怒气</i><i class="Fr">5码有效距离</i><br><i class="Fl">瞬发</i><i class="Fr">6秒冷却时间</i><br><i class="Fl">需要近战武器</i><br>\
						一次邪恶的攻击，对目标造成武器伤害外加85点伤害，并使任何形式的治疗对其产生的效果降低50%，持续10秒。']
					},
					26: {
						name: '复苏之风',
						icon: 'Ability_Hunter_Harass',
						rank: ['当你受到昏迷或定身效果影响时，你将在10秒内获得10点怒气值和生命总值的5%。', '当你受到昏迷或定身效果影响时，你将在10秒内获得20点怒气值和生命总值的10%。']
					},
					29: {
						name: '强化致死打击',
						icon: 'Ability_Warrior_SavageBlow',
						rely: 25,
						rank: ['使你的致死打击技能的冷却时间减少0.2秒，伤害提高1%。', '使你的致死打击技能的冷却时间减少0.4秒，伤害提高2%。', '使你的致死打击技能的冷却时间减少0.6秒，伤害提高3%。', '使你的致死打击技能的冷却时间减少0.8秒，伤害提高4%。', '使你的致死打击技能的冷却时间减少1秒，伤害提高5%。']
					},
					33: {
						name: '无尽怒气',
						icon: 'Ability_Hunter_BeastWithin',
						rank: ['在对敌人造成伤害时产生的怒气值提高25%。']
					}
				}
			},
			{
				text: '狂怒',
				icon: 'Ability_Warrior_InnerRage',
				texture: 'Fury',
				talent: {
					1: {
						name: '震耳嗓音',
						icon: 'Spell_Nature_Purge',
						rank: ['使你的战斗怒吼、挫志怒吼和命令怒吼的作用范围和持续时间提高10%。', '使你的战斗怒吼、挫志怒吼和命令怒吼的作用范围和持续时间提高20%。', '使你的战斗怒吼、挫志怒吼和命令怒吼的作用范围和持续时间提高30%。', '使你的战斗怒吼、挫志怒吼和命令怒吼的作用范围和持续时间提高40%。', '使你的战斗怒吼、挫志怒吼和命令怒吼的作用范围和持续时间提高50%。']
					},
					2: {
						name: '残忍',
						icon: 'Ability_Rogue_Eviscerate',
						rank: ['使你的近战武器的爆击几率提高1%。', '使你的近战武器的爆击几率提高2%。', '使你的近战武器的爆击几率提高3%。', '使你的近战武器的爆击几率提高4%。', '使你的近战武器的爆击几率提高5%。']
					},
					5: {
						name: '强化挫志怒吼',
						icon: 'Ability_Warrior_WarCry',
						rank: ['使你的挫志怒吼技能降低敌人近战攻击强度的效果提高8%。', '使你的挫志怒吼技能降低敌人近战攻击强度的效果提高16%。', '使你的挫志怒吼技能降低敌人近战攻击强度的效果提高24%。', '使你的挫志怒吼技能降低敌人近战攻击强度的效果提高32%。', '使你的挫志怒吼技能降低敌人近战攻击强度的效果提高40%。']
					},
					6: {
						name: '怒不可遏',
						icon: 'Spell_Nature_StoneClawTotem',
						rank: ['使你有一定几率在对敌人造成近战伤害之后获得1个额外的怒气点数。', '使你有一定几率在对敌人造成近战伤害之后获得1个额外的怒气点数。触发几率比怒不可遏（等级 1）更高。', '使你有一定几率在对敌人造成近战伤害之后获得1个额外的怒气点数。触发几率比怒不可遏（等级 2）更高。', '使你有一定几率在对敌人造成近战伤害之后获得1个额外的怒气点数。触发几率比怒不可遏（等级 3）更高。', '使你有一定几率在对敌人造成近战伤害之后获得1个额外的怒气点数。触发几率比怒不可遏（等级 4）更高。']
					},
					8: {
						name: '强化顺劈斩',
						icon: 'Ability_Warrior_Cleave',
						rank: ['使你的顺劈斩技能附加的伤害提高40%。', '使你的顺劈斩技能附加的伤害提高80%。', '使你的顺劈斩技能附加的伤害提高120%。']
					},
					9: {
						name: '刺耳怒吼',
						icon: 'Spell_Shadow_DeathScream',
						rank: ['<i class="Fl">10 怒气</i><br><i class="Fl">瞬发</i><br>\
						使战士身边的所有敌人眩晕，移动速度降低50%，持续6秒。']
					},
					10: {
						name: '血之狂热',
						icon: 'Spell_Shadow_SummonImp',
						rank: ['在受到爆击之后的6秒内为你回复生命值总量的1%。', '在受到爆击之后的6秒内为你回复生命值总量的2%。', '在受到爆击之后的6秒内为你回复生命值总量的3%。']
					},
					11: {
						name: '统御之力',
						icon: 'Spell_Nature_FocusedMind',
						rank: ['使你的战斗怒吼所提供的近战攻击强度加成和命令怒吼所提供的生命值加成提高5%。', '使你的战斗怒吼所提供的近战攻击强度加成和命令怒吼所提供的生命值加成提高10%。', '使你的战斗怒吼所提供的近战攻击强度加成和命令怒吼所提供的生命值加成提高15%。', '使你的战斗怒吼所提供的近战攻击强度加成和命令怒吼所提供的生命值加成提高20%。', '使你的战斗怒吼所提供的近战攻击强度加成和命令怒吼所提供的生命值加成提高25%。']
					},
					12: {
						name: '双武器专精',
						icon: 'Ability_DualWield',
						rank: ['使你的副手武器伤害提高5%。', '使你的副手武器伤害提高10%。', '使你的副手武器伤害提高15%。', '使你的副手武器伤害提高20%。', '使你的副手武器伤害提高25%。']
					},
					13: {
						name: '强化斩杀',
						icon: 'INV_Sword_48',
						rank: ['使你的斩杀技能的怒气值消耗减少2点。', '使你的斩杀技能的怒气值消耗减少5点。']
					},
					14: {
						name: '激怒',
						icon: 'Spell_Shadow_UnholyFrenzy',
						rank: ['使你在遭到敌人的爆击之后所进行的最多12次近战攻击都获得5%的额外伤害加值，效果持续12秒。', '使你在遭到敌人的爆击之后所进行的最多12次近战攻击都获得10%的额外伤害加值，效果持续12秒。', '使你在遭到敌人的爆击之后所进行的最多12次近战攻击都获得15%的额外伤害加值，效果持续12秒。', '使你在遭到敌人的爆击之后所进行的最多12次近战攻击都获得20%的额外伤害加值，效果持续12秒。', '使你在遭到敌人的爆击之后所进行的最多12次近战攻击都获得25%的额外伤害加值，效果持续12秒。']
					},
					16: {
						name: '强化猛击',
						icon: 'Ability_Warrior_DecisiveStrike',
						rank: ['使你的猛击技能的施放时间减少0.5秒。', '使你的猛击技能的施放时间减少1秒。']
					},
					17: {
						name: '横扫攻击',
						icon: 'Ability_Rogue_SliceDice',
						rank: ['<i class="Fl">30 怒气</i><br><i class="Fl">瞬发</i><i class="Fr">30秒冷却时间</i><br><i class="Fl">需要近战武器</i><br>需要战斗姿态<br>\
						你在接下来的10次近战攻击中可以攻击到一个额外的敌人。']
					},
					19: {
						name: '武器掌握',
						icon: 'Ability_Warrior_WeaponMastery',
						rank: ['使你的攻击被躲闪的几率降低1%，并使你受到的缴械效果持续时间缩短25%。', '使你的攻击被躲闪的几率降低2%，并使你受到的缴械效果持续时间缩短50%。']
					},
					20: {
						name: '强化狂暴之怒',
						icon: 'Spell_Nature_AncestralGuardian',
						rank: ['在使用狂暴之怒技能之后获得5点怒气值。', '在使用狂暴之怒技能之后获得10点怒气值。']
					},
					22: {
						name: '乱舞',
						icon: 'Ability_GhoulFrenzy',
						rely: 14,
						rank: ['在你的普通近战攻击打出爆击之后，使你的下3次近战攻击速度提高5%。', '在你的普通近战攻击打出爆击之后，使你的下3次近战攻击速度提高10%。', '在你的普通近战攻击打出爆击之后，使你的下3次近战攻击速度提高15%。', '在你的普通近战攻击打出爆击之后，使你的下3次近战攻击速度提高20%。', '在你的普通近战攻击打出爆击之后，使你的下3次近战攻击速度提高25%。']
					},
					24: {
						name: '精确',
						icon: 'Ability_Marksmanship',
						rank: ['使你的近战武器的命中几率提高1%。', '使你的近战武器的命中几率提高2%。', '使你的近战武器的命中几率提高3%。']
					},
					25: {
						name: '嗜血',
						icon: 'Spell_Nature_BloodLust',
						rely: 17,
						rank: ['<i class="Fl">30 怒气</i><i class="Fr">近战攻击距离</i><br><i class="Fl">瞬发</i><i class="Fr">6秒冷却时间</i><br>\
						立刻攻击目标，对其造成217点伤害。另外，你的下5次成功的近战攻击每次都可令你回复10点生命值。效果持续8秒。攻击强度会影响伤害的数值。']
					},
					26: {
						name: '强化旋风斩',
						icon: 'Ability_Whirlwind',
						rank: ['使你的旋风斩技能的冷却时间减少1秒。', '使你的旋风斩技能的冷却时间减少2秒。']
					},
					30: {
						name: '强化狂暴姿态',
						icon: 'Ability_Racial_Avatar',
						rank: ['在狂暴姿态下的攻击强度提高2%，威胁值降低2%。', '在狂暴姿态下的攻击强度提高4%，威胁值降低4%。', '在狂暴姿态下的攻击强度提高6%，威胁值降低6%。', '在狂暴姿态下的攻击强度提高8%，威胁值降低8%。', '在狂暴姿态下的攻击强度提高10%，威胁值降低10%。']
					},
					33: {
						name: '暴怒',
						icon: 'Ability_Warrior_Rampage',
						rely: 25,
						rank: ['<i class="Fl">20 怒气</i><br><i class="Fl">瞬发</i><br>\
						战士进入暴怒状态，攻击强度提高30点，大部分成功命中的近战攻击都可以令攻击强度继续提高30点。这个效果可以叠加最多5次，持续30秒。只能在打出爆击之后使用此技能。']
					}
				}
			},
			{
				text: '防护',
				icon: 'Ability_Warrior_DefensiveStance',
				texture: 'Protection_Warrior',
				talent: {
					0: {
						name: '强化血性狂暴',
						icon: 'Ability_Racial_BloodRage',
						rank: ['使你的血性狂暴技能激活时所产生的怒气值增加3点。', '使你的血性狂暴技能激活时所产生的怒气值增加6点。']
					},
					1: {
						name: '战术掌握',
						icon: 'Spell_Nature_EnchantArmor',
						rank: ['在改变姿态的时候可以保留的怒气值上限提高5点，同时极大提高你在防御姿态下使用嗜血和致死打击技能所造成的威胁值。', '在改变姿态的时候可以保留的怒气值上限提高10点，同时极大提高你在防御姿态下使用嗜血和致死打击技能所造成的威胁值。', '在改变姿态的时候可以保留的怒气值上限提高15点，同时极大提高你在防御姿态下使用嗜血和致死打击技能所造成的威胁值。']
					},
					2: {
						name: '预知',
						icon: 'Spell_Nature_MirrorImage',
						rank: ['使你的防御技能提高4点。', '使你的防御技能提高8点。', '使你的防御技能提高12点。', '使你的防御技能提高16点。', '使你的防御技能提高20点。']
					},
					5: {
						name: '盾牌专精',
						icon: 'INV_Shield_06',
						rank: ['使你用盾牌格挡攻击的几率提高1%，格挡成功所减免的伤害量提高20%。', '使你用盾牌格挡攻击的几率提高2%，格挡成功所减免的伤害量提高40%。', '使你用盾牌格挡攻击的几率提高3%，格挡成功所减免的伤害量提高60%。', '使你用盾牌格挡攻击的几率提高4%，格挡成功所减免的伤害量提高80%。', '使你用盾牌格挡攻击的几率提高5%，格挡成功所减免的伤害量提高100%。']
					},
					6: {
						name: '坚韧',
						icon: 'Spell_Holy_Devotion',
						rank: ['使你因装备而获得的护甲值提高2%。', '使你因装备而获得的护甲值提高4%。', '使你因装备而获得的护甲值提高6%。', '使你因装备而获得的护甲值提高8%。', '使你因装备而获得的护甲值提高10%。']
					},
					8: {
						name: '破釜沉舟',
						icon: 'Spell_Holy_AshesToAshes',
						rank: ['<i class="Fl">瞬发</i><i class="Fr">8分钟冷却时间</i><br>\
						激活之后，使你暂时获得相当于最大生命值30%的生命值，持续20秒。在效果解除之后，这些生命值会被扣除。']
					},
					9: {
						name: '强化盾牌格挡',
						icon: 'Ability_Defend',
						rely: 5,
						rank: ['使你的盾牌格档技能可以额外格档一次攻击，并使其有效时间延长1秒。']
					},
					10: {
						name: '强化复仇',
						icon: 'Ability_Warrior_Revenge',
						rank: ['使你的复仇技能有15%的几率令目标昏迷3秒。', '使你的复仇技能有30%的几率令目标昏迷3秒。', '使你的复仇技能有45%的几率令目标昏迷3秒。']
					},
					11: {
						name: '挑衅',
						icon: 'Ability_Warrior_InnerRage',
						rank: ['使你在防御姿态下由于攻击而造成的威胁值提高2%，并使你的精准等级提高2。', '使你在防御姿态下由于攻击而造成的威胁值提高10%，并使你的精准等级提高4。', '使你在防御姿态下由于攻击而造成的威胁值提高15%，并使你的精准等级提高6。']
					},
					12: {
						name: '强化破甲攻击',
						icon: 'ability_warrior_sunder',
						rank: ['使你的破甲攻击和毁灭打击所消耗的怒气值减少1点。', '使你的破甲攻击和毁灭打击所消耗的怒气值减少2点。', '使你的破甲攻击和毁灭打击所消耗的怒气值减少3点。']
					},
					13: {
						name: '强化缴械',
						icon: 'Ability_Warrior_Disarm',
						rank: ['使你的缴械技能的效果持续时间延长1秒。', '使你的缴械技能的效果持续时间延长2秒。', '使你的缴械技能的效果持续时间延长3秒。']
					},
					14: {
						name: '强化嘲讽',
						icon: 'Spell_Nature_Reincarnation',
						rank: ['使你的嘲讽技能的冷却时间减少1秒。', '使你的嘲讽技能的冷却时间减少2秒。']
					},
					16: {
						name: '强化盾墙',
						icon: 'Ability_Warrior_ShieldWall',
						rank: ['使你的盾墙技能的有效时间延长3秒。', '使你的盾墙技能的有效时间延长5秒。']
					},
					17: {
						name: '震荡猛击',
						icon: 'Ability_ThunderBolt',
						rank: ['<i class="Fl">15 怒气</i><i class="Fr">5码有效距离</i><br><i class="Fl">瞬发</i><i class="Fr">45秒冷却时间</i><br><i class="Fl">需要近战武器</i><br>\
						野蛮的攻击，令目标昏迷5秒。']
					},
					18: {
						name: '强化盾击',
						icon: 'Ability_Warrior_ShieldBash',
						rank: ['使你的盾击技能有50%的几率使目标沉默3秒。', '使你的盾击技能有100%的几率使目标沉默3秒。']
					},
					20: {
						name: '盾牌掌握',
						icon: 'Ability_Warrior_ShieldMastery',
						rank: ['使你的盾牌所吸收的伤害值提高10%。', '使你的盾牌所吸收的伤害值提高20%。', '使你的盾牌所吸收的伤害值提高30%。']
					},
					22: {
						name: '单手武器专精',
						icon: 'INV_Sword_20',
						rank: ['使你的单手近战武器伤害提高2%。', '使你的单手近战武器伤害提高4%。', '使你的单手近战武器伤害提高6%。', '使你的单手近战武器伤害提高8%。', '使你的单手近战武器伤害提高10%。']
					},
					24: {
						name: '强化防御姿态',
						icon: 'Ability_Warrior_DefensiveStance',
						rank: ['在防御姿态下受到的所有法术伤害减少2%。', '在防御姿态下受到的所有法术伤害减少4%。', '在防御姿态下受到的所有法术伤害减少6%。', '在防御姿态下受到的所有法术伤害减少8%。', '在防御姿态下受到的所有法术伤害减少10%。']
					},
					25: {
						name: '盾牌猛击',
						icon: 'INV_Shield_05',
						rely: 17,
						rank: ['<i class="Fl">20 怒气</i><i class="Fr">近战范围</i><br><i class="Fl">瞬发</i><i class="Fr">6秒冷却时间</i><br><i class="Fl">需要盾牌</i><br>\
						用盾牌击打目标，对其造成225到235点伤害（盾牌格档值会对伤害数值产生影响），并驱散目标身上的1个魔法效果，同时产生大量的威胁值。']
					},
					26: {
						name: '怒火专注',
						icon: 'Ability_Warrior_FocusedRage',
						rank: ['使你的所有攻击技能所消耗的怒气值降低1。', '使你的所有攻击技能所消耗的怒气值降低2。', '使你的所有攻击技能所消耗的怒气值降低3。', '使你的所有攻击技能所消耗的怒气值降低4。', '使你的所有攻击技能所消耗的怒气值降低5。']
					},
					29: {
						name: '活力',
						icon: 'INV_Helmet_21',
						rank: ['使你的耐力总值提高1%，力量总值提高2%。', '使你的耐力总值提高2%，力量总值提高4%。', '使你的耐力总值提高3%，力量总值提高6%。', '使你的耐力总值提高4%，力量总值提高8%。', '使你的耐力总值提高5%，力量总值提高10%。']
					},
					33: {
						name: '毁灭打击',
						icon: 'INV_Sword_11',
						rank: ['<i class="Fl">15 怒气</i><i class="Fr">5码有效距离</i><br><i class="Fl">瞬发</i><br>需要单手近战武器<br>\
						击碎目标的护甲，对其造成破甲效果。另外还可以造成50%的武器伤害，外加目标身上每层破甲效果所提供的35点伤害加成。破甲效果可以叠加最多5次。']
					}
				}
			}
		]
	}

	let main = $('#centr>.main'),
		data,
		li,
		key,
		reg = /.*(druid|hunter|mage|paladin|priest|rogue|shaman|warlock|warrior)\D*(\d*).*/i
	let getPoints = sort => {
		let p
		if (/[0-2]/.test(sort)) {
			p = 0
			for (let i in data[sort].talent) {
				p += data[sort].talent[i].size || 0
			}
		} else {
			p = 61
			for (let sort in data) {
				for (let i in data[sort].talent) {
					p -= data[sort].talent[i].size || 0
				}
			}
		}
		return p
	}

	let tim,
		footer = () => {
			let points = getPoints(),
				level = $('#talent>footer .level'),
				tal
			$('#talent>footer .points').html(points) //剩余点数
			points >= 61
				? level.parent().hide()
				: level
						.html(70 - points)
						.parent()
						.show() //等级
			for (let sort in data) {
				tal = tal ? tal + 6 : key
				for (let i in data[sort].talent) {
					tal += data[sort].talent[i].size
				}
				tal = tal.replace(/0*$/, '')
			}
			clearTimeout(tim) //hashchange事件
			$(window).off('hashchange', init)
			location.hash = tal.replace(/6*$/, '')
			tim = setTimeout(() => {
				$(window).on('hashchange', init)
			}, 200)
		}
	let tips = (sort, index) => {
		//设置Tips HTML
		let talent = data[sort].talent,
			rely = talent[index].rely
		return (
			talent[index].name +
			'<br>等级:' +
			talent[index].size +
			'/' +
			talent[index].rank.length +
			'<br>' +
			(rely && talent[rely].size < talent[rely].rank.length ? '<i class="rely">需要 ' + talent[rely].rank.length + '点 ' + talent[rely].name + ' </i>' : '') +
			(getPoints(sort) < parseInt(index / 4) * 5 ? '<i class="rely">需要 ' + parseInt(index / 4) * 5 + ' 点 ' + data[sort].text + ' 系天赋</i>' : '') +
			'<i class="rank">' +
			talent[index].rank[talent[index].size ? talent[index].size - 1 : 0] +
			'</i>' +
			(talent[index].size > 0 && talent[index].start === 'enable' ? '<i class="next">下一级</i><i class="rank">' + talent[index].rank[talent[index].size] + ' </i>' : '') +
			'<i class="learn">单击学习' +
			(talent[index].rank.length - talent[index].size > 1 ? ' 双击学满</i>' : '</i>') +
			(talent[index].size > 0 ? '<i class="forget">右键忘却</i>' : '')
		)
	}
	let getSize = (sort, index, size) => {
		//是否可以增加点数
		let talent = data[sort].talent,
			rely = talent[index].rely,
			points = getPoints()
		talent[index].size = talent[index].size || 0
		size = size === '+' ? talent[index].size + 1 : size === '-' ? talent[index].size - 1 : /^[0-5]$/.test(size) ? Number(size) : 0
		size = size < 0 ? 0 : size
		size = size > talent[index].rank.length ? talent[index].rank.length : size //点数不能大于最大点数
		size = rely && talent[rely].rank.length > talent[rely].size ? 0 : size //依赖点数必需点满
		size = getPoints(sort) < parseInt(index / 4) * 5 ? 0 : size //同系天赋需要相应点数
		size = points < size - talent[index].size && size > talent[index].size ? talent[index].size : size
		return size
	}
	let getStart = (sort, index) => {
		//图标状态
		let talent = data[sort].talent,
			rely = talent[index].rely
		return rely && talent[rely].rank.length > talent[rely].size ? 'default' : getPoints(sort) < parseInt(index / 4) * 5 ? 'default' : getPoints() <= 0 && talent[index].size <= 0 ? 'default' : talent[index].size >= talent[index].rank.length ? 'disable' : 'enable'
	}

	let updata = (sort, index) => {
		let talent = data[sort].talent
		talent[index].start = getStart(sort, index)
		li.eq(sort)
			.find('>div>div:eq(' + index + ')')
			.removeClass()
			.addClass(talent[index].start) //状态更新
		li.eq(sort)
			.find('>div>div:eq(' + index + ')>.Tips')
			.html(tips(sort, index)) //Tips 更新
	}

	let lower = (talent, row) => {
		let sum = 0
		for (let i in talent) {
			if (parseInt(Number(i) / 4) <= row) sum += talent[i].size
		}
		return sum
	}

	let change = (self, size) => {
		let sort = self.data('sort'),
			index = self.data('index'),
			talent = data[sort].talent,
			points = getPoints()
		size = getSize(sort, index, size)
		let diff = size - talent[index].size
		if (points < diff) return

		talent[index].size = size
		for (let i in talent) {
			let row = parseInt(Number(i) / 4)
			if (diff < 0) {
				//减少
				if (talent[i].rely === index && talent[i].size > 0) {
					//依赖
					talent[index].size -= diff
					return
				}
				if (row > parseInt(index / 4) && lower(talent, row - 1) < row * 5) {
					//有上级天赋存在
					if (talent[i].size > 0) {
						talent[index].size -= diff
						return
					} else if (talent[i].start !== 'default') {
						updata(sort, i)
					}
				}
			} else if (diff > 0) {
				if (talent[i].start === 'default' && lower(talent, row) >= row * 5) {
					updata(sort, i)
				}
			}
			if (talent[i].rely == index) {
				//依赖联动
				setTimeout(() => {
					updata(sort, i)
				}, 100) //需要异步执行
			}
		}
		updata(sort, index)
		if ((points <= 0 && diff < 0) || points - diff <= 0) {
			// 天赋点满或者满状态
			for (let sort in data) {
				for (let i in data[sort].talent) {
					if ((points <= 0 && diff < 0 && data[sort].talent[i].start === 'default') || (points - diff <= 0 && data[sort].talent[i].start === 'enable')) {
						updata(sort, i)
					}
				}
			}
		}
		self.children('.size').html(size + '/' + talent[index].rank.length) //点数更新
		li.eq(sort).find('>h4>.points').html(getPoints(sort)) //当前天赋点数
		footer()
	}

	let init = (_, tal) => {
		loading()
		tal = tal || location.hash
		if (!reg.test(tal)) {
			main.find('>h1>i').html('')
			main.children('.icons').addClass('select')
			main.find('>nav.icons>a').removeClass('act')
			$('#talent').hide()
			return
		}
		key = tal.replace(reg, '$1').toLowerCase()
		tal = tal.replace(reg, '$2')
		data = talentData[key]
		let site = []
		if (/^[0-5]+$/.test(tal)) {
			let index = 0
			tal = tal.split('')
			data.forEach((item, sort) => {
				for (let i in item.talent) {
					site[sort] = site[sort] ? site[sort] + tal[index] : tal[index]
					index++
				}
			})
		} else {
			tal.split('6').forEach(item => {
				site.push(item)
			})
		}
		main.children('.icons').removeClass('select')
		let nav = main.find('>nav.icons>a')
		for (let i = 0; i < nav.length; i++) {
			if (new RegExp(key).test(nav[i].className)) {
				nav[i].className = key + ' act'
				main.find('>h1>i').html(nav[i].innerText)
			} else {
				nav[i].className = nav[i].className.replace(' act', '')
			}
		}
		li = $('#talent')
			.css('display', 'inline-block')
			.on('contextmenu', e => {
				e.preventDefault()
			})
			.children('li')
			.on('selectstart', e => {
				e.preventDefault()
			})
		data.forEach((item, sort) => {
			let talent = item.talent,
				h = ''
			li.eq(sort)
				.find('>h4>.icon>img')
				.attr('src', 'Icons/' + item.icon + '.jpg')
			li.eq(sort).find('>h4>.text').html(item.text)
			let index = 0
			for (let i = 0; i < 36; i++) {
				if (talent[i]) {
					talent[i].size = getSize(sort, i, site[sort] ? site[sort][index] : 0)
					talent[i].start = getStart(sort, i, site[sort] ? site[sort][index] : 0)
					h +=
						'<div data-sort="' +
						sort +
						'" data-index=' +
						i +
						' class="' +
						talent[i].start +
						'">\
					<div class="mask"></div>\
					<p class="Tips">' +
						tips(sort, i) +
						'</p>\
					<img src="Icons/' +
						talent[i].icon +
						'.jpg">' +
						(talent[i].rely ? '<i class="arrow' + (i - talent[i].rely) + '"></i>' : '') + //箭头
						'<i class="size">' +
						talent[i].size +
						'/' +
						talent[i].rank.length +
						'</i>' +
						'</div>'
					index++
				} else {
					h += '<div></div>' //空白占位
				}
			}
			for (let sort in data) {
				for (let i in data[sort].talent) {
					updata(sort, i)
				}
			}
			li.eq(sort).find('.points').html(getPoints(sort)) //当前天赋点数
			li.eq(sort)
				.find('.talent')
				.css('backgroundImage', 'url(Textures/' + item.texture + '.jpg)')
				.html(h)
				.find('.mask')
				.on({
					mousedown: e => {
						let self = $(e.target).parent()
						if (e.button === 0) {
							//单击
							if (!self.hasClass('enable')) return
							change(self, '+')
						} else if (e.button === 2) {
							//右击
							if (self.hasClass('default')) return
							change(self, '-')
						}
						return false
					},
					dblclick: e => {
						let self = $(e.target).parent()
						if (!self.hasClass('enable')) return
						change(self, 5)
						return false
					}
				})
		})
		footer()
	}
	init()
	$(window).on('hashchange', init)

	$('.reset').map((sort, item) => {
		//重置天赋
		$(item).click(() => {
			if (/[0-2]/.test(sort)) {
				let talent = data[sort].talent
				for (let i in talent) {
					if (talent[i].start !== 'default') {
						let self = li.eq(sort).find('>div>div:eq(' + i + ')')
						talent[i].size = 0
						talent[i].start = i < 4 && !talent[i].rely ? 'enable' : 'default'
						self.removeClass().addClass(talent[i].start) //状态更新
						self.find('.Tips').html(tips(sort, i)) //Tips 更新
						self.children('.size').html('0/' + talent[i].rank.length) //点数更新
					}
				}
				li.eq(sort).find('>h4>.points').html(0) //当前天赋点数
				if (getPoints() > 0) {
					for (let sort in data) {
						let talent = data[sort].talent
						for (let i in talent) {
							if (talent[i].start === 'default') {
								updata(sort, i)
							}
						}
					}
				}
				footer()
			} else {
				$('.reset:eq(0)').click()
				$('.reset:eq(1)').click()
				$('.reset:eq(2)').click()
			}
		})
	})

	//导入数据
	$('footer > .Fr > .iconfont:not(.reset)').click(() => {
		let tal = prompt('支持其它网站数据导入(包含职业和学习点数数据),比如:\n warlock.shtml?5502022012231115512\n', location.href)
		if (tal && tal !== location.href) init(null, tal)
	})
})(jQuery)
